{"pages": {"2417085": {"pageid": 2417085, "ns": 3, "title": "User talk:Rms125a@hotmail.com", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "diff": {"from": 628351094, "to": 628524704, "*": "<tr>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 260:</td>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 260:</td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>Disagree with you; we should mention the age dispute and cite the years given. Please do not remove the sources, which include books, documents and interviews. There is no consensus on her talk page. The last edit says the US Census is not considered a proper [[Wikipedia: No original research|secondary source]].[[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 16:32, 5 October 2014 (UTC) ''BTW, Thank you for your hard work on [[Janet Waldo]]'s article. Appreciate it.''</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>Disagree with you; we should mention the age dispute and cite the years given. Please do not remove the sources, which include books, documents and interviews. There is no consensus on her talk page. The last edit says the US Census is not considered a proper [[Wikipedia: No original research|secondary source]].[[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 16:32, 5 October 2014 (UTC) ''BTW, Thank you for your hard work on [[Janet Waldo]]'s article. Appreciate it.''</div></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>== Greetings ==</div></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>Hope you are ok my friend, hope to chat again [[User:Zafiraman|Zafiraman]] ([[User talk:Zafiraman|talk]]) 19:30, 6 October 2014 (UTC)</div></td>\n</tr>\n\n<!-- diff cache key enwiki:diff:wikidiff2:1.12:old-628351094:rev-628524704:1.10.0 -->\n"}, "*": "{{Archive box|[[/Archive 1|Archive 1]] [[/Archive 2|Archive 2]] [[/Archive 3|Archive 3]] [[/Archive 4|Archive 4]] [[/Archive 5|Archive 5]] [[/Archive 6|Archive 6]] [[/Archive 7|Archive 7]] [[/Archive 8|Archive 8]] [[/Archive 9|Archive 9]] [[/Archive 10|Archive 10]] [[/Archive 11|Archive 11]]\n}}\n\n{{warning/sandbox|'''To anyone who has a question about my username please be advised that I will not be changing it, although I did change my signature. Thanks for your understanding.'''<br>'''''NOTE:'''''<br>Robert is one of the few editors who is not obliged to change his username, as his account was created many years before the rules were changed - [[User:Alison|<span style=\"color:#FF823D;font-family: comic sans ms\">'''A<font color= \"#FF7C0A\">l<font color= \"#FFB550\">is</font>o</font>n'''</span>]] <sup>[[User_talk:Alison|❤]]</sup> 02:50, 22 January 2010 (UTC)}}\n\n{{bots|deny=DPL bot}}\n\n==Words of wisdom from a cherished source==\n: Robert - feel free to blank this again, as is your right, but can I just ask you to slow down for a minute and step back from this? You're fast approaching old territory again. I know you mean well here, and I've supported you in the past. Just ... chill, take it easy, and careful with the comments about others - [[User:Alison|<span style=\"color:#FF823D;font-family: comic sans ms\">'''A<font color= \"#FF7C0A\">l<font color= \"#FFB550\">is</font>o</font>n'''</span>]] <sup>[[User_talk:Alison|❤]]</sup> 22:02, 4 December 2009 (UTC)\n\n=='''DELETION OF INFOBOXES'''==\nI occasionally delete infoboxes from articles I have edited if the infobox in question is almost empty or otherwise of little or no utility, based on the following from [[WP:MOS]] (Wikipedia:Manual of Style (infoboxes)): ''“The most important group to consider are the casual readers of Wikipedia, who will never do any significant editing. Infobox templates that contain many blank fields, question marks and unknowns present an unprofessional appearance, diminishing Wikipedia’s reputation as a high-quality encyclopedia.”'' [[User:Rms125a@hotmail.com|<font color=\"orange\">'''''Quis separabit?'''''</font>]] 22:46, 23 October 2011 (UTC)\n\n==Edna O'Brien Article==\nI removed the Philip Larkin quote from the [[Edna O'Brien]] because I felt it was very obtuse to content of the actual article. Yes, O'Brien \"talked about sex\" before the \"sexual revolution\" but despite how well-known the Philip Larkin poem is as pertaining to this period, it sounds absolutely obtuse to somebody who has not read the poem. While the reference is kind of funny, I strongly feel that Philip Larkin cannot be trust to be some sort of [[Dionysius Exiguus]] as to precisely dating the \"sexual revolution\", unless of course you know of a case where O'Brien mentions the situation herself, as pertaining to the line of the poem. As it stands, Larkin seems to have said nothing about Edna O'Brien's career directly, (and she seems to have said nothing about his. Robinson, Roth, O'Hagan and the others are specifically talking about her career. The fact that Larkin is mentioned at all is because some genius at the Telegraph wanted a good opening.\n\nBesides saying \"three years before the Chatterlay Ban and the Beatles First LP\" sounds to somebody who doesn't know the poem (and evens some who do)...\n\n1. Like it the publication of ''Country Girls'' three years before the expurged publication of ''Lady Chatterlay's Lover'', at which point Ms. O'Brien would have been \"introducing sexual intercourse to Ireland\" at the tender age of negative five years old.\n\n2. Like the expurged publication of ''Lady Chatterlay's Lover'' was the same date as the Beatle's First LP.\n\n3. Like nobody talked about or had sex before Philip Larkin first had sex, a time which he admits was rather late. \n\nThis would be clever writing if it were in a newspaper, or even an academic article, but on Wikipedia, it feels like we're shoe-horning in a reference where it does not belong. I would strongly suggest removing it, if for no other reason than translation. Philip Larkin is largely an Anglo-American phenomena, and Ms. O'Brien's books are still widely translated.\n\nIf you do want to keep it, I would strongly suggest writing at least a rudimentary article about Annus Mirabilis so that everybody who is confused about the reference is simply redirected to the Philip Larkin page and assumes something sexual about his and Ms. O'Brien's relationship (which I'm certain never existed).\n\nP.S. I only slightly edited this on realizing it was a quote from a review. But I stand by what I said. The reference is quite obtuse and there are far better ways about talking about the sociological effect of Ms. O'Brien's writings about sex.\n--[[User:Artimaean|Artimaean]] ([[User talk:Artimaean|talk]]) 01:19, 12 January 2013 (UTC)\n\n:So are you saying you don't mind my deleting the Philip Larkin line?--[[User:Artimaean|Artimaean]] ([[User talk:Artimaean|talk]]) 23:18, 12 January 2013 (UTC)\n\n==Tehrani==\nIndeed. [[WP:N|Notability]] does not depend on having English-language sources about you; the featured article [[Chrisye]] is built almost entirely on Indonesian-language references. That being said, if I'm not mistaken Google Translate handles Farsi, in which case the references should be fairly easy to verify.&nbsp;—&nbsp;[[User:Crisco 1492|Crisco 1492]] ([[User talk:Crisco 1492|talk]]) 23:01, 24 February 2013 (UTC)\n\n==Spaces between parameters in citation templates==\nHello, I would like to ask you not to close up any spaces you may find between the parameters in citations that use templates, as you have at [[Jimmy Savile]]. These spaces have been deliberately put there by me and others. It makes no difference to the output that the reader sees, but it improves the layout of the editing window and the diffs, so clarifying what is where and making editing easier. Thanks -- [[User:Alarics|Alarics]] ([[User talk:Alarics|talk]]) 09:55, 2 March  2013 (UTC)\n\n==Dick Coetzee==\nWhile I can appreciate the need for fairness on the Wiki, stripping the Vlakplaas reference from Coetzee is akin to writing an article about Heinrich Himmler without mentioning the SS or Josef Mengele without mentioning Auschwitz.  It is part of the legacy.  He was commander of a police group that went out and acted as a death squad without regard or remorse.  he did not deny it and was pardoned only from prosecution after he turned evidence over to the UN and those investigating war crimes.  I have left off the apartheid reference, but replaced the Vlakplaas reference on his tag line.  He once gave an account of what it was like to barbeque someone on a spit, including the smell of the meat. Here is some further reading on the subject. http://www.dailymaverick.co.za/article/2013-03-08-jacques-pauw-on-vlakplaas-apartheid-assassin-dirk-coetzee/  [[User:Sunnydoo|Sunnydoo]] ([[User talk:Sunnydoo|talk]]) 08:14, 8 March 2013 (UTC)\n\n==Categories==\nHello. Thank you for setting me straight on the Category: Disease-Related Deaths. Now that I understand what it categorizes, it does make sense as a catch-all category. The only problem I see with it is how huge the list would be, and what use would someone make of it. For instance, I gather statistics on specific causes of death, and the category lists are very useful to me. I just don't know if it's necessary to have such a general category. Those are my thoughts. - [[User:Michael David|Michael David]] ([[User talk:Michael David|talk]]) 19:15, 29 March 2013 (UTC)\n\n: :-) I love your Edit Summary on the revision of the Fay Kanin article. To truly see the light, you have to first admit to having been in the darkness. I was. -  [[User:Michael David|Michael David]] ([[User talk:Michael David|talk]]) 21:59, 29 March 2013 (UTC)\n\n==[[Robert James Carlson]]==\nYou added a neutrality banner to [[Robert James Carlson]] on June 14, 2011. There's little of note on its Talk page. Can you explain the POV problem? Is it just the paragraph re Saint Stanislaus Kostka Church, under \"Views\"? Thx. [[User:Bmclaughlin9|Bmclaughlin9]] ([[User talk:Bmclaughlin9|talk]]) 00:01, 8 April 2013 (UTC)\n\n==POV==\nIf RS sources report that person x though y about z, that is not \"POV\".  If reported as such.  POV is wp editor POV.  Similarly, the article already has a \"puppy dog\" description of one brother -- it is in the article for the same reason.  Thus, please do not delete RS supported views of person x by person y, under the theory that they are \"pov.\"  Furthermore, no blp issues apply.  And, even if they did, we report what the RSs say, with a public figure.--[[User:Epeefleche|Epeefleche]] ([[User talk:Epeefleche|talk]]) 21:02, 21 April 2013 (UTC)\n\n==[[Bobby (Bangladeshi actress)]]==\nHi! I saw you moved the page from Eamin Haque Bobby, though the actress is popularly known as Bobby but I guess the previous title was more accurate since you can get more sources through searching with that name. Thanks --[[User:Kmzayeem|<font style=\"font-size:18px\" color=\"#848482\" face=\"Ransom\">Zayeem</font>]] <sup> [[User talk:Kmzayeem|<font color=\"#483C32\">'''''(talk)'''''</font>]]</sup> 12:01, 2 May 2013 (UTC)\n\n==Question concerning Audrey Meadows' place of birth and year of birth==\nI didn't know that Ancestry.com was the final authority on the truth of personal information about people, including celebrities. Innumerable web sites and almanacs state that Audrey Meadows was born in WuChang, China. Does Ancestry.com automatically trump all other information sources? Is Ancestry.com infallible? I think not.\n\nAlso, Ancestry.com and Wikipedia state that Meadows was born in 1922. If you click on her Find A Grave link, you will see that her gravesite is inscribed with the year 1926.\n\nWe all know that hearsay can be highly unreliable and inaccurate. The ONLY person who can positively verify  Audrey Meadows' place of birth and year of birth is Audrey's mother. If Audrey herself had told you that she was born in New York City, the statement would be hearsay.\n\nNew York City vs. WuChang, China and 1922 vs. 1926. How do you know when you have the truth? That can be a difficult question to answer.\n\n[[User:Anthony22|Anthony22]] ([[User talk:Anthony22|talk]]) 23:41, 17 May 2013 (UTC)\n\n== FYI ==\n\nYip Doesn't hate you.  Yip got all of his data from [[User:Sallieparker|Sallieparker]]'s talk page (including your name and mother's name).  I was posing as her in an effort to get her block (which looks like it's going to be lifted) extended.  \"Greasing the wheels of justice\" when WP gets stuck.\n\nSeriously, check out her talk page before an admin takes it down. I have no issue with you (and you actually seem like a stand up editor - one of the reasons why I took issue with Ms. Parker's boychick comment).  That being said, I don't know you and have no intention of finding anything about you in the \"world\".\n\n[[User:CongerEelSolo|CongerEelSolo]] ([[User talk:CongerEelSolo|talk]]) 00:19, 20 June 2013 (UTC)\n\n==[[Islamberg, New York]]==\nThanks for that, glad I could help out! I'm not much of an editor these days, but I use the site and understand the policies for the most part, so I think it's good to clear up things like that when we see them. [[User:Lordrosemount|Lordrosemount]] ([[User talk:Lordrosemount|talk]]) 18:47,  26 June 2013 (UTC)\n\n==Cher==\nFirst of all, thanks for you helpful edits! I will do some minor changes according to what I've talked to other users on previous PR's. If you don't agree with some change I'll made, we can discuss on the talk page. Cheers, [[User:Lordelliott|Lordelliott]] ([[User talk:Lordelliott|talk]]) 23:14, 9 October 2013 (UTC)\n\n:Hi! I've made the changes. I've restored this passage: \"Throughout the 1980s, Cher appeared in film roles where she served as a social intermediary to disenfranchised male characters.[210] She showcased her status as an independent woman by interacting with Eric Stoltz's elephantiasis victim in Mask (1985), Liam Neeson's mute homeless veteran in Suspect (1987), and Nicolas Cage's socially isolated baker with a wooden hand in Moonstruck (1987).[210] Mermaids (1990) made use of her \"strong, sexually assertive\" image.[211] According to Jeff Yarbrough of The Advocate, Cher was \"one of the first superstars to 'play gay' with compassion and without a hint of stereotyping\", as she portrayed a lesbian in the 1983 film Silkwood.[212]\"\n\n:Why do you think it isn't valuable to the article? We can discuss on the article's talk page. Overall, great work. [[User:Lordelliott|Lordelliott]] ([[User talk:Lordelliott|talk]]) 00:10, 10 October 2013 (UTC)\n\n==A barnstar for you!==\n{| style=\"background-color: #fdffe7; border: 1px solid #fceb92;\"\n|rowspan=\"2\" style=\"vertical-align: middle; padding: 5px;\" | [[File:Civility Barnstar Hires.png|100px]]\n|style=\"font-size: x-large; padding: 3px 3px 0 3px; height: 1.5em;\" | '''The Civility Barnstar'''\n|-\n|style=\"vertical-align: middle; padding: 3px;\" | For reporting [[Joan Crawford]] to [[WP:RFPP]], and alerting me to my typo. [[User:Bearian|Bearian]] ([[User talk:Bearian|talk]]) 20:26, 10 October 2013 (UTC)\n|}\n\n==[[Doris Roberts]]==\nI almost never preview. There's always the risk that I'll lose my work. In this case I had no idea what to do after I saw it, and figured either I could figure out later how to fix it or someone else could.— [[User:Vchimpanzee|<font color=\"Green\">Vchimpanzee</font>]]&nbsp;'''·''' [[User talk:Vchimpanzee|<span style=\"color: orange\"> talk</span>]]&nbsp;'''·''' [[Special:Contributions/Vchimpanzee|<span style=\"color: maroon\">contributions</span>]]&nbsp;'''·''' 18:29, 18 October 2013 (UTC)\n:Clicking on \"help\", amazingly, led to something that actually helped. I didn't have the time to solve the problem yesterday and the computer where I was then was harder to use.— [[User:Vchimpanzee|<font color=\"Green\">Vchimpanzee</font>]]&nbsp;'''·''' [[User talk:Vchimpanzee|<span style=\"color: orange\"> talk</span>]]&nbsp;'''·''' [[Special:Contributions/Vchimpanzee|<span style=\"color: maroon\">contributions</span>]]&nbsp;'''·''' 18:35, 18 October 2013 (UTC)\n\n== Re: ==\n\n[[Wikipedia:Sockpuppet investigations/Brunodam/Archive|DNFTT]] ;) \n:--[[User:Vituzzu|Vituzzu]] ([[User talk:Vituzzu|talk]]) 16:21, 8 November 2013 (UTC)\n\n::'''I am astonished to see that I am accused of being a sockpuppet and blocked. I am even outraged because I feel humiliated with this accusation. An accusation of being \"user Brunodam\" without proof, even if I offered to submit my personal data. I demand justice. I am going to complain to the \"Better Business Bureau of Florida\" and to the Police department of Fort Lauderdale, following instructions from my attorney about this clear case of harassment & offense. ''I will ask for damages''. Junior5 ''' This is what I wrote last July 2013 on my defense  (quickly erased by the italian wikipedia \"mafia leader\" Vituzzu on that archive) about the accusation of being a vandal: I AM NOT THAT PERSON! and  I will show evidences and proofs of this to a judge. M.R.  <span style=\"font-size: smaller;\" class=\"autosigned\">— Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[Special:Contributions/63.92.226.201|63.92.226.201]] ([[User talk:63.92.226.201|talk]]) 16:22, 9 November 2013 (UTC)</span><!-- Template:Unsigned IP --> <!--Autosigned by SineBot-->\n:::[//meta.wikimedia.org/w/index.php?title=Special%3AGlobalBlockList&ip=63.92.226.201 Answered], ty. --[[User:Vituzzu|Vituzzu]] ([[User talk:Vituzzu|talk]]) 19:53, 10 November 2013 (UTC)\n\n==Hedy Lamarr==\nLong time no chat. Sorry if you already know all this: we can't cite unpublished/unverifiable sources for a fact in an article footnote, such as an email to you, as in [https://en.wikipedia.org/w/index.php?title=Hedy_Lamarr&diff=prev&oldid=568815969 this edit]. I won't revert, because the book agrees. But it is ''best practice'' with private sources to bring OTRS into it. So, forward the email discussion you had with Loder (the less edited the better) to OTRS (volunteers-otrs(at)wikimedia.org) requesting that OTRS confirm on article Talk or in the article edit summary, \"1914 verified - OTRS ticket #####\". OTRS does that when contacted by the public, to throw an anchor onto disputes over birth year. Alternatively, have Hedy's son email them directly. But either way, please, in the introductory text of the email, include some way to verify that the email really did come from Loder (phone number, or website which shows the email address, or business contact, book, journal article etc. Not facebook, myspace, etc).  I've done it before - if questions, ask. --[[User:Lexein|Lexein]] ([[User talk:Lexein|talk]]) 14:40, 11 November 2013 (UTC) ''Please respond here - I watchlist.''\n:Bump - I don't mean to be a pest, but I'd like to help lock down the birthdate, by getting your email into OTRS if possible. Can I help? --[[User:Lexein|Lexein]] ([[User talk:Lexein|talk]]) 07:34, 18 November 2013 (UTC)\nJust wonder why you deleted the hedy-lamarr.org link i posted on her page and stated that it was redundant? It's not on the list and it's a very thorough website that I have developed from many books and magazines.  <small><span class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Annpham|Annpham]] ([[User talk:Annpham|talk]] • [[Special:Contributions/Annpham|contribs]]) 22:08, 27 November 2013 (UTC)</span></small><!-- Template:Unsigned --> <!--Autosigned by SineBot-->\n\nThe website already listed is hedylamarr.org. The page I added is hedy-lamarr.org. There's a dash sign between hedy and lamarr. That's a completely different website--[[User:Annpham|Annpham]] ([[User talk:Annpham|talk]]) 22:24, 27 November 2013 (UTC)\n\n== Christopher Pyne ==\n\nHi. I realise this was a long time ago, but regarding [https://en.wikipedia.org/w/index.php?title=Christopher_Pyne&diff=563297150&oldid=563272529 this edit] - where did you get the idea that Pyne was the second-youngest MP ever? When he was elected, he was the ''tenth'' youngest MP (ahead of him: [[Edwin Corboy]], [[Andrew Jones (Australian politician)|Andrew Jones]], [[Charles Frazer]], [[Peter Shack]], [[Bill Falkinder]], [[Bert Lazzarini]], [[Christian Zahra]], [[Gary Punch]] and [[Malcolm Fraser]] himself). I saw this repeated in the SMH today and was shocked to find they'd got it from us! I only ask because if it came from a source, I may need to dig up another source to correct it (rather than my own maths). Pyne doesn't claim this himself, does he?? [[User:Frickeg|Frickeg]] ([[User talk:Frickeg|talk]]) 11:19, 4 December 2013 (UTC)\n(Edit: he was, of course, elected before Zahra was, so the ninth youngest. The point still stands, though.) [[User:Frickeg|Frickeg]] ([[User talk:Frickeg|talk]]) 11:26, 4 December 2013 (UTC)\n:The first one is a mirror of yesterday's SMH article; the second just states that he was the youngest MP at the time of his election. [[User:Frickeg|Frickeg]] ([[User talk:Frickeg|talk]]) 19:35, 4 December 2013 (UTC)\n\n== [[Scott Miller (pop musician)]] ==\n\nThank you for your edits and attention! I will follow up on cn tags later this week. About your additions to the lede & personbox, I wanted to run my thoughts by you before any rv. I think Miller's engineering career and inventorship adds useful detail to the article body, but I don't believe he is sufficiently notable in those fields to merit attention in the lede & personbox. Happy holidays! [[User:Lwarrenwiki|Lwarrenwiki]] ([[User talk:Lwarrenwiki|talk]]) 20:08, 24 December 2013 (UTC)\n\nI'm not disputing or reverting your recent tweak, but I'm trying to understand what you have in mind so I can do better next time. I am planning a future edit in a few days, in which I'll move all of the refs (making them [[WP:LDRHTG|list-defined refs]]) for easier maintenance. Earlier today, I went through all refs in the article to make all date formats consistent, according to one of the acceptable [[WP:DATEFORMAT]] choices (#4 in [[WP:DATEFORMAT|the table]]). You then tweaked some refs to spell out the month, which of course isn't wrong but introduced an inconsistency. So basically, I'm trying to square your edits with the guidelines in [[WP:CITEVAR]] which suggest that internal consistency is important, and we should generally leave well enough alone, rather than impose our style preferences on other editors. Please understand that I'm perfectly OK with generally adopting your style preferences, in order to avoid any inconsistency or conflict over minor matters of style. I just want to be sure I understand what your edits are directed toward, so I can stay consistent. [[User:Lwarrenwiki|Lwarrenwiki]] ([[User talk:Lwarrenwiki|talk]]) 21:11, 13 January 2014 (UTC)\n\n==Happy New Year!==\nThank you for what you do for Wikipedia. Happy New Year![[User:RFD|RFD]] ([[User talk:RFD|talk]]) 23:33, 31 December 2013 (UTC)\n\n==A barnstar for you!==\n{| style=\"background-color: #fdffe7; border: 1px solid #fceb92;\"\n|rowspan=\"2\" style=\"vertical-align: middle; padding: 5px;\" | [[File:Tireless Contributor Barnstar Hires.gif|100px]]\n|style=\"font-size: x-large; padding: 3px 3px 0 3px; height: 1.5em;\" | '''The Tireless Contributor Barnstar'''\n|-\n|style=\"vertical-align: middle; padding: 3px;\" | For your excellent contributions to many articles on Wikipedia!!! [[User:Gidonb|gidonb]] ([[User talk:Gidonb|talk]]) 14:26, 5 January 2014 (UTC)\n|}\n\n==A barnstar for you!==\n{| style=\"background-color: #fdffe7; border: 1px solid #fceb92;\"\n|rowspan=\"2\" style=\"vertical-align: middle; padding: 5px;\" | [[File:Team Barnstar Hires.png|100px]]\n|style=\"font-size: x-large; padding: 3px 3px 0 3px; height: 1.5em;\" | '''The Teamwork Barnstar'''\n|-\n|style=\"vertical-align: middle; padding: 3px;\" | Hey! What's up? Thanks for your appreciation for my edit on Dick Wolf being inducted into the Television Hall of Fame. Hope to hear from you again soon on Wikipedia. [[User:Mr. Brain|Mr. Brain]] ([[User talk:Mr. Brain|talk]]) 00:27, 24 February 2014 (UTC)\n|}\n\n==Thanks==\nThank you for your kind words. The process is more important than the outcome. It's by taking part that we improve our debating skills :) Note I have no dog in this fight. I have not created the article, nor did I make a single contribution to it. I'm doing it more for my sense of what Wikipedia should be than for this particular article. I'd like to point to you that your signature only gives a link to your user page. If you've thought about it and this is how you want it then ok, but I thought I'd mention it because seem to prefer to receive messages on your talk page. You're more likely to never have people touch your user page if you change your signature a little bit. <small><font style=\"color:#C0C0C0;font-family:Courier New;\">Contact </font><font style=\"color:blue;font-family:Courier-New;\">[[User:Basemetal|Basemetal]]</font> <font style=\"color:red;font-family:Courier-New;\">[[User talk:Basemetal|here]]</font></small> 13:05, 25 February 2014 (UTC)\n\n==Ugly ownership screaming at Hanged, Drawn and Quartered==\nUnfortunately, there is a cabal at [[Hanged, Drawn and Quartered]] who refuses inclusion of the following template there:\n{{Capital Punishment}}\nI think the template is very illuminative, and should be ''de rigeur'' at execution pages. What do you think?[[User:Arildnordby|Arildnordby]] ([[User talk:Arildnordby|talk]]) 10:41, 2 March 2014 (UTC)\n\n==[[Paco de Lucía]]==\nIn [https://en.wikipedia.org/w/index.php?title=Paco_de_Luc%C3%ADa&diff=prev&oldid=597879585 this] edit you say he was named Gomes and not Gomez, but the source write it with a \"z\". [[User:Christian75|Christian75]] ([[User talk:Christian75|talk]]) 23:39, 2 March 2014 (UTC)\n\nNo, [[Paco de Lucía|Paco]] and [[Pepe de Lucía]]'s mother, Lucia Gomes, was Portuguese and her surname was Gomes, not Gómez. Evidently I missed something when I was corrected the surname. Thanks.\n\nYours, [[User:Rms125a@hotmail.com|<font color=\"orange\">'''''Quis separabit?'''''</font>]] 00:13, 3 March 2014 (UTC)\n\n==[[WP:Italics]]/[[Anne Heche]] article==\nHello, Rms125a@hotmail.com. With regard to the Anne Heche article, I can't yet decipher all of what you changed; I'm sure I'll disagree with your definition of \"promotion\" in this case once I do decipher all of it (though I likely won't revert/raise the matter as an issue). But, with regard to using italics for the entire quotes, that violates WP:Italics (which has a Quotations subsection in addition to the other subsections it has, such as with regard to what is appropriate emphasis). [[User:Flyer22|Flyer22]] ([[User talk:Flyer22|talk]]) 16:24, 6 March 2014 (UTC)\n\nAlso, if you reply to me about this, I'd prefer that you reply here at your talk page so that the discussion is kept in one place. [[User:Flyer22|Flyer22]] ([[User talk:Flyer22|talk]]) 16:25, 6 March 2014 (UTC)\n\nOn a side note: Regarding [https://en.wikipedia.org/w/index.php?title=Anne_Heche&diff=598415960&oldid=598414595 this], be careful with the word ''claim''; I usually remove that word (plural or not), per [[WP:CLAIM]]. The only reason that I did not remove it from the [https://en.wikipedia.org/w/index.php?title=Anne_Heche&diff=598415960&oldid=598414595#Early_life gay father bit] (which was there before your edits to that section today) is because Heche is making a serious/heavy claim about a person. But for Heche stating that she was \"[[insane]] for the first 31 years of her life,\" the word ''claims'' absolutely should not be used. Regarding the messages you left [https://en.wikipedia.org/w/index.php?title=User_talk:Flyer22&diff=598416612&oldid=598416558#Anne_Heche on my talk page], blockquotes are not much better because, per [[WP:Blockquote]], quotes should be a certain length (the length WP:Blockquote specifies) before being put into blockquote. And too many blockquotes can give an article a messy look. As for having split this discussion because you were late to getting my second message above, no worries; I will simply post a [[WP:Permalink]] (a second if required) of this discussion there, which will show the complete discussion. I was able to deduce, from seeing your talk page, that you split discussions; that is what propelled to me to request that you don't split this one. [[User:Flyer22|Flyer22]] ([[User talk:Flyer22|talk]]) 16:48, 6 March 2014 (UTC)\n\n:: [[User:Flyer22|Flyer22]]: Oh, good. I don't know how to do Permalinks and stuff like that. No excuses, just never learned. Too lazy, old dog, new tricks, etc. Although I must point out that I wasn't exactly ''\"late to getting my second message above\"''; if anything I guess I responded too quickly to your first message! Funny, that! <br> ::: Thanks for the advice re [[WP:CLAIM]]. Yours, [[User:Rms125a@hotmail.com|<font color=\"orange\">'''''Quis separabit?'''''</font>]] 16:55, 6 March 2014 (UTC)\n::::[https://en.wikipedia.org/w/index.php?title=User_talk:Flyer22&diff=598421472&oldid=598421194#Anne_Heche For documentation], in case you or anyone else reading this section wants quick access to the full discussion. [[User:Flyer22|Flyer22]] ([[User talk:Flyer22|talk]]) 17:11, 6 March 2014 (UTC)\n\n==Thanks for the thanks==\nI'm slowly getting through the backlog for Wikiproject Cities unassessed articles. I'm sure that I'll clear a few more of those Louisiana ones for you, shortly. I'm glad that somebody is showing the love. All the best, [[User:EP111|EP111]] ([[User talk:EP111|talk]]) 14:01, 10 March 2014 (UTC)\n\n==L'Wren Scott==\nThanks Robert for developing this crucial page that was incredibly visited by 222,000 viewers just yesterday... http://stats.grok.se/en/latest/L%27Wren_Scott It needed a great revamp though and adding of missing pieces, like her previous marriage, circumstances of her suicide and financial status of her businesses which I now have reworked. Plus some more controversial matters like her name. By the way, I never heard of the name of this designer until today, but somehow her life fascinated me as I made further research on her life and career. So sad though about her fate. [[User:Werldwayd|werldwayd]] ([[User talk:Werldwayd|talk]]) 22:42, 18 March 2014 (UTC)   ‎\n\n==Jack Little (politician)==\nYou claimed that Jack Little was one of two non-Catholics in the ALP (anti-Communist), the original name of the DLP, in the Victorian Parliament, whereas previously it was stated that he was the only one. He was the only non-Catholic. The other non-Catholic parliamentarian was Robert Joshua, the House of Representatives Member for Ballarat, and the leader of the ALP (anti-Communist) in the federal parliament. Joshua was never a member of the Victorian Parliament. The original comment was correct, and should be changed back, or at least qualified with a reference to Joshua's membership of the federal parliament.[[User:Noreen45|Noreen45]] ([[User talk:Noreen45|talk]]) 23:00, 29 March 2014 (UTC)\n\n== A barnstar for you! ==\n\n{| style=\"background-color: #fdffe7; border: 1px solid #fceb92;\"\n|rowspan=\"2\" style=\"vertical-align: middle; padding: 5px;\" | [[File:Special Barnstar Hires.png|100px]]\n|style=\"font-size: x-large; padding: 3px 3px 0 3px; height: 1.5em;\" | '''The Special Barnstar'''\n|-\n|style=\"vertical-align: middle; padding: 3px;\" | For your gratefulness. [[User:OccultZone|'''<span style=\"color:DarkBlue;\">Occult</span><span style=\"color:blue;\">Zone</span>''']] ([[User talk:OccultZone#top|<small>Talk</small>]]) 04:35, 1 April 2014 (UTC)\n|}\n\n== Charles Keating ==\n\nFor your information, [[Charles Keating]] is a GA article with an active maintainer (me).  Please do not remove deadlink sources just because they are no longer immediately accessible. Please see [[Wikipedia:DEADLINK#Mitigating_a_dead_link]]: \"Do not delete a URL just because it has been tagged with {{dead link}} for a long time.\"  Statements like \"Keating graduated from St. Xavier in 1941.[4]\" should ''not'' be replace with \"citeneeded\" flags just because the URL no longer works.  Statements like these are still adequately sourced, it's just harder to get at the source.  Thanks.  [[User:Wasted Time R|Wasted Time R]] ([[User talk:Wasted Time R|talk]]) 02:08, 2 April 2014 (UTC)\n\n:I don't understand your comment \"I was just trimming in light of Keating's recent death\".  Just because the subject died doesn't mean the article has to be shortened.  The diffs of your edits are very difficult to follow (that's the fault of WP software, not you).  Can you tell me what you think is wrong with the article in terms of content? I see comments like \"POV\", \"OR\", \"cruft\" - what exactly? [[User:Wasted Time R|Wasted Time R]] ([[User talk:Wasted Time R|talk]]) 02:26, 2 April 2014 (UTC)\n\n::: I just restored the deadlink I removed. As far as POV, I would say terms like \"Indeed\" (not in quotes), or \"well known\", rather than just \"known\", depending on the circumstances. Stuff like that. Why don't you compare the diffs and see if the article doesn't look a tad better. If not tell me where I screwed up. Yours, [[User:Rms125a@hotmail.com|<font color=\"orange\">'''''Quis separabit?'''''</font>]] 02:32, 2 April 2014 (UTC)\n\n:::: You don't need to put \"ISBN needed\" on all the short form book cites; its in the long form in each book's first cite.  (Better would be to move those books into a bibliography section.)  You have eliminated what you think are redundant cites but they are actually needed for me to tell what text goes with what cite.  You've put all the quotes in italics; what MoS guideline says to do that?  You've taken the life out of some of the wording: \"In late 1988, Keating began desperate attempts to sell Lincoln\" is based on sources and conveys to the reader much better the feeling of what was happening than \"In late 1988, Keating began attempts to sell Lincoln\".  If the source says it was desperate, why can't we say it was desperate?  That's not \"POV\", that's engaging prose, what articles are supposed to aspire to.  And most of what you've changed I won't even be able to figure out without doing a side-by-side walkthrough of the formatted articles before and after - parts of that big diff are completely unmanageable.  Sigh.  You don't know how many hours I spent researching and writing this one.  What can I say.   [[User:Wasted Time R|Wasted Time R]] ([[User talk:Wasted Time R|talk]]) 02:50, 2 April 2014 (UTC)\n\n::::: No I don't want to revert all your edits.  I just want a change to the culture here where every article is automatically considered unsatisfactory and unmaintained, in need of cleaning up, rearranging, reformatting, cruft removal, etc, all in sweeping edits with little explanation.  And that whenever the subject is in the news it's open season on the article.  Some articles are actually pretty good and had people work really hard to make them that way.  I've been here a long time and of course I know that in WP you get no credit for work done and no credit for knowing a lot about the subject and no credit for having thought a long time about the article and that everything can be redone by others.  But still.  [[User:Wasted Time R|Wasted Time R]] ([[User talk:Wasted Time R|talk]]) 03:10, 2 April 2014 (UTC)\n\n== A barnstar for you! ==\n\n{| style=\"background-color: #fdffe7; border: 1px solid #fceb92;\"\n|rowspan=\"2\" style=\"vertical-align: middle; padding: 5px;\" | [[File:Tireless Contributor Barnstar Hires.gif|100px]]\n|style=\"font-size: x-large; padding: 3px 3px 0 3px; height: 1.5em;\" | '''The Tireless Contributor Barnstar'''\n|-\n|style=\"vertical-align: middle; padding: 3px;\" | Just because! :) You've been here years now, through good times and through tough times. Anyways - just dropping by to say that I appreciate that you're still here, doing what you do! [[User:Alison|<span style=\"color:#FF823D;font-family: comic sans ms\">'''A<font color= \"#FF7C0A\">l<font color= \"#FFB550\">is</font>o</font>n'''</span>]] <sup>[[User_talk:Alison|❤]]</sup> 20:49, 3 April 2014 (UTC)\n|}\n\n==ISBNs for DLP article==\nA heading has been placed above the DLP (historical) article claiming that ISBN numbers should be included for some references. There were no ISBN numbers shown on books before somewhere about 1970. The books shown in the references by Tom Truman and Alan Dalziel I think do not have ISBN numbers shown inside their covers because they were published earlier than 1970. An editor with a keen interest on Hungarian-Australians has inserted reference numbers from the National Library of Australia for some books without ISBN numbers. Perhaps I could do this? \n\nAlso two very important references seem to have been removed. These are the book by Paul Reynolds with the title Democratic Labor Party and the book by Robert Murray on The Split. I can restore these later when I'm up to it, as I have been ill lately following surgery. Thank you for your comment on my talk page. You do very good work for WP.[[User:Noreen45|Noreen45]] ([[User talk:Noreen45|talk]]) 04:07, 4 April 2014 (UTC)\n\n==[[David L Cook]]==\nI reviewed the contributions you made to the David L Cook article. Please contact a contributing editor before you simply start hacking at an article. The sources and the whens and whys are described in the sources that were given. If there is not a source in the location you placed, it was down at the end of the paragraph. If you want to make edits or you have questions I would appreciate that in the future you contact a contributing editor before simply taking those kinds of steps. I understand being bold in your edits, but the ones you made were not helping to improve the article. Please contact me if you have any questions or comments on my talk page. [[User:Canyouhearmenow|Canyouhearmenow]] 18:53, 5 April 2014 (UTC)\n::Thank you for your help on this article. We must always be courteous and respectful of each others work. The edits you currently made are very respectable and appreciated. I hope that if I can ever help you in the future you will feel free to call upon me.[[User:Canyouhearmenow|Canyouhearmenow]] 22:13, 5 April 2014 (UTC)\n\n==Francine Beers==\nI am going by what is written in her wiki article. If you have an issue with the sourcing of her HS education, please contact the person that wrote it. [[User:Postcard Cathy|Postcard Cathy]] ([[User talk:Postcard Cathy|talk]])\n\n==Who removed the Asquiths?==\nI did, [https://en.wikipedia.org/w/index.php?title=Recusancy&diff=623836510&oldid=623704983 here]. As you will see, it was a link to a dab page, and was and is unsupported by any reference. [[User:DuncanHill|DuncanHill]] ([[User talk:DuncanHill|talk]]) 15:39, 2 September 2014 (UTC)\n\n== WikiProject Women writers Invitation ==\n\n{| class=\"messagebox\" style=\"{{border-radius|8px}} padding:5px; width:80%; font-size:100%; background-color:#F5F5DC; border-color:#9F9FFF;\" cellpadding = \"5\" \n|-\n| [[File:Marywollstonecraft.jpg|center|75px]]\n| \nHello {{PAGENAME}}!  Thank you for your contributions to articles related to [[Women writers]].  I'd like to invite you to become a part of '''[[Wikipedia:WikiProject Women writers|WikiProject Women writers]]''', a WikiProject aimed at improving the quality of articles about women writers on Wikipedia.\n\nIf you would like to participate, please visit the [[Wikipedia:WikiProject Women writers|WikiProject Women writers page]] for more information. Feel free to sign your name under \"Members\". I look forward to your involvement! \n|}\n\n== Your question \"why rv Database?\" ==\nI'm assuming \"rv\" means \"remove\". Because I have promoted him to having [[Database (The Simpsons)|his own article]], as he is a major character. His page has sufficient references, and I believe it's a ''good article''. So I'll just re-remove him from the recurring page. --[[User:Wizardlords|Wizardlords]] ([[User talk:Wizardlords|talk]]) 07:42, 10 September 2014 (UTC)\n\n==Back to you, Ms. Grant==\nHow come this [https://familysearch.org/pal:/MM9.1.1/QJZ3-MSLD link] is considered reliable, while [https://familysearch.org/pal:/MM9.3.1/TH-1942-21987-69985-53?cc=1923888 this one] is not. They are both from the same source, but the latter one is an actual document from 1933. If you want to convince me the other one is more reliable, don't waste you time - Close, but no cigar.\nWe should just remove the date altogether. The US Census is far too unreliable. Take [[Janet Waldo]], she was a couple of months old in 1920, 10 in 1930, 16 in 1940, and we still have her as being born 1924. There is a distinct possibility that errors have been made. [[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 17:49, 12 September 2014 (UTC)\n:: This doesn't explain why an actual document from 1933, which clearly (if you zoom in) states October 31, 1926, is regarded as unreliable.[[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 17:57, 12 September 2014 (UTC)\n::: Doesn't prove a thing. On the same paper, Bartholomeo Mazzocchi's age is given as 26 and his birth date as December 20, 1907. Besides, what about the one with 1925, wasn't that also put in by someone who is flesh and blood. Better remove the date on the basis of the US Census' unreliability and conflicting data. Look, I agreed with you on Doris Day, but there we didn't have an actual reliable source which said 1924, and not 1922. Here we've got one. Your move. [[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 18:14, 12 September 2014 (UTC)\n:::: Isn't it?! Check [[Janet Waldo]]'s birth date and then see what you think. I am not for keeping 1925. What has convinced you that it is without a shadow of a doubt true?[[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 18:20, 12 September 2014 (UTC)\n::::: Thank you for what you have done...but there is still no consensus on the 1925 date. All I am saying is that we should remove her date just like you did on Janet Waldo. Also, are you ready for this......[[Intelius]] gives her year of birth as [http://www.intelius.com/results.php?ReportType=1&qf=Lee&qmi=G&qn=Grant&qcs=Woodland+Hills%2C+CA&focusfirst=0 1928].[[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 11:52, 13 September 2014 (UTC)\n== September 2014 ==\n\n[[File:Information.svg|25px|alt=|link=]] Hello, I'm [[User:BracketBot|BracketBot]]. I have automatically detected that <span class=\"plainlinks\">[//en.wikipedia.org/w/index.php?diff=627713834 your edit] to [[Tiffin School]] may have broken the [[syntax]] by modifying 2 \"{}\"s. If you have, don't worry: just [{{fullurl:Tiffin School|action=edit&minor=minor&summary=Fixing+typo+raised+by+%5B%5BUser%3ABracketBot%7CBracketBot%5D%5D}} edit the page] again to fix it. If I misunderstood what happened, or if you have any questions, you can leave a message on [//en.wikipedia.org/w/index.php?action=edit&preload=User:A930913/BBpreload&editintro=User:A930913/BBeditintro&minor=&title=User_talk:A930913&preloadtitle=BracketBot%20–%20{{subst</noinclude>:REVISIONUSER}}&section=new my operator's talk page].</span>\n:List of unpaired brackets remaining on the page:\n*<nowiki>Club|url=http://www.tiffinsmallboatshead.co.uk/tiffinrowing|accessdate=30 September 2014}}</ref></nowiki>{{red|'''&#125;&#125;'''}}<nowiki></ref> The school is particularly strong in rugby, cricket, basketball and rowing. The school has a</nowiki>\nIt's OK to remove this message. Also, to stop receiving these messages, follow [[User:BracketBot#Opting out|these opt-out instructions]]. Thanks, <!-- (0, 0, -2, 0) --><!-- User:BracketBot/inform -->[[User:BracketBot|BracketBot]] ([[User talk:BracketBot|talk]]) 18:58, 30 September 2014 (UTC)\n\n== Andreas Vollenwieder ==\n\nHello,\n\nThanks for all your work on the [[Andreas Vollenweider]] page. I have been doing some work on it over the past few days and I noticed that the text bears some resemblance to that of the biography on his official page [[http://www.vollenweider.com/magazine/history/bioMainen.html]]. Going through the history I noticed a number of reverts by anon IPs who repeatedly re-inserted this text. The last time this happened was on 12 March 2014, while another large anon edit was made on 10 September, just before you began editing the page. They appear to have two characteristics, largely promotional and no references. At the moment I'm in the process of rectifying both.\n\nI am concerned that an anon IP could revert the work done the page thus far, I suppose a semi-protect would prevent that from happening? Thanks. [[User:Karst|Karst]] ([[User talk:Karst|talk]]) 13:39, 4 October 2014 (UTC)\n\n== Back to you, again, Ms. Grant ==\n\nDisagree with you; we should mention the age dispute and cite the years given. Please do not remove the sources, which include books, documents and interviews. There is no consensus on her talk page. The last edit says the US Census is not considered a proper [[Wikipedia: No original research|secondary source]].[[User:Radiohist|Radiohist]] ([[User talk:Radiohist|talk]]) 16:32, 5 October 2014 (UTC) ''BTW, Thank you for your hard work on [[Janet Waldo]]'s article. Appreciate it.''\n\n== Greetings ==\nHope you are ok my friend, hope to chat again [[User:Zafiraman|Zafiraman]] ([[User talk:Zafiraman|talk]]) 19:30, 6 October 2014 (UTC)"}]}}}