{"pages": {"19563640": {"pageid": 19563640, "ns": 0, "title": "Al Jolson", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "diff": {"from": 628098591, "to": 628519368, "*": "<tr>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 10:</td>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 10:</td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| death_date = {{Death date and age|1950|10|23|1886|05|26}}</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| death_date = {{Death date and age|1950|10|23|1886|05|26}}</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| death_place =[[San Francisco, California]], U.S.</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| death_place =[[San Francisco, California]], U.S.</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">−</td>\n  <td class=\"diff-deletedline\"><div>| cause of death = Heart attack</div></td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>| cause of death = <ins class=\"diffchange diffchange-inline\">[[</ins>Heart attack<ins class=\"diffchange diffchange-inline\">]]</ins></div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| genre = [[Vaudeville]]&lt;br /&gt;[[Pop standard]]s&lt;br /&gt;[[Jazz]]&lt;br /&gt;[[Pop music|Pop]]</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| genre = [[Vaudeville]]&lt;br /&gt;[[Pop standard]]s&lt;br /&gt;[[Jazz]]&lt;br /&gt;[[Pop music|Pop]]</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| occupation = [[Actor]]&lt;br /&gt;[[Comedian]]&lt;br /&gt;[[Singing|Singer]]</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| occupation = [[Actor]]&lt;br /&gt;[[Comedian]]&lt;br /&gt;[[Singing|Singer]]</div></td>\n</tr>\n\n<!-- diff cache key enwiki:diff:wikidiff2:1.12:old-628098591:rev-628519368:1.10.0 -->\n"}, "*": "{{pp-move-vandalism|small=yes}}\n{{Infobox musical artist\n| name = Al Jolson\n| image = Portrait sitting.jpg\n| caption =\n| background = solo_singer\n| birth_name = Asa Yoelson\n| birth_date = {{Birth date|1886|5|26|mf=y}}\n| birth_place =[[Seredžius]], [[Kovno Governorate]], [[Russian Empire]] (present-day [[Lithuania]])\n| death_date = {{Death date and age|1950|10|23|1886|05|26}}\n| death_place =[[San Francisco, California]], U.S.\n| cause of death = [[Heart attack]]\n| genre = [[Vaudeville]]<br />[[Pop standard]]s<br />[[Jazz]]<br />[[Pop music|Pop]]\n| occupation = [[Actor]]<br />[[Comedian]]<br />[[Singing|Singer]]\n| years_active = 1904–1950\n| spouse = Henrietta Keller (1907–1919)<br>Alma Osbourne (1922–1928)<br>[[Ruby Keeler]] (1928–1939)<br>Erle Galbraith (1945–1950; his death)\n| label = [[Victor Records|Victor]], [[Columbia Records|Columbia]], Little Wonder, [[Brunswick Records|Brunswick]], [[Decca Records|Decca]]\n| website = [http://www.jolson.org The Al Jolson Society]}}\n\n'''Al Jolson''' (born '''Asa Yoelson'''; May 26, 1886 – October 23, 1950) was an [[United States|American]] singer, film actor, and comedian. At the peak of his career, he was dubbed \"The World's Greatest Entertainer\".<ref name=PBS/>\n\nHis performing style was brash and extroverted, and he popularized a large number of songs that benefited from his \"shamelessly sentimental, melodramatic approach\".<ref>{{Allmusic|last=Ruhlmann |first=William |class=artist|id=q80924 |date=1950-10-23 |accessdate=2010-03-05}}</ref> Numerous well-known singers were influenced by his music, including [[Bing Crosby]]<ref name=pop40t3B>{{Pop Chronicles 40s |3|B}}</ref> [[David Bowie]],<ref>{{cite web|url=http://www.inkubato.com/de/projekte/aufdenspurenvonaljolson |title=Dokumentarfilm: Auf den Spuren von Al Jolson|publisher=Inkubato.com|accessdate=2013-09-15}}</ref> [[Bob Dylan]] and others, Dylan once referred to him as \"somebody whose life I can feel\".<ref name=Dix>Dix, Andrew and Taylor, Jonathan. ''Figures of Heresy'', Sussex Academic Press (2006), p. 176; quoted from Dylan's book, ''Biograph'' (1985).</ref> Broadway critic [[Gilbert Seldes]] compared him to [[Pan (god)|the Greek god Pan]], claiming that Jolson represented \"the concentration of our national health and gaiety.\"<ref name=Showtime>Stempel, Larry. ''Showtime: A History of the Broadway Musical Theater'', W.W. Norton (2010), p. 152.<!-- ISBN needed --></ref>\n\nIn the 1930s he was America's most famous and highest-paid entertainer.<ref>[[Beryl Bainbridge|Bainbridge, Beryl]]. ''Front Row: Evenings at the Theatre'', Continuum International Publishing (2005), p. 109.</ref> Between 1911 and 1928, Jolson had nine sell-out [[Winter Garden Theatre|Winter Garden]] shows in a row, more than 80 hit records, and 16 national and international tours. Although he is best remembered today as the star of the first 'talking picture', ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'' (1927), he later starred in a series of successful musical films throughout the 1930s. After the [[attack on Pearl Harbor]], he was the first star to entertain troops overseas during [[World War II]]. After a period of inactivity, his stardom returned with ''[[The Jolson Story]]'' (1946). [[Larry Parks]] played Jolson, with the singer dubbing for Parks. The formula was repeated in the sequel, ''[[Jolson Sings Again]]'' (1949). In 1950 he again became the first star to entertain [[G.I. (military)|GIs]] on active service in the [[Korean War]], performing 42&nbsp;shows in 16&nbsp;days. He died just weeks after returning to the U.S., partly owing to the physical exertion of performing. Defense Secretary [[George Marshall]] afterward awarded the [[Legion of Merit|Medal of Merit]] to Jolson's family. {{cn|date=September 2014}}\n\nAccording to the ''St. James Encyclopedia of Popular Culture'', \"Jolson was to [[jazz]], [[blues]], and [[ragtime]] what [[Elvis Presley]] was to [[rock 'n' roll]].\" Being the first popular singer to make a spectacular \"event\" out of singing a song, he became a “rock star” before the dawn of rock music. His specialty was performing on stage runways extending out into the audience. He would run up and down the runway and across the stage, \"teasing, cajoling, and thrilling the audience,\" often stopping to sing to individual members; all the while the \"perspiration would be pouring from his face, and the entire audience would get caught up in the ecstasy of his performance.\" According to music historian Larry Stempel, \"No one had heard anything quite like it before on Broadway.\" Author Stephen Banfield agreed, writing that Jolson's style was \"arguably the single most important factor in defining the modern musical....\"<ref name=Showtime/>\n\nHe enjoyed performing in [[blackface]] makeup, a theatrical convention since the mid 19th century. With his unique and dynamic style of singing black music, such as jazz and blues, he was later credited with single-handedly introducing [[African-American music]] to white audiences.<ref name=PBS/> As early as 1911 he became known for fighting against black [[discrimination]] on [[Broadway theatre|Broadway]].\n\n{{TOClimit|limit=3}}\n\n==Early life==\n[[File:Jolson 1916.jpg|thumb|Al Jolson, circa 1916]]\nAl Jolson was born as '''Asa Yoelson''' ({{lang-yi|אַסאַ יואלסאָן}}) in the [[shtetl|Jewish village]] of [[Seredžius|Srednik]] ({{lang-yi| סרעדניק}}) now known as Seredžius, near [[Kaunas]] in [[Lithuania]], then part of the [[Russian Empire]]. He was the fifth and youngest child of Moses Reuben Yoelson (1858 – December 23, 1945) and Nechama \"Naomi\" Cantor (1858 – February 6, 1895); his four siblings were Rose, Etta, another sister who died in infancy, and Hirsch (Harry). Jolson claimed not to know when he was born, and later chose to celebrate it as May&nbsp;26, 1886.<ref>Freedland, Michael. ''Al Jolson'' (1972), pp. 17–18.</ref> His one-time sister-in-law Margie Keeler-Weatherwax (a sister of [[Ruby Keeler]]) claimed Jolson was the same age as their father, who was born in 1882, and that Jolson was 46 when he married the 18 year old Ruby in 1928. In 1891, his father, who was qualified as a [[rabbi]] and [[Hazzan|cantor]], moved to [[New York City|New York]] to secure a better future for his family. By 1894, Moses Yoelson could afford to pay the fare to bring Naomi and his four children to America. By the time they arrived, he had found work at the Talmud Torah Synagogue in the [[Southwest Waterfront, Washington, D.C.|Southwest Waterfront]] neighborhood of [[Washington, D.C.]], where the family was reunited.<ref>Freedland, pp. 21–22.</ref>\n\nHard times hit the family when his mother, Naomi, died in early 1895. Following his mother's death, young Asa was in a state of withdrawal for seven months. For a period of time, young Asa spent time at the [[Cardinal Gibbons School|St. Mary's Industrial School for Boys]], a progressive reformatory/home for orphans run by the [[Xaverian Brothers]] in [[Baltimore, Maryland|Baltimore]] (this was same school once attended by [[Babe Ruth]]. Upon being introduced to show business in 1895 by entertainer [[Al Reeves]], Asa and Hirsch became fascinated by the industry, and by 1897 the brothers were singing for coins on local street corners, using the names \"Al\" and \"Harry\". They would usually use the money to buy tickets to shows at the [[National Theatre (Washington, D.C.)|National Theater]].<ref name=PBS/> Asa and Hirsch spent most of their days working different jobs as a team.<ref>{{cite book |last=Oberfirst |first=Robert |title=Al Jolson: You Ain't Heard Nothin’ Yet |year=1980 |publisher=Barnes & Co |location=London |pp=23–40 <!-- ISBN needed --> |ref=harv}}</ref>\n\n==Stage performer==\n===Blackface===\nIn 1904, while playing an engagement at Keeney's Theatre in Brooklyn, Jolson began performing in [[blackface]].\n\n===Burlesque and vaudeville===\nIn the spring of 1902, he accepted a job with Walter L. Main's Circus. Although Main had hired Jolson as an usher, Main was impressed by Jolson's singing voice and gave him a position as a singer during the circus's Indian Medicine Side Show segment.{{sfn |Oberfirst |1980 |pp=49–50}} By the end of the year, the circus had folded and Jolson was again out of work. In May 1903, the head producer of the [[American burlesque|burlesque]] show ''Dainty Duchess Burlesquers'' agreed to give Jolson a part in one show. Asa gave a remarkable performance of \"Be My Baby Bumble Bee\" and the producer agreed to keep him for future shows. Unfortunately, the show closed by the end of the year. Asa was able to avoid financial troubles by forming a [[vaudeville]] partnership with his brother Hirsch, now a vaudeville performer known as '''Harry Yoelson'''. The brothers worked for the [[William Morris Agency]].{{sfn |Oberfirst |1980 |pp=50–60}}\n\nAsa and Harry soon formed a team with Joe Palmer. During their time with Palmer, they were able to gain bookings in a nationwide tour. However, live performances were falling in popularity as [[nickelodeon (movie theater)|nickelodeon theaters]] captured audiences; by 1908, nickelodeon theaters were dominant throughout New York City as well. While performing in a [[Brooklyn]] theater in 1904,<ref name=JolyM>Kenrick, John. [http://www.musicals101.com/jolsonbio.htm \"Al Jolson: A Biography\"] Musicals101.com. 2003.</ref> Al decided on a new approach and began wearing [[blackface]] makeup. The conversion to blackface boosted his career, and he began wearing blackface in all of his shows.{{sfn |Oberfirst |1980 |pp=61–80}}\n\nIn the fall of 1905, Harry left the trio following a harsh argument with Al. Harry had refused Al's request to take care of Joe Palmer, who was in a wheelchair, while he was dating. After Harry's departure, Al and Joe Palmer worked as a duo but were not particularly successful. By 1906<ref name=JolyM/> the two agreed to separate, and Jolson was on his own.{{sfn |Oberfirst |1980 |pp=68–70}} Jolson became a regular at the Globe and Wigwam Theater in [[San Francisco, California]], and remained successful nationwide as a vaudeville singer.<ref name=JolyM/> He took up residence in San Francisco, saying the [[1906 San Francisco earthquake|earthquake]]-devastated people needed someone to cheer them up. In 1908 Jolson, needing money for himself and his new wife, Henrietta, returned to New York. In 1909, Al's singing caught the attention of [[Lew Dockstader]], the producer and star of Dockstader's Minstrels. Al accepted Dockstader's offer and became a regular blackface performer.{{sfn |Oberfirst |1980 |pp=70–81}}\n\n===Broadway playhouses===\n====Winter Garden Theater====\nAccording to ''[[Esquire (magazine)|Esquire]]'' magazine, \"[[Jacob J. Shubert|J.J. Shubert]], impressed by Jolson's overpowering display of energy, booked him for ''[[La Belle Paree]]'', a musical comedy that opened at the [[Winter Garden Theatre|Winter Garden]] in 1911. Within a month Jolson was a star. From then until 1926, when he retired from the stage, he could boast an unbroken series of smash hits.\"<ref name=Digest>Zolotow, Maurice. [http://jolsonville.com/articles/readers-digest-1949 \"Ageless Al\"], ''Reader's Digest'', January 1949.</ref>\n\nOn March 20, 1911, Jolson starred in his first musical [[revue]] at the Winter Garden Theater in New York City, ''La Belle Paree'', greatly helping to launch his career as a singer. The opening night drew a huge crowd to the theater, and that evening Jolson gained audience popularity by singing old [[Stephen Foster]] songs in blackface. In the wake of that opening night, Jolson was given a position in the show's cast. The show closed after 104 performances, and during its run Jolson's popularity grew greatly. Following ''La Belle Paree'', Jolson accepted an offer to perform in the musical ''[[Vera Violetta]]''. The show opened on November&nbsp;20, 1911 and, like La Belle Paree, was a phenomenal success. In the show, Jolson again sang in blackface and managed to become so popular that his weekly salary of $500 (based on his success in La Belle Paree) was increased to $750.{{sfn |Oberfirst |1980 |pp=98–117}}\n\nAfter ''Vera Violetta'' ran its course, Jolson starred in another musical, ''The Whirl of Society'', propelling his career on [[Broadway theatre|Broadway]] to new heights. During his time at the Winter Garden, Jolson would tell the audience, \"You ain't heard nothing yet\" before performing additional songs. In the play, Jolson debuted his signature blackface character, \"Gus.\"<ref name=JolyM/> The play was so successful that Winter Garden owner [[Lee Shubert]] agreed to sign Jolson to a seven-year contract with a salary of $1,000 a week. Jolson would reprise his role as \"Gus\" in future plays and by 1914 achieved so much popularity with the theater audience that his $1,000-a-week salary was doubled to $2,000 a week. In 1916, ''[[Robinson Crusoe, Jr.]]'' was the first musical in which he was featured as the star character. In 1918, Jolson's acting career would be pushed even further after he starred in the hit musical ''[[Sinbad (musical)|Sinbad]]''.{{sfn |Oberfirst |1980 |pp=123–141}}\n\n{| style=\"float:right;\"\n|-\n|[[File:SwaneeCoverGershwinJolson.jpg|thumb|1919 \"Swanee\" sheet music with Jolson on the cover. For the full sheet music, see [[:s:Swanee|Wikisource]].]]\n|-\n|{{Listen\n|filename=Al Jolson, George Gershwin, Irving Caesar, Swanee 1920.ogg\n|title=Swanee\n|description=Al Jolson's hit 1920 recording of [[George Gershwin]] and [[Irving Caesar]]'s 1919 \"[[Swanee (song)|Swanee]]\".\n|format=[[Ogg]]}}\n|}\nIt became the most successful Broadway musical of 1918 and 1919. A new song was later added to the show that would become composer [[George Gershwin]]'s first hit recording—\"[[Swanee (song)|Swanee]]\". Jolson also added another song, \"[[My Mammy]],\" to the show. By 1920, Jolson had become the biggest star on Broadway.<ref>Oberfirst, pp. 143–147.</ref>\n\n====Jolson's own theater====\nHis next play, ''[[Bombo (musical)|Bombo]]'', would also take his career to new heights and became so successful that it went beyond Broadway and held performances nationwide.{{sfn |Oberfirst |1980 |p=171}} It also led Lee Shubert to rename his newly built theater, which was across from [[Central Park]], as '''Jolson's 59th Street Theatre'''. Aged 35, Jolson became the youngest man in American history to have a theatre named after him.<ref>Goldman, Herbert G., ''Jolson -– the Legend Comes to Life'' (1988), Oxford University Press, p. 117.<!-- ISBN needed --></ref>\n\nBut on the opening night of ''Bombo'', and the first performance at the new theatre, he suffered from extreme stage fright, walking up and down the streets for hours before showtime. Out of fear, he lost his voice backstage and begged the stagehands not to raise the curtains. But when the curtains went up, he \"was [still] standing in the wings trembling and sweating.\" After being physically shoved onto the stage by his brother Harry, he performed and received an ovation that he would never forget: \"For several minutes, the applause continued while Al stood and bowed after the first act.\" He refused to go back on stage for the second act, but the audience \"just stamped its feet and chanted 'Jolson, Jolson', until he came back out.\" He took 37 curtain calls that night and told the audience, \"I'm a happy man tonight.\"<ref>Goldman, p. 118.</ref>\n\nIn March 1922, he moved the production to the larger Century Theater for a special benefit performance to aid injured [[Jewish War Veterans of the United States of America|Jewish veterans]] of [[World War I]].<ref>[http://query.nytimes.com/gst/abstract.html?res=9403E5D71F30EE3ABC4852DFB5668389639EDE&scp=1&sq=Al+Jolson+Bombo+Benefit&st=p \"Benefit Performance: 'Bombo' to Be Given at Century in Aid of Jewish War Sufferers\"] ''New York Times'', March 10, 1922</ref> After taking the show on the road for a season, he returned in May 1923, to perform ''Bombo'' at \"his first love\", the Winter Garden. The reviewer for ''[[The New York Times]]'' wrote, \"He returned like the circus, bigger and brighter and newer than ever. ... Last night's audience was flatteringly unwilling to go home, and when the show proper was over, Jolson reappeared before the curtain and sang more songs, old and new.\"<ref>[http://select.nytimes.com/gst/abstract.html?res=F50C10FD3C5416738DDDAC0994DD405B838EF1D3&scp=1&sq=Al+Jolson+Welcomed+Back&st=p \"AL JOLSON WELCOMED BACK.; He Returns to the Winter Garden in \"Bombo\", With New Jokes\"], ''New York Times'', May 15, 1923.</ref>\n\n\"I don’t mind going on record as saying that he is one of the few instinctively funny men on our stage,\" wrote reviewer Charles Darnton in the ''[[New York World|New York Evening World]]''. \"Everything he touches turns to fun. To watch him is to marvel at his humorous vitality. He is the old-time [[minstrel]] man turned to modern account. With a song, a word, or even a suggestion he calls forth spontaneous laughter. And here you have the definition of a born comedian.\"<ref>Goldman, p. 87.</ref>\n\n==Performing in blackface==\n[[File:Jolson black.jpg|thumb|left|''[[The Jazz Singer (1927 film)|The Jazz Singer]]'', 1927]]\nPerforming in [[blackface]] makeup was a theatrical convention of many entertainers at the beginning of the 20th century, having its origin in the [[minstrel show]].<ref name=rowland>{{Cite book |author=Rowland-Warne, L. |title=Eyewitness: Costume |publisher=DK CHILDREN |date=2000-06-01|isbn=0789455862}}</ref> Working behind a blackface mask \"gave him a sense of freedom and spontaneity he had never known\".<ref name=JolyM/> According to film historian [[Eric Lott]], for the white minstrel man \"to put on the cultural forms of 'blackness' was to engage in a complex affair of manly mimicry.... To wear or even enjoy blackface was literally, for a time, to become black, to inherit the cool, virility, humility, abandon, or gaité de coeur that were the prime components of white ideologies of black manhood.\"<ref name=Lott>{{cite book |last=Lott |first=Eric |authorlink=Eric Lott |title=Love and Theft: Blackface Minstrelsy and the American Working Class |publisher= Oxford University Press |year=1993 |url=http://books.google.co.uk/books?id=2Lg5mDUSgYsC&pg=PA52&dq=%22Eric+Lott%22+%22inherit+the+cool%22}}</ref>\n\n===As metaphor of mutual suffering===\nJazz historians have described Jolson’s blackface and singing style as metaphors for Jewish and black suffering throughout history. Jolson’s first film, ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'', for instance, is described by historian [[Michael Alexander (academic)|Michael Alexander]] as an expression of the [[liturgy|liturgical]] music of Jews with the \"imagined music of African Americans,\" noting that \"prayer and jazz become metaphors for Jews and blacks.\" <ref name=\"Alexander, Michael 2003 p. 176\">Alexander, Michael. ''Jazz Age Jews'', Princeton University Press (2003), p. 176.</ref> Playwright [[Samson Raphaelson]], after seeing Jolson perform his stage show ''Robinson Crusoe'', stated that \"he had an epiphany: 'My God, this isn't a jazz singer', he said. 'This is a [[Hazzan|cantor]]!'\" The image of the blackfaced cantor remained in Raphaelson's mind when he conceived of the story which led to ''The Jazz Singer''.<ref name=Norwood>Norwood, Stephen Harlan, and Pollack, Eunice G. ''Encyclopedia of American Jewish History'', ABC-CLIO, Inc. (2008), p. 502.<!-- ISBN/ISSN needed --></ref>\n\nUpon the film's release, the first full-length sound picture, film reviewers saw the symbolism and metaphors portrayed by Jolson in his role as the son of a cantor wanting to become a \"jazz singer\":\n:\"Is there any incongruity in this Jewish boy with his face painted like a Southern Negro singing in the Negro dialect? No, there is not. Indeed, I detected again and again the minor key of Jewish music, the wail of the [[Chazan]], the cry of anguish of a people who had suffered. The son of a line of rabbis well knows how to sing the songs of the most cruelly wronged people in the world’s history.\"<ref name=Norwood/> According to Alexander, Eastern European Jews were uniquely qualified to understand the music, noting how Jolson himself made the comparison of Jewish and African-American suffering in a new land in his film ''Big Boy'': In a blackface portrayal of a former slave, he leads a group of recently freed slaves, played by black actors, in verses of the classic slave spiritual \"[[Go Down Moses]].\" One reviewer of the film expressed how Jolson's blackface added significance to his role:\n\n:\"When one hears Jolson's jazz songs, one realizes that jazz is the new prayer of the American masses, and Al Jolson is their cantor. The Negro makeup in which he expresses his misery is the appropriate [[tallit|talis]] [prayer shawl] for such a communal leader.\"<ref name=\"Alexander, Michael 2003 p. 176\"/> Many in the black community welcomed ''The Jazz Singer'', and saw it as a vehicle to gain access to the stage. Audiences at Harlem's Lafayette Theater cried during the film, and Harlem's newspaper, ''Amsterdam News,'' called it \"one of the greatest pictures ever produced.\" For Jolson, it wrote: \"Every colored performer is proud of him.\"<ref>Rogin, Michael. ''Blackface, White Noise: Jewish Immigrants in the Hollywood Melting Pot'', University of California Press (1996), p. 197.<!-- ISBN needed --></ref>\n\n===Relations with African-Americans===\n{{see also|African-American – Jewish relations}}\nJolson first heard [[African-American]] [[African American music|music]], such as [[jazz music|jazz]], [[blues]], and [[ragtime]], played in the back alleys of [[New Orleans]], [[Louisiana]]. He enjoyed singing the ''new'' jazz-style of music. Often performing in [[blackface]], especially in the songs he made popular, such as \"[[Swanee (song)|Swanee]]\", \"[[My Mammy]]\", and \"[[Rock-A-Bye Your Baby With A Dixie Melody]]\". Jolson's black stage persona, called \"Gus\" was a wily and wise-cracking servant who was always smarter than his white masters, frequently helping them out of problems they created for themselves. In this way, Jolson used comedy to poke fun at the prevalent idea of \"white supremacy\". In most of his movie roles, however, including a singing [[hobo]] in ''[[Hallelujah, I'm a Bum]]'' or a jailed convict in ''[[Say It With Songs]]'', he chose to act without using blackface. In the film ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'' (1927), he performed only a few songs, including \"My Mammy\", in blackface, but the film is concerned in part with the experience of \"donning a mask\" that the young Jewish singer embraces in performing popular songs onstage. {{cn|date=September 2014}}\n\nAs a Jewish immigrant and America's most famous and highest-paid entertainer, he may have had the incentive and resources to help break down racial attitudes. For instance, the [[Ku Klux Klan]] (KKK) during its peak in the early 1920s, included about 15% of the nation's eligible voting population, 4–5&nbsp;million men.<ref>{{cite web|url=http://www.aaregistry.org/historic_events/view/ku-klux-klan-brief-biography|title=African American Registry|publisher=Aaregistry.com|accessdate=2010-03-05}}</ref> While ''[[The Birth of a Nation]]'' glorified white supremacy and the KKK, Jolson chose to star in ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'', which defied racial bigotry by introducing American black music to audiences worldwide.<ref name=PBS/>\n\nWhile growing up, Jolson had many black friends, including [[Bill Robinson|Bill \"Bojangles\" Robinson]], who later became a prominent [[tap dancer]].<ref name=Digest/> As early as 1911, at the age of 25, Jolson was already noted for fighting discrimination on the Broadway stage and later in his movies:<ref name=blackstar/>\n* \"at a time when black people were banned from starring on the Broadway stage,\"<ref>Freedland, Michael. [http://www.timesonline.co.uk/tol/comment/columnists/guest_contributors/article5811133.ece \"You couldn't have Al Jolson any other way\"], Timesonline.co.uk, February 27, 2009.</ref> he promoted the play by black playwright Garland Anderson,<ref>Hill, Anthony Duane. [http://www.blackpast.org/?q=aah/anderson-garland-1886-1939 \"Anderson, Garland (1886–1939)\"], BlackPast.org; accessed September 19, 2014.</ref> which became the first production with an all-black cast ever produced on Broadway;\n* he brought an all-black dance team from San Francisco that he tried to feature in his Broadway show;<ref name=blackstar/>\n* he demanded equal treatment for [[Cab Calloway]], with whom he performed a number of duets in his movie ''The Singing Kid'';\n* he was \"the only white man allowed into an all black nightclub in [[Harlem]]\".<ref name=blackstar>Ciolino, Joseph, [http://blackstarnews.com/?c=120&a=3343 \"Al Jolson Wasn't Racist!\"], ''Black Star News'', May 22, 2007.</ref>\nJolson once read in the newspaper that songwriters [[Eubie Blake]] and [[Noble Sissle]], neither of whom he had ever heard of, were refused service at a [[Connecticut]] restaurant because of their race. He immediately tracked them down and took them out to dinner \"insisting he'd punch anyone in the nose who tried to kick us out!\"<ref>{{cite web|url=http://www.ferris.edu/jimcrow/links/jolson|title=Gioia, Ted, ''New York Times''|publisher=Ferris.edu|date=October 22, 2000|accessdate=2010-03-05}}</ref> Subsequent to their meeting, according to biographer Al Rose, Jolson and Blake became friends. Rose writes: {{quote|This didn’t have anything to do with the theater, because they never worked together. Rather, they both had a love of prize fighting and used to go to boxing matches together, engaging in jocose discussion of the relative merits of Negro with Jewish pugilists. They would occasionally wager a bottle of whisky on these bouts.<ref>Rose, Al. ''Eubie Blake'', Macmillan (1979), pp. 67–68.<!-- ISBN needed --></ref>}}\n\nFilm historian [[Charles Musser]] notes that \"African Americans' embrace of Jolson was not a spontaneous reaction to his appearance in talking pictures. In an era when African Americans did not have to go looking for enemies, Jolson was perceived a friend.\"<ref>Musser, Charles. \"Why did Negroes Love Al Jolson and the Jazz Singer?\", ''Film History'', Indiana University Press (2011), p. 206.<!-- ISBN needed --></ref>\n\nJeni LeGon, a black female tap dance star,<ref>{{cite web|url=http://www.atdf.org/awards/legon.html|title=Tap Dance Hall of Fame |publisher=Atdf.org|accessdate=2010-03-05}}</ref> recalls her life as a film dancer: \"But of course, in those times it was a 'black-and-white world.' You didn't associate too much socially with any of the stars. You saw them at the studio, you know, nice—but they didn't invite. The only ones that ever invited us home for a visit was Al Jolson and [[Ruby Keeler]].\"<ref name=Frank>Frank, Rusty E. ''Tap! The Greatest Tap Dance Stars and Their Stories, 1900–1955'', Da Capo Press (1995).</ref> British performer [[Brian Conley]], former star of the 1995 [[United Kingdom|British]] play ''[[Jolson]]'', stated during an interview, \"I found out Jolson was actually a hero to the black people of America. At his funeral, black actors lined the way, they really appreciated what he’d done for them.\"<ref>[http://www.whatsonstage.com/index.php?pg=207&story=E8821214221855&title=Past%2FPresent%2FFuture+for+%85+Brian+Conley \"Past/Present/Future for&nbsp;… Brian Conley.\"] ''What's on Stage'', June 23, 2008.</ref> Noble Sissle, then president of the [[Negro Actors Guild]], represented that organization at his funeral.<ref>{{cite web|url=http://www.jolson.org|title=Al Jolson Society Official Website|publisher=Jolson.org|accessdate=2008-10-27| archiveurl=http://web.archive.org/web/20081023192924/http://www.jolson.org|archivedate=October 23, 2008}}</ref>\n\nJolson's physical expressiveness also affected the music styles of some black performers. Music historian Bob Gulla writes that \"the most critical influence in [[Jackie Wilson]]'s young life was Al Jolson.\" He points out that Wilson's ideas of what a stage performer could do to keep their act an \"exciting\" and \"thrilling performance\" was shaped by Jolson's acts, \"full of wild writhing and excessive theatrics.\" Wilson felt that Jolson, along with [[Louis Jordan]], another of his idols, \"should be considered the stylistic forefathers of rock and roll.\"<ref name=Gulla>Gulla, Bob. ''Icons of R&B and Soul: An Encyclopedia of the Artists'', Greenwood Press (2008), p. 133.<!-- ISBN needed --></ref>\n\nAccording to the ''St. James Encyclopedia of Popular Culture'': \"Almost single-handedly, Jolson helped to introduce African-American musical innovations like jazz, ragtime, and the blues to white audiences.... [and] paved the way for African-American performers like [[Louis Armstrong]], [[Duke Ellington]], [[Fats Waller]], and [[Ethel Waters]].... to bridge the cultural gap between black and white America.\"<ref name=PBS>[http://www.pbs.org/wnet/broadway/stars/al-jolson/ ''Stars over Broadway''.] PBS.org.</ref> Jazz historian [[Amiri Baraka]] wrote, \"the entrance of the white man into jazz...did at least bring him much closer to the [[Negro]].\" He points out that \"the acceptance of jazz by whites marks a crucial moment when an aspect of black culture had become an essential part of American culture.\"<ref name=Baraka>[[Amiri Baraka|Baraka, Amiri (as LeRoi Jones)]], ''Blues People: Negro Music in White America'', (1963) Morrow, p. 151<!-- ISBN needed --></ref>\n\nIn a recent interview, [[Clarence 'Frogman' Henry]], one of the most popular and respected jazz singers of New Orleans, said: \"Jolson? I loved him. I think he did wonders for the blacks and glorified entertainment.\"<ref>Freedland, Michael. ''Jolson – The Story of Al Jolson'' (1972, 2007), p. 307.<!-- publishing info, ISBN needed --></ref>\n\n==Movies==\n===''The Jazz Singer''===\n[[File:The Jazz Singer 1927 Poster.jpg|thumb|movie poster, 1927]]\nJolson had actually starred in a talking film ''before'' ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'': a 1926 short subject entitled ''[[A Plantation Act]]''. This simulation of a stage performance by Jolson was originally presented in a program of musical shorts, demonstrating the [[Vitaphone]] sound-film process. The soundtrack for ''A Plantation Act'' was considered lost in 1933, but was found in 1995 and restored by [[Vitaphone#The Vitaphone Project|The Vitaphone Project]].<ref>{{cite book|last=Eyman|first=Scott|title=The Speed of Sound: Hollywood and the Talkie Revolution, 1926–1930|year=1997|isbn=0-684-81162-6|publisher=Simon & Schuster|page=98}}</ref> The short was included in Warner's 80th Anniversary release of ''The Jazz Singer'' on DVD.\n\n[[Warner Bros.]] had originally picked [[George Jessel (actor)|George Jessel]] for the role, as he had starred in the Broadway play. When [[Sam Warner]] decided to make ''The Jazz Singer'' a musical with the Vitaphone, he knew that Jolson was the star he needed to put it over. He told Jessel that he would have to sing in the movie, and Jessel balked, allowing Warner's to replace him with Jolson. Jessel never got over it and often said that Warner's gave the role to Jolson because he agreed to help finance the film.<ref>{{YouTube|_fAjkJWyBnM|Interview with George Jessel, circa 1980}}, video – 2 minutes.</ref>\n\n====The movie premiere====\n[[Harry Warner]]'s daughter, Doris Warner, remembered the opening night, and said that when the picture started she was still crying over the loss of her beloved uncle Sam, who was planning to be there but died suddenly, at the age of 40, the day before. But halfway through the 89-minute movie she began to be overtaken by a sense that something remarkable was happening. Jolson's \"Wait a minute, wait a minute, you ain't heard nothin' yet...\" provoked shouts of pleasure and applause. After each Jolson song, the audience applauded. Excitement mounted as the film progressed, and when Jolson began his scene with [[Eugenie Besserer]], \"the audience became hysterical.\"<ref name=Eyman>Eyman, Scott. ''The Speed of Sound: Hollywood and the Talkie Revolution, 1926&nbsp;– 1930'', Simon and Schuster (1997), p. 129.<!-- ISBN needed --></ref>\n\nAccording to film historian [[Scott Eyman]], \"by the film's end, the Warner brothers had shown an audience something they had never known, moved them in a way they hadn't expected. The tumultuous ovation at curtain proved that Jolson was not merely the right man for the part of Jackie Rabinowitz, alias Jack Robin; he was the right man for the entire transition from silent fantasy to talking realism. The audience, transformed into what one critic called, 'a milling, battling mob' stood, stamped, and cheered 'Jolson, Jolson, Jolson!'\"<ref>Eyman, p. 140.</ref>\n\nAt the end of the film, Jolson rose from his seat and ran down to the stage. \"God, I think you're really on the level about it. I feel good\" he cried to the audience. Stanley Watkins would always remember Jolson signing autographs after the show, tears streaming down his face. [[May McAvoy]], Jolson's costar remembered that \"[the] police were there to control the crowds. It was a very big thing, like ''[[The Birth of a Nation]]''.\" {{cn|date=September 2014}}\n\n====Introduction of sound====\nThe film was produced by Warner Bros., using its new [[Vitaphone]] sound process. Vitaphone was originally intended for musical renditions, and ''The Jazz Singer'' follows this principle, with only the musical sequences using live sound recording. The moviegoers were electrified when the silent actions were interrupted periodically for a song sequence with real singing and sound. Jolson's dynamic voice, physical mannerisms, and charisma held the audience spellbound.\n\nCostar [[May McAvoy]], according to author A. Scott Berg, could not help sneaking into theaters day after day as the film was being run. \"She pinned herself against a wall in the dark and watched the faces in the crowd. In that moment just before 'Toot, Toot, Tootsie,' she remembered, 'A miracle occurred. Moving pictures really came alive. To see the expressions on their faces, when Joley spoke to them ... you'd have thought they were listening to the voice of God.'\"<ref>''Berg, A. Scott. ''Goldwyn: A Biography'', Alfred A. Knopf (1998).</ref> \"Everybody was mad for the talkies,\" said movie star [[Gregory Peck]] in a ''Newsweek'' interview. \"I remember '' 'The Jazz Singer,' '' when Al Jolson just burst into song, and there was a little bit of dialogue. And when he came out with 'Mammy,' and went down on his knees to his Mammy, it was just dynamite.\"<ref>[http://www.newsweek.com/id/88709 \"This Is Work, Not Play\"], newsweek.com, June 28, 1999.</ref>\n\nThis opinion is shared by Mast and Kawin:\n{{quote|...this moment of informal patter at the piano is the most exciting and vital part of the entire movie...when Jolson acquires a voice, the warmth, the excitement, the vibrations of it, the way its rambling spontaneity lays bare the imagination of the mind that is making up the sounds ...[and] the addition of a Vitaphone voice revealed the particular qualities of Al Jolson that made him a star. Not only the eyes are a window on the soul.<ref name=Mast>Mast, Gerald, and Kawin, Bruce F. ''A Short History of the Movies'' (2006), Pearson Education, Inc., p. 231.<!-- ISBN needed --></ref>}}\n\n====Jewish meanings====\nCultural historian [[Linda Williams (United States film critic)|Linda Williams]] notes that \"''The Jazz Singer'' represents the triumphs of the assimilating son over the old-world father ... and present impediments to an assimilating show-biz success....[and] when Jakie's father says, 'Stop', the flow of \"jazz\" music (and spontaneous speech) freezes. But the Jewish mother recognizes the virtue of the old world in the new and the music flows again.\"<ref name=Williams>Williams, Linda. ''Melodramas of Black and White from Uncle Top to O. J. Simpson'', Princeton University Press (2002), p. 186.<!-- ISBN needed --></ref> According to film historian Robert Carringer, even the father eventually comes to understand that his son's jazz singing is \"fundamentally an ancient religious impulse seeking expression in a modern, popular form\".Or as the film itself states in its first title card, \"perhaps this plaintive, wailing song of jazz is, after all, the misunderstood utterance of a prayer.\"<ref name=Carringer>Carringer, Robert. L. ''The Jazz Singer'' (1979), University of Wisconsin Press, p. 23.<!-- ISBN needed --></ref>\n\nFilm historian [[Scott Eyman]] also describes the cultural perspective of the film: {{quote|[It] marks one of the few times [[Hollywood]] Jews allowed themselves to contemplate their own central cultural myth, and the conundrums that go with it... ''The Jazz Singer'' implicitly celebrates the ambition and drive needed to escape the ''[[shtetl]]s'' of [[Europe]] and the [[ghetto]]s of New York, and the attendant hunger for recognition. Jack, Sam, and Harry let Jack Robin have it all: the satisfaction of taking his father's place ''and'' of conquering the Winter Garden. They were, perhaps unwittingly, dramatizing some of their own ambivalence about the debt first-generation Americans owed their parents.<ref>Eyman, p. 142.</ref>}}\n\n===Other feature films===\n[[File:Heart of NY.jpg|thumb|Poster for ''[[Hallelujah, I'm a Bum (film)|Hallelujah, I'm a Bum]]'' with unused title]]\n;''The Singing Fool'' (1928)\nWith Warner Bros., Al Jolson made his first \"all-talking\" picture, ''[[The Singing Fool]]'' (1928) – the story of a driven entertainer who insisted upon going on with the show even as his small son lay dying, and its signature tune, \"Sonny Boy\", was the first American record to sell one million copies. The film was even more popular than ''The Jazz Singer'', and even though there was still a relatively small number of theaters across the country capable of showing the picture with sound, it held the record for box-office attendance for 11 years, until broken by ''[[Gone With the Wind]]'' a decade later. {{cn|date=September 2014}}\n\nJolson continued to make features for Warner Bros., very similar in style to ''The Singing Fool'', ''[[Say It with Songs]]'' (1929), ''[[Mammy (1930 film)|Mammy]]'' (1930), and ''Big Boy'' (1930). A restored version of ''Mammy'', which includes Jolson in some [[Technicolor]] sequences, was first screened in 2002.<ref>[http://www.cinema.ucla.edu/newsletter/Archive.AprilMay02.pdf UCLA Film and Television Archive Newsletter] April/May 2002.</ref> (Jolson's first Technicolor appearance was in a cameo in the musical ''[[Show Girl in Hollywood]]'' (1930) from [[First National Pictures]], a Warner Bros. subsidiary.) However, these films gradually proved a cycle of diminishing returns due to their comparative sameness, the regal salary that Jolson demanded, and a general shift in public tastes away from the vaudeville-style musical as the 1930s began. As a result of this, Jolson decided to return to Broadway, and starred in a new show, ''Wonder Bar'', which was not very successful.<ref>Oberfirst, pp. 231–235.</ref>\n\n====''Hallelujah, I'm a Bum/Hallelujah, I'm a Tramp''====\nDespite these new troubles, Jolson was able to make a comeback after performing a concert in New Orleans after \"Wonderbar\" closed in 1931. Warners allowed him to make one film with [[United Artists]], ''[[Hallelujah, I'm a Bum (film)|Hallelujah, I'm a Bum]]'', in 1933 (the film had to be retitled ''Hallelujah, I'm a Tramp'' in the UK and other English-speaking countries where \"bum\" means \"butt\" and where the slang word for a vagrant is \"tramp\" rather than \"bum\"). It was directed by [[Lewis Milestone]] and written by screenwriter [[Ben Hecht]]. Hecht was also active in the promotion of [[Ben Hecht#Civil rights activism|civil rights]]: \"Hecht film stories featuring black characters included ''[[Hallelujah, I'm a Bum]]'', co-starring [[Edgar Connor]] as Al Jolson's sidekick, in a politically savvy rhymed dialogue over [[Richard Rodgers]] music.\"<ref name=Kovan1>Kovan, Florice Whyte. [http://benhechtbooks.net/ben_hecht__human_rights ''Some Notes on Ben Hecht's Civil Rights Work, the Klan and Related Projects''], BenHechtBooks.net; accessed September 19, 2014.</ref>\n\nA direct response to the Great Depression, it contains messages to his vagabond friends equivalent to \"there's more to life than money\" and \"the best things in life are free\". ''[[The New York Times]]'' reviewer wrote, \"The picture, some persons may be glad to hear, has no Mammy song. It is Mr. Jolson's best film and well it might be, for that clever director, [[Lewis Milestone]], guided its destiny.... a combination of fun, melody and romance, with a dash of satire...\"<ref>Hall, Mourdaunt. ''New York Times''. February 9, 1933, p. 15.</ref> Another review added, \"A film to welcome back, especially for what it tries to do for the progress of the American musical...\"<ref>Gilliatt, Penelope. ''New Yorker''. June 23, 1973.</ref>\n\n====''Wonder Bar'' (1934)====\nIn 1934, he starred in a movie version of his earlier stage play, [[Wonder Bar]], and co-starred [[Kay Francis]], [[Dolores del Río]], [[Ricardo Cortez]], and [[Dick Powell]]. The movie is a \"musical [[Grand Hotel (film)|Grand Hotel]], set in the Parisian nightclub owned by Al Wonder (Jolson). Wonder entertains and banters with his international clientele.\"<ref>Fisher, James. ''Al Jolson: A Bio-bibliography'' (1994), p. 97.<!-- ISBN, publishing info needed --></ref>\n\nReviews were generally positive: \"''Wonder Bar'' has got about everything. Romance, flash, dash, class, color, songs, star-studded talent and almost every known requisite to assure sturdy attention and attendance... It's Jolson's comeback picture in every respect.\";<ref>Abel, ''Variety''. March 6, 1934.</ref> and, \"Those who like Jolson should see Wonder Bar for it is mainly Jolson; singing the old reliables; cracking jokes which would have impressed Noah as depressingly ancient; and moving about with characteristic energy.\"<ref>\"At the University\", ''Harvard Crimson'', May 21, 1934.</ref> Returning to Warners, Jolson bowed to new production ideas, focusing less on the star and more on elaborately cinematic numbers staged by [[Busby Berkeley]] and Bobby Connolly. This new approach worked, sustaining Jolson's movie career until the Warner contract lapsed in 1935. Jolson co-starred with his actress-dancer wife, [[Ruby Keeler]], only once, in ''Go Into Your Dance''. {{cn|date=September 2014}}\n\n====''The Singing Kid'' (1936)====\nJolson's last Warner vehicle was ''The Singing Kid'' (1936), a parody of Jolson's stage persona (he plays a character named Al Jackson) in which he pokes fun at his stage histrionics and taste for \"mammy\" songs—the latter via a number by [[E. Y. Harburg]] and [[Harold Arlen]] titled \"[[I Love to Singa]]\", and a comedy sequence with Jolson doggedly trying to sing \"Mammy\" while The Yacht Club Boys keep telling him such songs are outdated.<ref>Freedland, Michael. ''Jolson - The Story of Al Jolson'' (1972, 2007).</ref>\n\nAccording to jazz historian Michael Alexander, Jolson had once griped that \"People have been making fun of Mammy songs, and I don't really think that it's right that they should, for after all, Mammy songs are the fundamental songs of our country.\" In this film, he notes, \"Jolson had the confidence to rhyme 'Mammy' with 'Uncle Sammy'\", adding \"Mammy songs, along with the vocation 'Mammy singer', were inventions of the Jewish Jazz Age.\"<ref>Alexander, Michael. ''Jazz Age Jews'', Princeton University Press (2003), p. 136.<!-- ISBN needed --></ref>\n\nThe film also gave a boost to the career of black singer and bandleader [[Cab Calloway]], who performed a number of songs alongside Jolson. In his autobiography, Calloway writes about this episode: {{quote|I'd heard Al Jolson was doing a new film on the Coast, and since [[Duke Ellington]] and his band had done a film, wasn't it possible for me and the band to do this one with Jolson. Frenchy got on the phone to California, spoke to someone connected with the film and the next thing I knew the band and I were booked into Chicago on our way to California for the film, ''The Singing Kid''. We had a hell of a time, although I had some pretty rough arguments with [[Harold Arlen]], who had written the music. Arlen was the songwriter for many of the finest [[Cotton Club]] revues, but he had done some interpretations for ''The Singing Kid'' that I just couldn't go along with. He was trying to change my style and I was fighting it. Finally, Jolson stepped in and said to Arlen, 'Look, Cab knows what he wants to do; let him do it his way.' After that, Arlen left me alone. And talk about integration: Hell, when the band and I got out to Hollywood, we were treated like pure royalty. Here were Jolson and I living in adjacent penthouses in a very plush hotel. We were costars in the film so we received equal treatment, no question about it.<ref>Calloway, Cab. ''Of Minnie the Moocher & Me'', Thomas Y. Crowell Company (1976), p. 131.<!-- ISBN needed --></ref>}}\n\n''The Singing Kid'' was not one of the studio's major attractions (it was released by the First National subsidiary), and Jolson did not even rate star billing. The song \"I Love to Singa\" later appeared in [[Tex Avery]]'s cartoon of the same name. The movie also became the first important role for future child star [[Sybil Jason]] in a scene directed by [[Busby Berkeley]]. Jason remembers that Berkeley worked on the film although he is not credited.<ref name=Fisher103>Fisher, James. ''Al Jolson: A Bio-bibliography'' (1994), p. 103.<!-- publishing info, ISBN needed --></ref>\n\n====''Rose of Washington Square'' (1939)====\nHis next movie—his first with [[Twentieth Century-Fox]]—was ''[[Rose of Washington Square]]'' (1939). It stars Jolson, [[Alice Faye]] and [[Tyrone Power]], and included many of Jolson's best known songs, although several songs were cut to shorten the movie's length, including \"[[April Showers (song)|April Showers]]\" and \"[[Avalon (Al Jolson song)|Avalon]]\". Reviewers wrote, \"Mr Jolson's singing of ''Mammy'', [[California, Here I Come]] and others is something for the memory book\"<ref>Nugent, Frank S., ''New York Times'', May 6, 1939, p. 21.</ref> and \"Of the three co-stars this is Jolson's picture ... because it's a pretty good catalog in anybody's hit parade.\"<ref>Abel. ''Variety''. May 10, 1939, p. 14.</ref> The movie was released on DVD in October 2008. Twentieth Century-Fox hired him to re-create a scene from ''The Jazz Singer'' in the [[Alice Faye]]-[[Don Ameche]] film ''Hollywood Cavalcade''. Guest appearances in two more Fox films followed that same year, but Jolson never starred in a full-length feature film again.\n\n===''The Jolson Story''===\n[[File:JolsonSingerPoster.JPG|thumb|original movie poster, 1946]]\nAfter the success of the [[George M. Cohan]] film biography, ''[[Yankee Doodle Dandy]]'' (1942), Hollywood columnist Sidney Skolsky believed that a similar film could be made about Al Jolson—and he knew just where to pitch the project. [[Harry Cohn]], the head of [[Columbia Pictures]], loved the music of Al Jolson. Skolsky pitched the idea of an Al Jolson biopic and Cohn agreed. It was directed by [[Alfred E. Green]],  best remembered for the [[Hays Code|pre-Code]] ''[[Baby Face (film)|Baby Face]]'' (1933), with musical numbers staged by [[Joseph H. Lewis (director)|Joseph H. Lewis]]. With Jolson providing almost all the vocals, and Columbia contract player [[Larry Parks]] playing Jolson, ''[[The Jolson Story]]'' (1946) became one of the biggest box-office hits of the year.<ref>[http://jolsonville.com/2010/02/26/the-jolson-story-opening-review/#more-852 \"The Jolson Story\" review], ''Liberty'', October 19, 1946</ref>\n\nLarry Parks wrote, in a personal tribute to Jolson:<blockquote>\"Stepping into his shoes was, for me, a matter of endless study, observation, energetic concentration to obtain, perfectly if possible, a simulation of the kind of man he was. It is not surprising, therefore, that while making ''The Jolson Story'', I spent 107 days before the cameras and lost eighteen pounds in weight.\"<ref>[http://jolsonville.com/eulogies/by-larry-parks/ \"A Tribute by Larry Parks\"] ''Jolsonville''</ref></blockquote>From a review in ''[[Variety (magazine)|Variety]]'':<blockquote>\"But the real star of the production is that Jolson voice and that Jolson medley. It was good showmanship to cast this film with lesser people, particularly Larry Parks as the mammy kid... As for Jolson's voice, it has never been better. Thus the magic of science has produced a composite whole to eclipse the original at his most youthful best.\"<ref>''Variety'', September 18, 1946, p. 16.</ref></blockquote>Parks received an [[Academy Award|Oscar]] nomination for [[Academy Award for Best Actor|Best Actor]]. Although the 60-year old Jolson was too old to play a younger version of himself in the movie, he persuaded the studio to let him appear in one musical sequence, \"[[Swanee (song)|Swanee]]\", shot entirely in long shot, with Jolson in blackface singing and dancing onto the runway leading into the middle of the theater. In the wake of the film's success and his WWII tours, Jolson became a top singer among the American public once more.<ref name=pop40t3B/><ref>Oberfirst, Robert, ‘‘Al Jolson: You Ain’t Heard Nothin’ Yet’’ (1980) Barnes & Co., London, p. 311.</ref> [[Decca Records]] signed Jolson and he recorded for Decca until his death.\n\n====Critical observations====\nAccording to film historian Krin Gabbard, ''The Jolson Story'' goes further than any of the earlier films in exploring the significance of blackface and the relationships that whites have developed with blacks in the area of music. To him, the film seems to imply an inclination of white performers, like Jolson, who are possessed with \"the joy of life and enough sensitivity, to appreciate the musical accomplishments of blacks\".<ref>Gabbard, Krin. ''Jammin' at the Margins'' (1996), University of Chicago Press, p. 53.<!-- ISBN needed --></ref> To support his view he describes a significant part of the movie:\n<blockquote>\"While wandering around New Orleans before a show with Dockstader's Minstrels, he enters a small club where a group of black jazz musicians are performing. Jolson has a revelation, that the staid repertoire of the minstrel troupe can be transformed by actually playing black music in blackface. He tells Dockstader that he wants to sing what he has just experienced: 'I heard some music tonight, something they call jazz. Some fellows just make it up as they go along. They pick it up out of the air.' After Dockstader refuses to accommodate Jolson's revolutionary concept, the narrative chronicles his climb to stardom as he allegedly injects jazz into his blackface performances ... Jolson's success is built on anticipating what Americans really want. Dockstader performs the inevitable function of the guardian of the status quo, whose hidebound commitment to what is about to become obsolete reinforces the audience's sympathy with the forward-looking hero.\"<ref name=Gabbard54>Gabbard, Krin. ''Jammin' at the Margins'', (1996) University of Chicago Press, p. 54.</ref></blockquote>\n\nThis has been a theme which was traditionally \"dear to the hearts of the men who made the movies.\"<ref name=Gabbard54/> Film historian George Custen describes this \"common scenario, in which the hero is vindicated for innovations that are initially greeted with resistance ... [T]he struggle of the heroic protagonist who anticipates changes in cultural attitudes is central to other white jazz biopics such as ''[[The Glenn Miller Story]]'' (1954) and ''[[The Benny Goodman Story]]'' (1955)\".<ref name=Custen>Custen, George. ''Bio/Pics: How Hollywood Constructed Public History'', (1992) Rutgers University Press, p. 147.</ref> \"Once we accept a semantic change from singing to playing the clarinet, ''[[The Benny Goodman Story]]'' becomes an almost transparent reworking of ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'' ... and ''[[The Jolson Story]]''.\"<ref name=Gabbard54/>\n\n====''Jolson Sings Again'' (1949)====\nA sequel, ''[[Jolson Sings Again]]'' (1949), opened at [[Loews Cineplex Entertainment|Loew]]'s State Theatre in New York and received positive reviews: \"Mr. Jolson's name is up in lights again and Broadway is wreathed in smiles\", wrote Thomas Pryor in ''The New York Times''. \"That's as it should be, for ''Jolson Sings Again'' is an occasion which warrants some lusty cheering...\".<ref name=\"Goldman, Herbert G. 1988 p. 287\">Goldman, Herbert G., ''Jolson – the Legend Comes to Life'' (1988), Oxford Univ. Press, p. 287.<!-- ISBN needed --></ref> Jolson did a tour of New York film theaters to plug the movie, traveling with a police convoy to make timetables for all showings, often ad libbing jokes and performing songs for the audience. Extra police were on duty as crowds jammed the streets and sidewalks at each theater Jolson visited.<ref>Goldman, Herbert G., Jolson – the Legend Comes to Life, (1988) Oxford Univ. Press, pp. 286–287.</ref> In Chicago, a few weeks later, he sang to 100,000&nbsp;people at Soldier Field, and later that night appeared at the Oriental Theatre with George Jessel where 10,000&nbsp;people had to be turned away.<ref name=\"Goldman, Herbert G. 1988 p. 287\"/>\n\nIn [[Baltimore, Maryland]], he took his wife Erle to St Mary's Industrial School in Baltimore, where he had been confined for a while as a boy and treated for tuberculosis. He introduced her to the same Xaverian Brother, Brother Benjamin, who watched over him. That night, Jolson took over two hundred of the church's kids to see ''Jolson Sings Again'' at the [[Hippodrome Theatre, Baltimore|Hippodrome Theatre]]. A few weeks later, the Jolsons were received by [[President of the United States|President]] [[Harry Truman]] at the [[White House]]. {{cn|date=September 2014}}\n\n====Radio shows====\nJolson had been a popular guest star on radio since its earliest days, including on NBC's ''[[The Dodge Victory Hour]]'' (January 1928), singing from a New Orleans hotel to an audience of 35 million via 47 radio stations. His own 1930s shows included ''Presenting Al Jolson'' (1932) and ''[[Shell Chateau]]'' (1935), and he was the host of the ''[[Kraft Music Hall]]'' from 1947 to 1949, with [[Oscar Levant]] as a sardonic, piano-playing sidekick. Jolson's 1940s career revival was nothing short of a success despite the competition of younger performers such as [[Bing Crosby]] and [[Frank Sinatra]], and he was voted the \"Most Popular Male Vocalist\" in 1948 by a poll in ''[[Variety (magazine)|Variety]]''. The next year, Jolson was named \"Personality of the Year\" by the [[Variety Club]]s of America. When Jolson appeared on Bing Crosby's radio show, he attributed his receiving the award to his being the only singer of any importance not to make a record of \"[[Mule Train]]\", which had been a widely covered hit of that year (four different versions, one of them by Crosby, had made the top ten on the charts). Jolson joked about how his voice had deepened with age, saying \"I got the clippetys all right, but I can't clop like I used to.\" {{cn|date=September 2014}}\n\n====Television work====\nWhen Jolson appeared on [[Steve Allen]]'s [[KNX (AM)|KNX]] Los Angeles radio show in 1949 to promote ''Jolson Sings Again'', he offered his curt opinion of the burgeoning television industry: \"I call it smell-evision.\" Writer Hal Kanter recalled that Jolson's own idea of his television debut would be a corporate-sponsored, extra-length spectacular that would feature him as the only performer, and would be telecast without interruption. In 1950, it was announced that Jolson had agreed to appear on the [[CBS]] television network. However, he died before production began. {{cn|date=September 2014}}\n\n==World War II and Korean War tours==\n===World War II===\nJapanese bombs on [[Pearl Harbor]] shook Jolson out of continuing moods of lethargy due to years of little activity and \"... he dedicated himself to a new mission in life.... Even before the [[U.S.O.]] began to set up a formal program overseas, the excitable Jolson was deluging War and Navy Department brass with phone calls and wires. He demanded permission to go anywhere in the world where there is an American serviceman who wouldn't mind listening to ‘Sonny Boy’ or ‘Mammy’.... [and] early in 1942, Jolson became the first star to perform at a GI base in [[World War II]]\".<ref name=Abramson43-44>Abramson, Martin, ''The Real Story of Al Jolson''. 1950, pp. 43–44.<!-- publishing info, ISBN needed --></ref>\n\n[[File:With Patton.JPG|thumb|left|with [[General Patton]], World War II]]\nFrom a ''[[New York Times]]'' interview in 1942: \"When the war started... [I] felt that it was up to me to do something, and the only thing I know is show business. I went around during the last war and I saw that the boys needed something besides chow and drills. I knew the same was true today, so I told the people in Washington that I would go anywhere and do an act for the Army.\"<ref name=Woolf>Woolf, S.J. [http://jolsonville.com/articles/world-war-ii-tours/army-minstrel-1942/ \"Army Minstrel.\"] ''New York Times''. September 27, 1942.</ref> Shortly after the war began, he wrote a letter to Steven Early, press secretary to President [[Franklin D. Roosevelt]], volunteering \"to head a committee for the entertainment of soldiers and said that he \"would work without pay... [and] would gladly assist in the organization to be set up for this purpose\". A few weeks later, he received his first tour schedule from the newly formed [[United Services Organization]] (USO), \"the group his letter to Early had helped create\".<ref>Goldman, Herbert G., ''Jolson – the Legend Comes to Life'' (1988), Oxford Univ. Press, p. 253.</ref>\n\nHe did as many as four shows a day in the jungle outposts of Central America and covered the string of U.S. Naval bases. He paid for part of the transportation out of his own pocket. Upon doing his first, and unannounced, show in England in 1942, the reporter for the ''Hartford Courant'' wrote, \"... it was a panic. And pandemonium... when he was done the applause that shook that soldier-packed room was like bombs falling again in Shaftsbury Avenue.\"<ref>Morehouse, Ward. [http://jolsonville.com/articles/world-war-ii-tours/england-cheers-his-first-performance-1942 ''Hartford Courant'' article],  September 20, 1942.</ref>\n\nFrom an article in the ''[[New York Times]]'': \"He [Jolson] has been to more Army camps and played to more soldiers than any other entertainer. He has crossed the Atlantic by plane to take song and cheer to the troops in Britain and Northern Ireland. He has flown to the cold wastes of Alaska and the steaming forests of [[Trinidad]]. He has called at Dutch‑like Curaçao. Nearly every camp in this country has heard him sing and tell funny stories.\"<ref name=Woolf/> Some of the unusual hardships of performing to active troops were described in an article he wrote for ''Variety,'' in 1942: \"In order to entertain all the boys ... it became necessary for us to give shows in foxholes, gun emplacements, dugouts, to construction groups on military roads; in fact, any place where two or more soldiers were gathered together, it automatically became a Winter Garden for me and I would give a show.\"<ref>Goldman, Herbert G., ''Jolson -– the Legend Comes to Life'' (1988), Oxford Univ. Press, p. 256.<!-- ISBN needed --></ref> After returning from a tour of overseas bases, the Regimental Hostess at one camp wrote to Jolson, \"Allow me to say on behalf of all the soldiers of the 33rd Infantry that you coming here is quite the most wonderful thing that has ever happened to us, and we think you're tops, not only as a performer, but as a person. We unanimously elect you Public Morale Lifter No. 1 of the U.S Army.\"<ref>Goldman, p. 257.</ref>\n\nJolson was officially enlisted in the [[United Service Organizations]] (USO), the organization which provided entertainment for American troops who served in combat overseas.<ref>Oberfirst, Robert, ''Al Jolson: You Ain't Heard Nothin' Yet'' (1980) Barnes & Co., London, p. 285.</ref> Because he was over the age of 45, he received a \"Specialist\" rating that permitted him to wear a uniform and be given the standing of an officer. While touring in the Pacific, Jolson contracted [[malaria]] and had to have his left lung surgically removed. In 1946, during a nationally broadcast testimonial dinner in New York City, given on his behalf, he received a special tribute from the American Veterans Committee in honor of his volunteer services during WWII.<ref name=pop40t3B/> And in 1949, the movie ''[[Jolson Sings Again]]'' recreated some scenes showing Jolson during his war tours.<ref>{{cite web|url=http://www.youtube.com/watch?v=hC8ZmBIouzQ|title=Broadcast Yourself|publisher=YouTube|accessdate=2010-03-05}}</ref>\n\n===Korean War===\nIn 1950, according to Jolson's biographer [[Michael Freedland]],<ref>Freedland, Michael. ''Jolson – The Story of Al Jolson'' (1972, 2007)</ref> \"the United States answered the call of the [[United Nations Security Council]] ... and had gone to fight the North Koreans. ... [Jolson] rang the White House again. 'I'm gonna go to Korea,' he told a startled official on the phone. 'No one seems to know anything about the USO, and it's up to [[Harry S. Truman|President Truman]] to get me there.' He was promised that President Truman and [[Douglas MacArthur|General MacArthur]], who had taken command of the Korean front, would get to hear of his offer. But for four weeks there was nothing. ... Finally, [[Louis A. Johnson]], Secretary of Defense, sent Jolson a telegram. 'Sorry for delay but regret no funds for entertainment – STOP; USO disbanded – STOP.' The message was as much an assault on the Jolson sense of patriotism as the actual crossing of the 38th Parallel had been. 'What are they talkin' about', he thundered. 'Funds? Who needs funds? I got funds! I'll pay myself!'\"<ref>Freedland, pp. 283–284.</ref>\n\n[[File:Jolson-Korea.jpg|thumb|left|Performing in Korea]]\nOn September 17, 1950, a dispatch from 8th Army Headquarters, Korea, announced, \"Al Jolson, the first top-flight entertainer to reach the war-front, landed here today by plane from Los Angeles...\" Jolson  traveled to Korea at his own expense. \"[A]nd a lean, smiling Jolson drove himself without letup through 42 shows in 16&nbsp;days.\"<ref>Abramson, Martin, ''The Real Story of Al Jolson''. 1950, p. 46.<!-- publishing info and ISBN needed --></ref>\n\nBefore returning to the U.S., General [[Douglas MacArthur]], leader of UN forces, gave him a medallion inscribed \"To Al Jolson from Special Services in appreciation of entertainment of armed forces personnel ‑ Far East Command”, with his entire itinerary inscribed on the reverse side.<ref> ''Cosmopolitan Magazine'', January 1951.</ref> A few months later, an important bridge, named the \"Al Jolson Bridge\", was used to withdraw the bulk of American troops from [[North Korea]].<ref>Dutton, John. ''The Forgotten Punch in the Army's Fist: Korea 1950–1953'', Ken Anderson, (2003), p. 98.</ref> The bridge was the last remaining of three bridges across the [[Han River (Korea)|Han River]] and was used to evacuate UN forces. It was demolished by UN forces after the army made it safely across in order to prevent the Chinese from crossing.<ref>Spurr, Russell. [http://books.google.com/books?id=Y6gpLDZi4hcC&pg=PA275&dq=Spurr+Enter+the+Dragon+Jolson&hl=en&ei=O43xTNCUDI_4sAPUnfXBCw&sa=X&oi=book_result&ct=result&resnum=1&ved=0CCgQ6AEwAA#v=onepage&q&f=false' ''Enter the Dragon: China's Undeclared War Against the U.S. in Korea, 1950-51''], Newmarket Press, NY (1998) p. 281.<!-- ISBN needed --></ref>\n\n[[Alistair Cooke]] wrote, \"He [Jolson] had one last hour of glory. He offered to fly to Korea and entertain the troops hemmed in on the United Nations precarious August bridgehead. The troops yelled for his appearance. He went down on his knee again and sang 'Mammy', and the troops wept and cheered. When he was asked what Korea was like he warmly answered, 'I am going to get back my income tax returns and see if I paid enough.'\"<ref>Cooke, Alistair. \"Al Jolson dies on crest of a wave.\" ''The Guardian'' (UK). October 25, 1950.</ref> [[Jack Benny]], who went to Korea the following year, noted that an amphitheater in Korea where troops were entertained, was named the \"Al Jolson Bowl.\"<ref>[[Mary Livingstone|Livingstone, Mary]]. ''Jack Benny'', Doubleday (1978) pp. 184–185.<!-- ISBN needed --></ref>\n\n;New U.S.O. movie\n[[File:Marshall-giving-medal-of-merit.jpg|thumb|Defense Secretary [[George Marshall]] presenting the [[Medal for Merit]] to Jolson's family.]]\nJust 10 days after he returned from Korea, he had agreed with [[R.K.O.]] producers [[Jerry Wald]] and [[Norman Krasna]] to star in a new movie, ''Stars and Stripes for Ever'', about a USO troupe in the South Pacific during World War II. The screenplay was to be written by [[Herbert Baker (screenwriter)|Herbert Baker]], writer of the 1980 version of ''[[The Jazz Singer (1980 film)|The Jazz Singer]]'' starring [[Neil Diamond]]. The film was to costar singer [[Dinah Shore]].<ref>[http://select.nytimes.com/gst/abstract.html?res=F10A14F9385E16738FDDA80994D8415B8089F1D3&scp=9&sq=Al+Jolson+war&st=p \"Jolson to Return to Screen at R.K.O.\"], ''New York Times'', October 11, 1950.</ref>\n\nJolson had however greatly overexerted himself performing in Korea, especially for a man who was missing a lung, and only two weeks after signing the agreement, he succumbed to a [[heart attack]] in [[San Francisco]].. He was survived by his wife and their two recently adopted children. A few months after his death, Defense Secretary [[George Marshall]] presented the [[Medal for Merit]] to Jolson, \"to whom this country owes a debt which cannot be repaid\". The medal, carrying a citation noting that Jolson's \"contribution to the U.N. action in Korea was made at the expense of his life\", was presented to Jolson's adopted son as Jolson's widow looked on.<ref name=Fisher103/>  Columbia too had been thinking about a third Jolson musical, and this time Jolson would play himself. The project, tentatively entitled ''You Ain't Heard Nothin' Yet'', was to dramatize Jolson's recent tours of military bases. The projected film was abruptly canceled. {{cn|date=September 2014}}\n\n==Personal life==\n===Politics===\n[[File:Aljolsoncoolidge.jpg|thumb|Jolson (right) with [[President of the United States|President]] [[Calvin Coolidge]], 1924]]\nJolson was a political and economic [[Conservatism in the United States|conservative]], supporting both [[Warren G. Harding]] in 1920 and [[Calvin Coolidge]] in 1924 for [[president of the United States]]. As \"one of the biggest stars of his time, [he] worked his magic singing ''Harding, You're the Man for Us'' to enthralled audiences&nbsp;... [and] was subsequently asked to perform ''Keep Cool with Coolidge'' four years later. ...&nbsp;Jolson, like the men who ran the studios, was the rare showbiz [[Republican Party (United States)|Republican]].\"<ref>Kusinitz, Kevin. [http://www.weeklystandard.com/Content/Public/Articles/000/000/015/127joosu.asp \"Celebrity Endorsements\"], ''The Daily Standard'', May 23, 2008.</ref> Jolson, a Republican, publicly campaigned for Democrat [[Franklin Delano Roosevelt]] in 1932.<ref>Oberfirst, p. 241.</ref> By the next presidential election (1936), he was back to supporting Republican [[Alf Landon]] and would not support another Democrat for president during his life. {{cn|date=September 2014}}\n\n===Married life===\nIn 1906, while living in San Francisco, Jolson met dancer Henrietta Keller, and the two engaged in a year-long relationship before marrying in September 1907.<ref name=JolyM/> In 1918, however, Henrietta — tired of what she reputedly considered his [[Promiscuity|womanizing]] and refusal to come home after shows — filed for divorce. In 1920, Jolson began a relationship with Broadway actress Alma Osbourne (known professionally as '''Ethel Delmar'''); the two were married in August 1922<ref>Oberfirst, p. 256.</ref> but she divorced Jolson in 1928. {{cn|date=September 2014}}\n\n====Ruby Keeler====\nIn the summer of 1928, Jolson met young tap dancer, and later actress, [[Ruby Keeler]] at [[Texas Guinan]]'s night club and was dazzled by her on sight; at the club, the two danced together. Three weeks later, Jolson saw a production of [[George M. Cohan]]'s ''Rise of Rosie O'Reilly'', and noticed she was in the show's cast. Now knowing she was going about her Broadway career, Jolson attended another one of her shows, ''[[Show Girl]]'', and rose from the audience and engaged in her duet of \"Liza\". After this moment, the show's producer, [[Florenz Ziegfeld]], asked Jolson to join the cast and continue to sing duets with Keeler. Jolson accepted Ziegfeld's offer and during their tour with Ziegfeld, the two started dating and were married on September 21, 1928. In 1935, Al and Ruby adopted a son, whom they named \"Al Jolson Jr.\"<ref name=JolyM/> In 1939, however—despite a marriage that was considered to be more successful than his previous ones—Keeler left Jolson, and later married John Homer Lowe, with whom she would have four children and remain married until his death in 1969.<ref name=JolyM/><ref>Oberfirst, Robert, ‘‘Al Jolson: You Ain’t Heard Nothin’ Yet’’ (1980) Barnes & Co., London, pp. 223–259.</ref>\n[[File:Al and Erle Jolson, 1946.jpg|left|thumb|Jolson and wife, Erle, 1946]]\n\n====Erle Galbraith====\nIn 1944, while giving a show at a military hospital in [[Hot Springs, Arkansas]], Jolson met a young [[X-ray]] technologist, Erle Galbraith. He became fascinated with her and more than a year later he was able to track her down and hired her as an actress while he served as a producer at [[Columbia Pictures]]. After Jolson, whose health was still scarred from his previous battle with [[malaria]], was hospitalized in the winter of 1945, Erle visited him and the two quickly began a relationship. They were married on March 22, 1945. During their marriage, the Jolsons adopted two children, Asa Jr. (born 1948) and Alicia (born 1949),<ref name=JolyM/> and remained married until his death in 1950.<ref>Oberfirst, pp. 293–298.</ref>\n\nAfter a year and a half of marriage, his new wife had actually never seen him perform in front of an audience, and the first occasion came unplanned. As told by actor comedian [[Alan King (comedian)|Alan King]], it happened during a dinner by the [[New York Friars' Club]] at the [[Waldorf-Astoria Hotel|Waldorf Astoria]] in 1946, honoring the career of [[Sophie Tucker]]. Jolson and his wife were in the audience along with a thousand others, and [[George Jessel (actor)|George Jessel]] was [[emcee]]. He asked Al, privately, to perform at least one song. Jolson replied, \"No, I just want to sit here.\" Then later, without warning, during the middle of the show, Jessel says, \"Ladies and gentlemen, this is the easiest introduction I ever had to make. The world's greatest entertainer, Al Jolson.\" King recalls what happened next:{{quote|The place is going wild. Jolson gets up, takes a bow, sits down. . . people start banging with their feet, and he gets up, takes another bow, sits down again. It's chaos, and slowly, he seems to relent. He walks up onto the stage . . . kids around with Sophie and gets a few laughs, but the people are yelling, 'Sing! Sing! Sing!' . . . Then he says, 'I'd like to introduce you to my bride,' and this lovely young thing gets up and takes a bow. The audience doesn't care about the bride, they don't even care about Sophie Tucker. 'Sing! Sing! Sing!' they're screaming again.<br> 'My wife has never seen me entertain', Jolson says, and looks over toward [[Lester Lanin]], the orchestra leader: 'Maestro, is it true what they say about Dixie?'<ref name=King>[[Alan King (comedian)|King, Alan]]. ''Name Dropping'', Simon and Schuster (1997)<!-- publishing info, ISBN needed --></ref>}}\n\n===Closeness with his brother Harry===\nDespite their close relationship growing up, Harry did show some disdain for Al's success over the years. Even during their time with Jack Palmer, Al was rising in popularity while Harry was fading. After separating from Al and Jack, Harry's career in show business, however, sank greatly. On one occasion—which was another factor in his on-off relationship with Al—Harry offered to be Al's agent, but Al rejected the offer, worried about the pressure that he would have faced from his producers for hiring his brother as his agent. Shortly after Harry's wife Lillian died in 1948, Harry and Al became close once again.<ref>Oberfirst,  pp. 318–324.</ref>\n\n==Death and commemoration==\n[[File:Al Jolson - publicity.JPG|thumb|Publicity photo c. 1925]]\nThe dust and dirt of the Korean front, from where he had returned a few weeks earlier, had settled in his remaining lung and he was close to exhaustion. While playing cards in his suite at the [[St. Francis Hotel]] at 335 Powell Street in [[San Francisco]],<ref>Marilyn Monroe Dyed Here – More Locations of America's Pop Culture Landmarks by Chris Epting, p. 187.</ref> Jolson collapsed and died of a massive [[myocardial infarction|heart attack]] on October 23, 1950. His last words were said to be \"Boys, I'm going.\"<ref>{{YouTube|keM4cE7w0n8|Jolson in Korea}}, Video, 9 min</ref> His age was given as 64. \n\nAfter his wife received the news of his death by phone, she went into shock, and required family members to stay with her. At the funeral, police estimated upwards of 20,000&nbsp;people showed up, despite threatened rain. It became one of the biggest funerals in show business history.<ref name=\"Goldman, Herbert G. 1988 p. 300\">Goldman, Herbert G., Jolson – the Legend Comes to Life, (1988) Oxford Univ. Press, p. 300.</ref> Celebrities paid tribute: [[Bob Hope]], speaking from Korea via short wave radio, said the world had lost \"not only a great entertainer, but also a great citizen.\" [[Larry Parks]] said that the world had \"lost not only its greatest entertainer, but a great American as well. He was a casualty of the [Korean] war.\" Scripps-Howard newspapers drew a pair of white gloves on a black background. The caption read, \"The Song Is Ended.\"<ref name=\"Goldman, Herbert G. 1988 p. 300\"/>\n\nNewspaper columnist and radio reporter [[Walter Winchell]] said,\n:\"He was the first to entertain troops in World War Two, contracted malaria and lost a lung. Then in his upper sixties he was again the first to offer his singing gifts for bringing solace to the wounded and weary in Korea.\n:\"Today we know the exertion of his journey to Korea took a greater toll of his strength than perhaps even he realized. But he considered it his duty as an American to be there, and that was all that mattered to him. Jolson died in a San Francisco hotel. Yet he was as much a battle casualty as any American soldier who has fallen on the rocky slopes of Korea … A star for more than 40 years, he earned his most glorious star rating at the end—a gold star.\"<ref name=Winchell>Winchell, Walter. [http://jolsonville.com/eulogies/by-walter-winchell \"A Song for Al Jolson\"], jolsonville.com; accessed September 19, 2014.</ref>\n\nFriend [[George Jessel (actor)|George Jessel]] said during part of his eulogy, {{quote|The history of the world does not say enough about how important the song and the singer have been. But history must record the name Jolson, who in the twilight of his life sang his heart out in a foreign land, to the wounded and to the valiant. I am proud to have basked in the sunlight of his greatness, to have been part of his time.<ref name=Jessel>{{cite web|url=http://jolsonville.com/eulogies/by-george-jessel|title=The Majesty of Jolie|author=Jessel, George|date=1950-10-26|archiveurl=http://jolsonville.com/eulogies/by-george-jessel|archivedate=2008-10-27}}</ref>}}\n\n;Memorial\nHe was interred in the [[Hillside Memorial Park Cemetery]] in [[Culver City, California]].<ref>{{Find a Grave|551}}</ref> Jolson’s widow purchased a plot at Hillside and commissioned his mausoleum to be designed by well-known black architect [[Paul Williams (architect)|Paul Williams]]. The six-pillar marble structure is topped by a dome, next to a three-quarter-size bronze statue of Jolson, eternally resting on one knee, arms outstretched, apparently ready to break into another verse of “Mammy”. The inside of the dome features a huge mosaic of [[Moses]] holding the tablets containing the [[Ten Commandments]], and identifies Jolson as “The Sweet Singer of [[Israel]]” and “The Man Raised Up High”. On the day he died, Broadway dimmed its lights in Jolson's honor, and radio stations all over the world were paying tributes. Soon after his death, the [[BBC]] presented a special program entitled ''Jolson Sings On''. His death unleashed tributes from all over the world, including a number of eulogies from friends, including [[George Jessel (actor)|George Jessel]], [[Walter Winchell]], and [[Eddie Cantor]].<ref>{{cite web|url=http://jolsonville.com|title=Tribute site|publisher=Jolsonville.com|accessdate=2010-03-05}}</ref> He contributed millions to Jewish and other charities in his will.<ref>{{cite web|url=https://www.jewishvirtuallibrary.org/jsource/biography/jolson.html|title=Al Jolson|author=Brody, Seymour|work=Jewish Heroes & Heroines of America : 150 True Stories of American Jewish Heroism|publisher=Jewishvirtuallibrary.org|year=1996|accessdate=2008-10-27}}</ref>\n\n[[File:Jolson Way.jpg|thumb|<center>Al Jolson Way in New York City</center>]]\nIn October, 2008, a new documentary film, ''Al Jolson and The Jazz Singer'',<ref>http://www.imdb.com/title/tt1340416/</ref> premiered at the 50th [[Lübeck Nordic Film Days]], [[Lübeck]], [[Germany]], and won 1st Prize at an annual film competition in [[Kiel]] a few weeks later.<ref>[http://www.imkin.de/ki/informieren/aktuelles/artikel.php?archiv=4727 ''Al Jolson and The Jazz Singer'' wins 1st Prize], November 15, 2008.</ref> In November, 2007, a similar documentary, ''A Look at Al Jolson'', was winner at the same festival.<ref>[http://www.oksh.de/sh/informieren/aktuelles/artikel.php?archiv=2993 ''A Look at Al Jolson'', winner at German film festival] November, 2007</ref> Jolson's music remains very popular today both in America and abroad with numerous CDs in print.<ref>{{cite web|url=http://www.amazon.com/s?url=search-alias%3Dpopular&field-keywords=Al+Jolson|title=Al Jolson: Music|publisher=Amazon.com|accessdate=2008-10-27}}</ref>\n\nAl Jolson has three stars on the [[Hollywood Walk of Fame]]:\n* 6622 Hollywood Blvd. for his contribution to motion pictures\n* 1716 Vine St. for his mark on the recording industry\n* 6750 Hollywood Blvd. for his achievements in radio\n\nIn 2000, a Golden Palm Star on the [[Palm Springs, California]], [[Palm Springs Walk of Stars|Walk of Stars]] was dedicated to him.<ref>{{cite web|url=http://www.palmspringswalkofstars.com/web-storage/Stars/Stars%20dedicated%20by%20date.pdf |title=Palm Springs Walk of Stars by date dedicated|format=PDF|accessdate=2013-09-15}}</ref>\n\nJolson is also a member of the [[American Theater Hall of Fame]].<ref>{{cite web|url=http://www.theaterhalloffame.org/members.html#I_J|title=Theater Hall of Fame members}}</ref>\n\nForty-four years after Jolson's death, the United States Postal Service honored him by issuing a postage stamp. The 29-cent stamp was unveiled by Erle Jolson Krasna, Jolson's fourth wife, at a ceremony in [[New York City]]'s [[Lincoln Center]] on September 1, 1994. This stamp was one of a series honoring popular American singers, which included [[Bing Crosby]], [[Nat King Cole]], [[Ethel Merman]], and [[Ethel Waters]]. And in 2006, Jolson had a street in New York named after him with the help of the '''Al Jolson Society'''.<ref>{{cite web|url=http://www.jolson.org|title=jolson.org|publisher=jolson.org|accessdate=2013-09-15}}</ref>\n{{clear}}\n\n==Legacy and influence==\n[[File:Berlin-Jolson27.JPG|thumb|<div class=\"center\">With [[Irving Berlin]], circa 1927</div>]]\nAccording to music historians Bruce Crowther and Mike Pinfold: \"During his time he was the best known and most popular all-around entertainer America (and probably the world) has ever known, captivating audiences in the theatre and becoming an attraction on records, radio, and in films. He opened the ears of white audiences to the existence of musical forms alien to their previous understanding and experience ... and helped prepare the way for others who would bring a more realistic and sympathetic touch to black musical traditions.\"<ref name=Crowther/> Black songwriter [[Noble Sissle]], in the 1930s, said \"[h]e was always the champion of the Negro songwriter and performer, and was first to put Negroes in his shows\". Of Jolson's\n\"Mammy\" songs, he adds, \"with real tears streaming down his blackened face, he immortalized the Negro motherhood of America as no individual could.\"<ref>Knight, Arthur. ''Disintegrating the Musical: Black Performance and American Musical film'', Duke University Press (2002).</ref>\n\nHowever, Jolson's signature style, loud and passionate, was soon eclipsed by the cooler and more intimate style of the [[crooners]], singers such as [[Bing Crosby]] and [[Frank Sinatra]], who dominated the pop charts in the 1930s, 1940s, and 1950s. While Jolson could and did croon, his basic style was formed in the era when a singer needed to project to the back of a theater with his own physical power; later singers who developed in the microphone era were freed from this constraint.<ref>{{cite web |url=http://www.shsu.edu/~lis_fwh/book/roots_of_rock/support/crooner/EarlyCroonersIntro2.htm |title=The Coming of the Crooners |author=Ian Whitcomb |editor=Frank Hoffmann |work=Survey of American Popular Music |publisher=Sam Houston State University |accessdate=May 1, 2014}}</ref><ref>{{cite book |last1=Pitts |first1=Michael |last2=Hoffman |first2=Frank |last3=Carty |first3=Dick |last4=Bedoian |first4=Dick |title=The Rise of the Crooners: Gene Austin, Russ Columbo, Bing Crosby, Nick Lucas, Johnny Marvin and Rudy Vallee |url=http://books.google.com/books?id=Deb9AAAAQBAJ&printsec=frontcover&dq=The+Rise+of+the+Crooners:+Gene+Austin,+Russ+Columbo,+Bing+Crosby,+Nick+Lucas,+Johnny+Marvin+and+Rudy+Vallee&hl=en&sa=X&ei=onRiU7CILIq62wWGy4GACQ&ved=0CC0Q6AEwAA#v=onepage&q=The%20Rise%20of%20the%20Crooners%3A%20Gene%20Austin%2C%20Russ%20Columbo%2C%20Bing%20Crosby%2C%20Nick%20Lucas%2C%20Johnny%20Marvin%20and%20Rudy%20Vallee&f=false |accessdate=May 1, 2014 |year=2002 |publisher=Scarecrow Press |isbn=978-0810840812}}</ref>\n\nA few of the people and places that have been influenced by Jolson:\n;[[Irving Berlin]]\n:As the movies became a vital part of the entertainment industry, Berlin was forced to \"reinvent himself as a songwriter\". Biographer Laurence Bergreen wrote that while Berlin's music was \"Too old fashioned for progressive Broadway, his music was thoroughly up-to-date in conservative Hollywood.\" He had his earliest piece of luck in the first sound picture, ''The Jazz Singer'', where Jolson performed his song [[Blue Skies (1926 song)|\"Blue Skies\"]],<ref name=Bergreen>Bergreen, Laurence. ''As Thousands Cheer: The Life of Irving Berlin'', Da Capo Press (1996).</ref> the first time a song was ever performed in a feature film. In 1930, he wrote the music for Jolson's fourth movie, ''Mammy'', which included hit songs such as \"Let Me Sing and I'm Happy\", \"Pretty Baby\", and \"Mammy\".\n\n;[[Judy Garland]]\n:Garland had performed a tribute to Jolson in her concerts of 1951 at the [[London Palladium]] and at New York's [[Palace Theatre (Broadway)|Palace Theater]]. Both concerts were to become \"central to this first of her many comebacks, and centered around her impersonation of Al Jolson... performing \"[[Swanee (song)|Swanee]]\" in her odd vocal drag of Jolson.\"<ref name=Whitfield>Whitfield, Stephen J., ''In Search of American Jewish Culture'', Brandeis University Press (2001).</ref><ref>[http://jolsonville.com/2010/09/04/a-star-is-born-judy-garlands-comeback ]{{dead link|date=September 2013}}</ref>\n\n;[[Bing Crosby]]\n:Music historian Richard Grudens writes that [[Kathryn Crosby]] cheerfully reviewed the chapter about her beloved Bing and his inspiration, Al Jolson. . .where Bing had written, \"His chief attribute was the sort of electricity he generated when he sang. Nobody in those days did that. When he came out and started to sing, he just elevated that audience immediately. Within the first eight bars he had them in the palm of his hand.\"<ref name=Crowther>Crowther, Bruce, and Pinfold, Mike. ''Singing Jazz: The Singers and Their Styles'', Hal Leonard Corp. (1997).</ref> In Crosby's ''[[Pop Chronicles]]'' interview, he fondly recalled seeing Jolson perform and praised his \"electric delivery\".<ref name=pop40t3B/>\n\n:Crosby's biographer Gary Giddins wrote of Crosby's admiration for Jolson's performance style: \"Bing marveled at how he seemed to personally reach each member of the audience.\" Crosby once told a fan, \"I'm not an electrifying performer at all. I just sing a few little songs. But this man could really galvanize an audience into a frenzy. He could really tear them apart.\"<ref name=Giddins>Giddins, Gary. ''Bing Crosby: A Pocketful of Dreams'', Back Bay (2002).</ref>\n\n;[[Tony Bennett]]\n:\"My father... took us to see one of the first talking pictures, [[The Singing Fool]], in which Al Jolson sang \"[[Sonny Boy (song)|Sonny Boy]]\". In a way, you could say that Jolson was my earliest influence as a singer. I was so excited by what I saw that I spent hours listening to Jolson and [[Eddie Cantor]] on the radio. In fact, I staged my first public performance shortly after seeing that movie... to imitate Jolson... I leaped into the living room and announced to the adults, who were staring at me in amazement, 'Me Sonny Boy!' The whole family roared with laughter.\"<ref>Bennett, Tony and Friedwald, Will. ''The Good Life'', Simon and Schuster (1998).</ref>\n\n[[File:Firstdaycover JC.JPG|thumb|right|\"50th Anniversary Year of Talking Pictures\" stamp on first-day-of-issue cover featuring Jolson]]\n;[[Neil Diamond]]\n:Journalist David Wild writes that the 1927 movie ''The Jazz Singer'', would mirror Diamond's own life, \"the story of a Jewish kid from New York who leaves everything behind to pursue his dream of making popular music in Los Angeles\". Diamond says it was \"the story of someone who wants to break away from the traditional family situation and find his own path. And in that sense, it 'is' my story.\" In 1972, Diamond gave the first solo concert performance on Broadway since Al Jolson, and starred in the 1980 remake of ''Jazz Singer'', with [[Laurence Olivier]] and [[Lucie Arnaz]].<ref>Wild, David. ''He Is ... I say: How I Learned to Stop Worrying and Love Neil Diamond'', Da Capo Press (2008).</ref>\n\n;[[Jerry Lewis]]\n:Actor and comedian Jerry Lewis starred in a televised version (without blackface) of ''The Jazz Singer'' in 1959. Lewis's biographer, Murray Pomerance, writes that \"Jerry surely had his father in mind when he remade the film\", adding that Lewis himself \"told an interviewer that his parents had been so poor that they could not afford to give him a bar mitzvah.\" In 1956, Lewis recorded \"[[Rock-A-Bye Your Baby With A Dixie Melody|Rock-A-Bye Your Baby]]\".<ref>Pomerance, Murray. ''Enfant Terrible: Jerry Lewis in American Film'', New York University Press (2002).</ref>\n\n;[[Eddie Fisher (singer)|Eddie Fisher]]\n:On a tour of the Soviet Union with his then wife, [[Elizabeth Taylor]], Fisher wrote in his autobiography that \"[[Nikita Khrushchev|Khrushchev]]'s mistress asked me to sing... I was the first American to be invited to sing in the Kremlin since [[Paul Robeson]]. The next day the Herald-Tribune headlines [read] 'Eddie Fisher Rocks the Kremlin'. I gave them my best Jolson: \"Swanee\", \"April Showers\" and finally \"[[Rock-A-Bye Your Baby With A Dixie Melody]]\". I had the audience of Russian diplomats and dignitaries on their feet swaying with me.\"<ref>Fisher, Eddie. ''Been There, Done That: An Autobiography'', Macmillan (2000), p. 80.</ref> In 1951, Fisher dedicated his \"smash hit\" song, \"Good-bye, G.I. Al,\" to Jolson, and presented a copy personally to Jolson's widow.<ref>''Billboard'', April 14, 1951, p. 25.</ref> With one of his later wives, [[Connie Stevens]], he had a daughter, [[Joely Fisher]], whose name honors Jolson.\n\n;[[Bobby Darin]]\n:Darin's biographer, David Evanier, writes that when Darin was a youngster, stuck at home because of rheumatic fever, \"[h]e spent most of the time reading and coloring as well as listening to the big-band music and Jolson records... He started to do Jolson imitations... he was crazy about Jolson.\" Darin's manager, Steve Blauner, who also became a movie producer and vice president of [[Screen Gems]], likewise began his career \"as a little boy doing Al Jolson imitations after seeing ''The Jolson Story'' 13 times ...\"<ref>Evanier, David. ''Roman Candle: The Life of Bobby Darin'', Rodale (2004), p. 58.</ref>\n\n;[[Ernest Hemingway]]\n:In his memoirs, ''[[A Moveable Feast]]'', Ernest Hemingway wrote that \"[[Zelda Fitzgerald]]... leaned forward and said to me, telling me her great secret, 'Ernest, don't you think Al Jolson is greater than Jesus?'\" <ref>Hemingway, Ernest. ''A Moveable Feast'', Scribner (1964), p. 186.</ref>\n\n;[[State of California]]\n:According to California historians Stephanie Barron and Sheri Bernstein, \"few artists have done as much to publicize California as did Al Jolson\" who performed and wrote the lyrics for \"[[California, Here I Come]]\".<ref>Barron, Stephanie, and Bernstein, Sheri. ''Reading California Art, Image, and Identity'', Univ. of California Press (2001).</ref> It is considered the unofficial song of the Golden State.<ref>Studwell, William E. and Schueneman, Bruce R., ''State Songs of the United States: An Annotated Anthology'', Haworth Press (1977)</ref> Another example is the 1928 song \"Golden Gate\" ([[Dave Dreyer]], [[Joseph Meyer (songwriter)|Joseph Meyer]], [[Billy Rose]] & Jolson).\n\n;[[Mario Lanza]]\n:Mario Lanza's biographer, Armando Cesari, writes that Lanza's \"favorite singers included Al Jolson, Lena Horne, Tony Martin and Toni Arden.\"<ref>Cesari, Armando. ''Mario Lanza: An American Tragedy'', Baskerville Publishers (2004), p. 80.</ref>\n\n;[[Jerry Lee Lewis]]\n:According to singer and songwriter Jerry Lee Lewis, \"there were only four true American originals: Al Jolson, [[Jimmie Rodgers (country singer)|Jimmie Rodgers]], [[Hank Williams]], and Jerry Lee Lewis.\"<ref>''Rolling Stone Magazine'', Interviews, October 19, 2006.</ref> \"I loved Al Jolson,\" he said. \"I still got all of his records. Even back when I was a kid I listened to him all the time.\"<ref>Giddins, Gary. ''Visions of Jazz: The First Century'', Oxford Univ. Press (1998) p. 17.</ref>\n\n;[[Rod Stewart]]\n:British singer and songwriter Rod Stewart, during an interview in 2003, was asked, \"What is your first musical memory?\" Stewart replied: \"Al Jolson, from when we used to have house parties around Christmas or birthdays. We had a small grand piano and I used to sneak downstairs... I think it gave me a very, very early love of music.\"<ref>''Rolling Stone Magazine'', Interviews, October 30, 2003.</ref>\n\n;[[David Lee Roth]]\n:Songwriter and lead singer of the rock group [[Van Halen]], was asked during an interview in 1985, \"When did you first decide that you wanted to go into show business?\" He replied, \"I was seven. I said I wanted to be Al Jolson. Those were the only records I had—a collection of the old breakable 78s. I learned every song and then the moves, which I saw in the movies.\"<ref>''Rolling Stone Magazine'' Interviews, April 11, 1985.</ref>\n\n;[[Jackie Wilson]]\n:African-American singer Jackie Wilson recorded a tribute album to Jolson, ''You Ain't Heard Nothin' Yet'', which included his personal liner note, \"...the greatest entertainer of this or any other era... I guess I have just about every recording he's ever made, and I rarely missed listening to him on the radio.... During the three years I've been making records, I've had the ambition to do an album of songs, which, to me, represent the great Jolson heritage.. [T]his is simply my humble tribute to the one man I admire most in this business... to keep the heritage of Jolson alive.\"<ref>Giddins, Gary. ''Rhythm-a-ning: Jazz Tradition and Innovation'', Da Capo (2000), pp. 148–49.</ref>\n\n==Filmography==\n* ''Mammy's Boy'' (1923) (unfinished)\n* ''[[A Plantation Act]]'' (1926)\n* ''[[The Jazz Singer (1927 film)|The Jazz Singer]]'' (1927)\n* ''[[The Singing Fool]]'' (1928)\n* ''[[Hollywood Snapshots No. 11]]'' (1929) (short subject)\n* ''[[Sonny Boy (1929 film)|Sonny Boy]]'' (1929) (Cameo)\n* ''[[Say It with Songs]]'' (1929)\n* ''[[New York Nights]]'' (1929) (Cameo)\n* ''[[Mammy (1930 film)|Mammy]]'' (1930)\n* ''[[Show Girl in Hollywood]]'' (1930) (Cameo)\n* ''[[Big Boy (film)|Big Boy]]'' (1930)\n* ''[[Hallelujah, I'm a Bum (film)|Hallelujah, I'm a Bum]]'' (1933)\n* ''[[Wonder Bar]]'' (1934)\n* ''[[Go Into Your Dance]]'' (1935)\n* ''[[Paramount Headliner: Broadway Highlights No. 1]]'' (1935) (short subject)\n* ''[[The Singing Kid]]'' (1936)\n* ''[[Hollywood Handicap]]'' (1938) (short subject)\n* ''[[Rose of Washington Square]]'' (1939)\n* ''[[Hollywood Cavalcade]]'' (1939)\n* ''[[Swanee River (film)|Swanee River]]'' (1939)\n* ''[[Rhapsody in Blue (film)|Rhapsody in Blue]]'' (1945) (brief scene with Jolson in blackface introducing \"Swanee\")\n* ''[[The Jolson Story]]'' (1946) (double and singing voice for [[Larry Parks]] with brief onscreen appearance)\n* ''[[Screen Snapshots: Off the Air]]'' (1947) (short subject)\n* ''[[Jolson Sings Again]]'' (1949) (singing voice for Larry Parks)\n* ''[[Oh, You Beautiful Doll]]'' (1949) (voice only)\n* ''[[Screen Snapshots: Hollywood's Famous Feet]]'' (1950) (short subject) (narrator)\n* ''Memorial to Al Jolson'', (1951) documentary – Columbia Pictures\n* ''The Great Al Jolson'', (1955) documentary, Columbia Pictures\n\n==Theater==\n* ''[[La Belle Paree]]'' (1911)\n* ''[[Vera Violetta]]'' (1911)\n* ''[[The Whirl of Society]]'' (1912)\n* ''[[The Honeymoon Express]]'' (1913)\n* ''[[Children of the Ghetto]]'' (before 1915)\n* ''[[Robinson Crusoe, Jr.]]'' (1916)\n* ''[[Sinbad (musical)|Sinbad]]'' (1918)\n* ''[[Bombo (musical)|Bombo]]'' (1921)\n* ''[[Big Boy (musical)|Big Boy]]'' (1925)\n* ''[[Artists and Models of 1925]]'' (1925) (added to cast in 1926)\n* ''[[Big Boy (musical)|Big Boy]]'' (1926) (revival)\n* ''[[The Wonder Bar]]'' (1931)\n* ''[[Hold On to Your Hats]]'' (1940)\n\n==Famous songs==\n* ''That Haunting Melodie'' (1911) Jolson's first hit.\n* ''Ragging the Baby to Sleep'' (1912)\n* ''[[The Spaniard That Blighted My Life]]'' (1912)\n* ''That Little German Band'' (1913)\n* ''You Made Me Love You'' (1913)\n* ''Back to the Carolina You Love'' (1914)\n* ''Yaaka Hula Hickey Dula'' (1916)\n* ''I Sent My Wife to the Thousand Isles'' (1916)\n* ''I'm All Bound Round With the Mason Dixon Line'' (1918)\n* ''[[Rock-A-Bye Your Baby With A Dixie Melody]]'' (1918)\n* ''[[Tell That to the Marines]]'' (1919)\n* ''I'll Say She Does'' (1919)\n* ''[[I've Got My Captain Working for Me Now]]'' (1919)\n* ''[[Swanee (song)|Swanee]]'' (1919)\n* ''[[Avalon (Al Jolson song)|Avalon]]'' (1920)\n* ''O-H-I-O (O-My! O!)'' (1921)\n* ''[[April Showers (song)|April Showers]]'' (1921)\n* ''Angel Child'' (1922)\n* ''Coo Coo''' (1922)\n* ''Oogie Oogie Wa Wa'' (1922)\n* ''That Wonderful Kid From Madrid'' (1922)\n* ''Toot, Toot, Tootsie'' (1922)\n* ''[[Juanita (1923 song)|Juanita]]'' (1923)\n\n[[File:MyBodyCoverJolson.jpg|thumb|1922 sheet music]]\n* ''[[California, Here I Come]]'' (1924)\n* ''I Wonder What's Become of Sally?'' (1924)\n* ''All Alone'' (1925)\n* ''[[I'm Sitting on Top of the World]]'' (1926)\n* ''[[When the Red, Red Robin (Comes Bob, Bob, Bobbin' Along)]]'' (1926)\n* ''[[My Mammy]]'' (1927)\n* ''[[Back in Your Own Backyard]]'' (1928)\n* ''There's a Rainbow 'Round My Shoulder'' (1928)\n* ''[[Sonny Boy (song)|Sonny Boy]]'' (1928)\n* ''Little Pal'' (1929)\n* ''[[Liza (All the Clouds'll Roll Away)]]'' (1929)\n* ''Let Me Sing and I'm Happy'' (1930)\n* ''The Cantor (A Chazend'l Ofn Shabbos)'' (1932)\n* ''[[You Are Too Beautiful]]'' (1933)\n* ''Ma Blushin' Rosie'' (1946)\n* ''[[Anniversary Song]]'' (1946)\n* ''[[Alexander's Ragtime Band]]'' (1947)\n* ''Carolina in the Morning'' (1947)\n* ''About a Quarter to Nine'' (1947)\n* ''Waiting for the Robert E. Lee'' (1947)\n* ''Golden Gate'' (1947)\n* ''[[When You Were Sweet Sixteen]]'' (1947)\n* ''If I Only Had a Match'' (1947)\n* ''After You've Gone'' (1949)\n* ''Is It True What They Say About Dixie?'' (1949)\n* ''[[Are You Lonesome Tonight? (song)|Are You Lonesome Tonight?]]'' (1950)\n\n==Discography==\n* ''Al Jolson (in songs he made famous)'' 1946 Decca Records, Inc. (Album No. A-469 – box set of four records)\n:# \"April Showers\"\n:# \"Swanee\"\n:# \"California, Here I Come\"\n:# \"Rock-A-Bye Your Baby With A Dixie Melody\"\n:# \"You Made Me Love You (I Didn't Want To Do It)\"\n:# \"Ma Blushin' Rosie\"\n:# \"Sonny Boy\"\n:# \"My Mammy\"\n* ''[[The Very Best Of Al Jolson]]'' (1977) (compilation)\n\n==See also==\n{{Portal bar|Biography}}\n\n==Footnotes==\n{{Reflist|30em}}\n\n==Further reading==\n* Young, Jordan R. (1999). ''The Laugh Crafters: Comedy Writing in Radio & TV's Golden Age.'' Beverly Hills: Past Times Publishing. ISBN 0-940410-37-0.\n\n==External links==\n{{wikisource author}}\n{{Commons category}}\n* {{IMDb name|427231}}\n* {{IBDB name|11954}}\n* [http://www.pbs.org/wnet/broadway/stars/al-jolson PBS \"Stars over Broadway\"]\n* [https://archive.org/details/AlJolson Collected works of Al Jolson at the Internet Archive]\n* [https://archive.org/details/NewsMaga1950_3 Newsreel including Jolson's death and funeral (from the Internet Archive)]\n* [http://jolsonville.com Tribute to Al Jolson]\n* [http://www.jolson.org International Al Jolson Society]\n* [http://www.aj-images.com/aljolsonandthejazzsinger.html Documentary about Al Jolson and the making of The Jazz Singer]\n* [http://www.museumoffamilyhistory.com/ajolson.htm The Immortal Al Jolson at the Family History Museum]\n* [http://www.virtual-history.com/movie/person/746/al-jolson Al Jolson] at Virtual History\n\n{{Authority control|VIAF=97935898}}\n\n{{Persondata\n| NAME              = Jolson, Al\n| ALTERNATIVE NAMES = Yoelson, Asa\n| SHORT DESCRIPTION = American entertainer\n| DATE OF BIRTH     = May 26, 1886\n| PLACE OF BIRTH    = [[Seredžius]], [[Grodno Governorate]], [[Russian Empire]]\n| DATE OF DEATH     = October 23, 1950\n| PLACE OF DEATH    = [[San Francisco, California]], U.S.\n}}\n{{DEFAULTSORT:Jolson, Al}}\n[[Category:1886 births]]\n[[Category:1950 deaths]]\n[[Category:People from Jurbarkas District Municipality]]\n[[Category:People from Kovno Governorate]]\n[[Category:Lithuanian Jews]]\n[[Category:Imperial Russian emigrants to the United States]]\n[[Category:American people of Lithuanian-Jewish descent]]\n[[Category:20th-century American male actors]]\n[[Category:American jazz singers]]\n[[Category:American male film actors]]\n[[Category:American male singers]]\n[[Category:American Theater Hall of Fame inductees]]\n[[Category:Blackface minstrel performers]]\n[[Category:California Republicans]]\n[[Category:Decca Records artists]]\n[[Category:Jewish American male actors]]\n[[Category:Jewish American musicians]]\n[[Category:Jewish comedians]]\n[[Category:Jewish singers]]\n[[Category:Male actors from Washington, D.C.]]\n[[Category:Musicians from Washington, D.C.]]\n[[Category:Vaudeville performers]]\n[[Category:Warner Bros. contract players]]\n[[Category:Deaths from myocardial infarction]]"}]}}}