{"pages": {"33694869": {"pageid": 33694869, "ns": 3, "title": "User talk:Meters", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "diff": {"from": 1010348888, "to": 1010628973, "*": "<tr>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 588:</td>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 588:</td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>&lt;div lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"&gt;&lt;div style=\"-moz-column-count:2; -webkit-column-count:2; column-count:2;\"&gt; {{Wikipedia:Wikipedia Signpost/2021-02-28}} &lt;/div&gt;&lt;!--Volume 17, Issue 2--&gt; &lt;div class=\"hlist\" style=\"margin-top:10px; font-size:90%; padding-left:5px; font-family:Georgia, Palatino, Palatino Linotype, Times, Times New Roman, serif;\"&gt; * '''[[Wikipedia:Wikipedia Signpost|Read this Signpost in full]]''' * [[Wikipedia:Wikipedia Signpost/Single/2021-02-28|Single-page]] * [[Wikipedia:Wikipedia Signpost/Subscribe|Unsubscribe]] * [[User:MediaWiki message delivery|MediaWiki message delivery]] ([[User talk:MediaWiki message delivery|talk]]) 21:29, 28 February 2021 (UTC) &lt;!-- Sent via script ([[User:Evad37/SPS]]) --&gt;&lt;/div&gt;&lt;/div&gt;</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>&lt;div lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"&gt;&lt;div style=\"-moz-column-count:2; -webkit-column-count:2; column-count:2;\"&gt; {{Wikipedia:Wikipedia Signpost/2021-02-28}} &lt;/div&gt;&lt;!--Volume 17, Issue 2--&gt; &lt;div class=\"hlist\" style=\"margin-top:10px; font-size:90%; padding-left:5px; font-family:Georgia, Palatino, Palatino Linotype, Times, Times New Roman, serif;\"&gt; * '''[[Wikipedia:Wikipedia Signpost|Read this Signpost in full]]''' * [[Wikipedia:Wikipedia Signpost/Single/2021-02-28|Single-page]] * [[Wikipedia:Wikipedia Signpost/Subscribe|Unsubscribe]] * [[User:MediaWiki message delivery|MediaWiki message delivery]] ([[User talk:MediaWiki message delivery|talk]]) 21:29, 28 February 2021 (UTC) &lt;!-- Sent via script ([[User:Evad37/SPS]]) --&gt;&lt;/div&gt;&lt;/div&gt;</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>&lt;!-- Message sent by User:Eddie891@enwiki using the list at https://en.wikipedia.org/w/index.php?title=Wikipedia:Wikipedia_Signpost/Subscribe&amp;oldid=1009065746 --&gt;</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>&lt;!-- Message sent by User:Eddie891@enwiki using the list at https://en.wikipedia.org/w/index.php?title=Wikipedia:Wikipedia_Signpost/Subscribe&amp;oldid=1009065746 --&gt;</div></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>== Thank you ==</div></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>Good morning, I would like to first say thank you for your messages. I would also like to let you know that there is no malicious intent or vandalism in the things I have done these past few days. I am an 8th grade English teacher and my students are starting their research essay unit. One of the key components is finding reliable websites. Every year I make minor changes to a known wiki page (that I immediately change back after the lessons) to show my students that, at times, Wikipedia can be unreliable. Your messages have added to my lesson so I say thank you and have a good day. 😁 [[User:ThoseGuys1980|ThoseGuys1980]] ([[User talk:ThoseGuys1980|talk]]) 13:28, 6 March 2021 (UTC)</div></td>\n</tr>\n"}, "*": "<!-- Don't start a page here. Go to the bottom.  -->\n\n'''If this page has been protected and you cannot edit it''' you may leave messages [[User_talk:Meters/unprotected| here]]. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 22:23, 28 March 2016 (UTC)\n\n{{user talk}}\n{{Archives |auto=yes |search=yes}}\n\n__TOC__\n\n== Kadasa12 ==\n\nI have reported them to ANI for a quick block. Not notifying them per [[WP:RBI]]. Thanks for cleaning up. - [[User:Sitush|Sitush]] ([[User talk:Sitush|talk]]) 07:00, 10 July 2020 (UTC)\n:I dumped a report at AIV before I saw the full extent. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 07:03, 10 July 2020 (UTC)\n\n== [[W!LD RICE]] ==\n\nHi! Just for your information, infopedia is more like an encyclopedia written by staff writers from the Singapore's [[National Library Board]], hence not user generated. It is usually used as a major source of information for Singapore related articles. Thank you for your vigilance! --[[User:Justanothersgwikieditor|Justanothersgwikieditor]] ([[User talk:Justanothersgwikieditor|talk]]) 02:05, 21 July 2020 (UTC)\n:Yes, I realized that and restored the content. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 02:05, 21 July 2020 (UTC)\n\n==Thank you!==\nHey, I saw your response to my PVHS page edit. I appreciate your feed back and will take it into account in the future, I still have a lot to learn with Wikipedia. My goals are to just add more data to my local community places. Thanks again!  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Str8nger dangr|Str8nger dangr]] ([[User talk:Str8nger dangr#top|talk]] • [[Special:Contributions/Str8nger dangr|contribs]]) 03:14, 23 July 2020 (UTC)</small> <!--Autosigned by SineBot--> \n\n<small>moved from [[user talk:Meters/unprotected]] July 31 </small>\n\n== [[St Clement Danes School]] ==\n\nHi Meters, I noticed your removal of the uncited claim on this page, after the IP address edit that removed the maintenance template I'd added. I've subsequently found that a search for the name here: https://www.britishnewspaperarchive.co.uk/search/results/1950-01-01/1999-12-31?basicsearch=nicholas%20st%20clair&somesearch=nicholas%20st%20clair&retrievecountrycounts=false yielded a couple of results which seem to back up the claim, but I don't have access to the full sources. I was wondering if you had any advice on whether these sources would be suitable for reinstating the removed claim, and if so how best to cite? Many thanks in advance [[User:WikiJN10|WikiJN10]] ([[User talk:WikiJN10|talk]]) 21:18, 27 July 2020 (UTC)\n:{{Replyto|WikiJN10}} Nice. Two solid refs. No idea why the IP decided it should be listed as having happened in 1975 rather then 1973. We prefer sources that are not behind paywalls, but sources do not have to be free, online, or easily accessible. As long as it can be verified in a published source we are good. See [[WP:PAYSITE]]. If you open a trial account and verify one of the articles' content (the  Birmingham Daily Post is probably the better choice as it mentions the inquest) you are free to cite the newspaper article just like any other news article. You may be able to find someone with access at [[Wikipedia:WikiProject Resource Exchange/Resource Request]].  [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:41, 27 July 2020 (UTC)\n::Thank you for the advice. I ended up using the free trial account and accessed both articles myself, but thank you for pointing out the Resource Exchange/Request page, I wasn't aware of that, but could definitely be useful in future. [[User:WikiJN10|WikiJN10]] ([[User talk:WikiJN10|talk]]) 22:37, 28 July 2020 (UTC)\n\n== Reverts ==\n\nHi Meters.\n\nWhy remove my edits on Education in England? As you can see by my edit information I trimmed down the article. I live in England and know my schooling system. Can you tell me what's wrong with my edit?  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Lincolnreviewer|Lincolnreviewer]] ([[User talk:Lincolnreviewer#top|talk]] • [[Special:Contributions/Lincolnreviewer|contribs]]) 04:03, 1 August 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:See your talk page and discuss the content on the article's talk page.  I don't want to discuss it here too. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:07, 1 August 2020 (UTC)\n::user was CU blocked as sock of [[user:Lam312321321 ]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:10, 1 August 2020 (UTC)\n\n== International Baccalaureate ==\n\nYou reverted the edits. The article is a mess, and does not conform at all or in any way to Wikipedia tradition or style. It's one big advertisement, a pamphlet with quotations taken directly from IB material. I don't think you want that. It's biggest fault is that it uses the jargon of IB, so no normal person can understand the real sense of anything it says. IN addition, it doesn't say anything about the company's income, surplus, business structure - those are things people care about. I added that. I added material with citations, and removed material that was either an ad for the IB or a uncited. There is more work to do on this article.  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Sterlinggranger|Sterlinggranger]] ([[User talk:Sterlinggranger#top|talk]] • [[Special:Contributions/Sterlinggranger|contribs]]) 18:04, 1 August 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:I rewrote parts of one section that was full of unsourced or improperly sourced claims and POV material. The other sections have nothing to do with me. If you are going to drop the  identical message on more than one person's talk page it would behoove you to first actually check that you have the correct editors. And the improperly sourced POV material in that section has now been removed four times, by three different editors. You might want read [[WP:EW]] . [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:24, 1 August 2020 (UTC)\n\nHello Meters.\nA pleasure to meet you. You are doing a great job.\nI have not posted anything that is unsourced. I was meticulous, which comes from being in newspapers for 40 years.\n\nThe 23,000 was sourced. Now the 17,000 you've added is old and inaccurate. And the source is secondhand. Why not just use the petition itself, the most reliable source and the original source? \n23,000 has been sourced since day 1. It's also been in the FT, Guardian, Wired, etc, etc. It's not a secret.\nI'm sorry - I don't understand why this becomes an argument, with threats. The goal is an accurate, readable article, If it's about something else let's discuss it.\nThe article is now not well written, lacks clarity, has some grammatical weaknesses and reads like an ad for the IB. Most of all, it's not useful and it's not fair to readers seeking to learn about the IB. It's a waste of time for readers, which is the biggest sin. It's not a wikipedia article - it's a press release. And now the section on grades is not accurate.\n\nAlso, why are you even editing it? I mean why does this section \"have to do with you\", and not the others? I wrote the original article, not you. You could better spend your energy cleaning up the PR hogwash the makes up 90% of the page, instead of editing the only readable thing on the page. There was no reason to touch it - it was all sourced.<!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Sterlinggranger|Sterlinggranger]] ([[User talk:Sterlinggranger#top|talk]] • [[Special:Contributions/Sterlinggranger|contribs]]) 22:25, 1 August 2020 (UTC)</small> <!--Autosigned by SineBot-->\n\n:Yes, you certainly did add an inaccurate unsourced statement. You said that the petition had received more than  '''23,000''' signatures '''by July 7'''. That was unsourced, and it is not correct. The original source said 1,500 signatures by that date, and the newer, more reliable source I added said 17,000 signatures by July 13. If you want a more recent value then add a newer source. to that claim.\n:As for why I am editing it, it does not matter. The IB grade issue has absolutely nothing to do with me. In fact, if it does have something to do with you you might want to read [[WP:COI]]. And who wrote the material is irrelevant (II am assuming that you meant that section rather than the entire article). Please read [[WP:OWN]]. You do not own the content. Anyone is allowed to edit it.  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Meters|Meters]] ([[User talk:Meters#top|talk]] • [[Special:Contributions/Meters|contribs]]) 02:03, August 2, 2020 (UTC)</small>\n\n== Leap Year ==\n\nIt’s very difficult to reach you; I began on Wikipedia 16 years ago, but have not edited in several years. You left a msg concerning some changes regarding a Leap Year page coming from the IP of a member of my household. This person is Autistic. I have left messages before (much easier), about this situation as it’s very emotional. You do not need to assume that someone is going to “argue” with you, and press-on about having “final say.”\nMy autistic household member will use anyone’s device or whatever as he/she is very upset about July 4, 2000\n(grandfather’s birthday) having to fall in a certain week-day. \nIt’s an emotional topic: He/She knew the mathematics of the calendrical (sp?) by age 10. \nDon’t assume that others have ill intent. Don’t make it so difficult to contact you, along with such complicated rules. I chastise you for being supercilious and impolite. If you harass my neurodivergent family member, I will move this issue up the channel and cite the ADA.\nALL that you need to do is to be KIND in your notifications regarding edits. \n[[User:Dyslexix|Dyslexix]] ([[User talk:Dyslexix|talk]]) 23:15, 30 July 2020 (UTC)dyslexix\n:{{replyto||Dyslexix}}\n#It's not difficult to reach me, let alone very difficult. All you had to do was post to my talk page. It's '''not''' currently protected. That's why it says \"'''If this page has been protected and you cannot edit it''' you may leave messages\" on this page. And why this page starts off with \"'''Do not post here unless you have first unsuccessfully attempted to post to my main talk page.'''\" and continues with \"Really. If my main talk page is unprotected I probably will not see or reply to any posts here.\" and then \"This page is for the use of unconfirmed users in the event that my regular talk page has been temporarily protected and they are unable to post to it.\" I really don't know how I can make it any more obvious. For that matter, even if my talk page were protected, as an established editor you would still have been able to post to it. Or you could have pinged me to a different talk page, or even emailed me. There is absolutely nothing I can do to make it any easier for other editors to contact me.\n#I didn't assume ill intent and I wasn't unkind. I simply undid the edit with a summary explaining why. I left a canned, polite level 1 disruptive (not vandalism) editing message after the IP made the same edit a second time, pointing them to [[WP:BRD]]. If you don't like the term \"argue the point\" then please read it as \"discuss the point\". And I said nothing about having a final say. Calling me \"supercilious and impolite\" and accusing me of harassing the IP is a personal attack by you. See [[WP:NPA]].\n#I, and any other editors who have been involved in this (I see from you edit history that this has been going on since at least 2017), have no way of knowing that an anonymous dynamic IP is being used by someone with autism. We don't assume anything about IPs other than that the editors using them are acting in good faith and that they are competent to edit Wikipedia, which is exactly what I did.\n#What is \"ADA\"? I'm going to assume that you mean Americans with Disabilities Act. Good luck with trying to \"move this issue up the channel\". You might want to read [[WP:NOTTHERAPY]] and [[WP:CIR]]. [[User:Meters|Meters]] ([[User talk:Meters|talk]]) 01:20, 31 July 2020 (UTC)\n\nThe user was acting in good faith. I have addressEd to other wiki editors about the autistic issue in the past. I am giving you advice as to your behavior. Thank-you for wishing me good luck, as Wikipedia is a Charitable Org., it might be best that you not speak for the entire entity. \n[[User:Dyslexix|Dyslexix]] ([[User talk:Dyslexix|talk]]) 03:47, 31 July 2020 (UTC)dyslexix\n:You seem to be having trouble understanding me. Again, I did not say the IP was acting in bad faith. In fact, I explicitly  stated that I had assumed the IP was acting in good faith, and was competent to edit Wikipedia. If your family member does not understand what is going on, or is not capable of discussing this, they may not be competent to edit Wikipedia.. That's why I pointed you to the above links. And the \"Good luck\" was irony because I think you will have zero success in trying to \"move this issue up the channel\". I think it would be a bad idea, but if you insist on doing so, the correct venue to do so would be at [[WP:ANI]], where a report will result in other users looking at my behaviour, as well as yours, and likely the IP's too. [[User:Meters|Meters]] ([[User talk:Meters|talk]]) 04:34, 31 July 2020 (UTC)\n:And please indent your talk page posts with one colon per indent level. This line is indented with one colon,\n::and this one with two. [[User:Meters|Meters]] ([[User talk:Meters|talk]]) 04:35, 31 July 2020 (UTC)\n\n<small> Moved from unprotected talk page on Aug 4 </small>\n\n== FYI ==\n\nI [https://en.wikipedia.org/w/index.php?target=2001%3A48F8%3A3006%3A734%3A985A%3A8BC9%3A840D%3AA613%2F64&namespace=all&tagfilter=&start=&end=&limit=50&title=Special%3AContributions blocked the range]. This has been going on for weeks...-- [[User:Ponyo|<span style=\"color: Navy;\">Jezebel's '''Ponyo'''</span>]]<sup>[[User talk:Ponyo|<span style=\"color: Navy;\">''bons mots''</span>]]</sup> 23:20, 17 August 2020 (UTC)\n\n==[[Talk:Assassination of John F. Kennedy]]==\nHi Meters\n\nRegarding your comments from my recent enquiry re Oswald and the assassination of Kennedy.\n\n\"I mean the reliable sources do not entertain any uncertainty here. Per the sources, Oswald shot Kennedy.\"\n\nReliable sources to not suffice for saying that Oswald assassinated Kennedy as they are unproven facts.\n\nOswald did not stand trial in a criminal court of law for said offence, therefore as the accused he is innocent.\n\nOswald was the \"alleged\" assassin.\n\n\"The presumption of innocence is the legal principle that one is considered \"innocent until proven guilty\".\"\n\nSee: https://en.wikipedia.org/wiki/Presumption_of_innocence\n\n[[User:Arkons1947|Arkons1947]] ([[User talk:Arkons1947|talk]]) 14:12, 19 August 2020 (UTC)\n:I'm not going to argue this. See if you can get consensus for  your proposed change. I doubt very much that you will get it, but certainly simply requesting such a contentious change without discussing it first is inappropriate. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 17:48, 19 August 2020 (UTC)\n\n== Family Radio ==\n\nOakland, California is where their broadcast operations center is and where they receive listener mail, their headquarters is in Nashville which officially opened in January 2020. But you should know that the two IP addresses that have been changing the information should be dealt with because they are being aggressive and making threats. [[User:YborCityJohn|YborCityJohn]] ([[User talk:YborCityJohn|talk]]) 23:09, 29 August 2020 (UTC)\n:As I said on your talk page and the article's talk page, please provide a reliable source that the move actually happened, rather than just being planned.. The company's own web page still lists Oakland. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 23:12, 29 August 2020 (UTC)\n\n== Vibes and Ron Howard ==\nHey! You messaged me saying that my reference for [[Ron Howard]] producing [[Vibes]] was wrong (https://www.imdb.com/title/tt0096378/fullcredits), that it doesn't mention him. Please check again, it very clearly mentions Ron Howard as an executive producer. His name is the fourth in the list in the section \"Produced By\". If you could please verify that I am telling the truth, and re-instate my edit, that would be greatly appreciated.\n\nNever mind, I went ahead and re-edited it, but now with four references supporting the fact that Ron Howard of Imagine Entertainment was executive producer of Vibes. I hope four is enough? If not, his name is literally on the poster for the movie, which is the one image in the article. Surely the poster qualifies as a credible source, right?\n\nAnyway, although in this case you were maybe a little to quick to assume that an edit was bad, I appreciate your efforts to make wikipedia rigorous. Thank you!\n:Already answered on your page. We don't list executive producers in the \"Producers\" field. And why would we add just one of the additional names even if we did? [[User:Meters|Meters]] ([[User talk:Meters|talk]]) 00:00, 14 August 2020 (UTC)\n\nOk, I see, I did not know this about the info box. But surely it's worth including the fact that Ron Howard (executive) produced the film later in the article, right?\n:Please indent and sign your talk page posts.\n:Again, why would we mention just him and not any of the others? [[User:Meters|Meters]] ([[User talk:Meters|talk]]) 00:07, 14 August 2020 (UTC)\n\n:: Sorry, like most people, I'm not an expert at editing Wikipedia. I hope you can cut me some slack. I'm not trying to make \"disruptive edits\", I'm just trying to include legit, sourced information that is pertinent to an article. Surely putting someone's name in the wrong spot shouldn't warrant a the threat of a ban, should it? Anyway, as to your question (why mention *just* Ron Howard and not any of the others?), my answer is: the other producers can be included, I'm not in anyway trying to prevent their names from being mentioned, though he is the only \"executive\" producer, so he is clearly distinct from the others, in some way; however, out of all the producers, he is extremely noteworthy (I assume you know who Ron Howard is), so I figure if any of the executive/co-/associate producers are to be mentioned in an article for a movie they made, at the very least Ron Howard's name should be one of them. Because he's really really famous. If the only way to let the world know the truth about Ron Howard's association with Vibes is to also include the other people's names, then I will happily add them in. I just figured somebody would take care of that if they felt it was necessary (please excuse me for being a little lazy). Thank you! [[Special:Contributions/98.240.205.119|98.240.205.119]] ([[User talk:98.240.205.119|talk]]) 00:23, 14 August 2020 (UTC)\n\n:::You added him incorrectly to the infobox, you restored it, and now you have added him prominently to the article body. And you previously made a rather disruptive  restore of a six-year-old deletion from  another article that I undid.\n:::I've asked about mentioning executive producers a the Film Project [[https://en.wikipedia.org/wiki/Wikipedia_talk:Manual_of_Style/Film#executive_producers]] [[User:Meters|Meters]] ([[User talk:Meters|talk]]) 00:30, 14 August 2020 (UTC)\n\n:::: Thanks. Insisting on labelling my edits disruptive is a little hurtful, though. \"Disruptive\" is what my grade school teachers would call me when I was bored with their lackluster lessons that I had already learned (of course, you wouldn't know this, so I forgive you).  I just made some mistakes; I'm not as experienced at this as you are. You've made mistakes, too, right? A little empathy is all I'm asking for here. [[Special:Contributions/98.240.205.119|98.240.205.119]] ([[User talk:98.240.205.119|talk]]) 00:59, 14 August 2020 (UTC)\n\n<small> thread moved from unprotected talk page on Aug 29 </small>\n\n\"Because he's really really famous. If the only way to let the world know the truth about Ron Howard's association with Vibes is to also include the other people's names, then I will happily add them in\" pretty much sums up this IP's interest. Project talk page only reply: \"They shouldn't be added unless it's particularly notable for some reason. They can be mentioned for actions or things they said, as part of the production section for example. But mentioning it for the sake of doing it doesn't seem right.\" [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 23:23, 29 August 2020 (UTC)\n\n==Discussion at [[:Talk:Time series database#RfC on inclusion criteria|Talk:Time series database §&nbsp;RfC on inclusion criteria]]==\n[[File:Farm-Fresh eye.png|15px|link=|alt=]]&nbsp;You are invited to join the discussion at [[:Talk:Time series database#RfC on inclusion criteria|Talk:Time series database §&nbsp;RfC on inclusion criteria]]. &#x0020;I've started a formal RfC to try to resolve the dispute on what time series databases should be included in the article on them. As someone who's participated in this dispute in the past I'm notifying you as a courtesy. [[User:Chess|Chess]] [[User talk:Chess|(talk)]] <small>(please use&#32;{{tlx|ping|Chess}} on reply)</small><!--Template:Please ping--> 04:01, 1 September 2020 (UTC){{Z48}}<!-- [[Template:Please see]] -->\n\n== Micronations ==\n\nHi Meters, I mentioned an edit of yours at [[Talk:List of micronations#Removing micronations that have no article]]. ◅&nbsp;[[User:SebastianHelm|Sebastian]] 06:05, 7 September 2020 (UTC)\n\n\n== thanks for the edit ==\nHi friends thanks for the edit man im quite new at this and really appreciate your incite(no im not being passive aggressive i really thank you)\ncheers\nParker\nP.S If you have any other suggestions feel free to put it on my talk page  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Pmegrue|Pmegrue]] ([[User talk:Pmegrue#top|talk]] • [[Special:Contributions/Pmegrue|contribs]]) 04:46, 8 September 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:No probs. That's a very common issue with school articles and new editors. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:49, 8 September 2020 (UTC)\n\n==Sandy Hudson==\nHi there. I am new to wikipedia and the subject of the page [[Sandy Hudson]]. You recently reverted a deletion. I sent a request for repression and I was told by Kevin Li that the page violates the biographies of living persons rule, but it did not rise to a level requiring suppression and to monitor it. \n\nThe edit violates your rules about neutrality, verifiability, primary sources, circular reporting, victimization, gossip, and people who are relatively unknown.\n\nThe information contained there is both incorrect and part of a campaign by individuals who have been stalking and harassing me for years with racist motivations. The nuisance suit was filed in an attempt to stop me from my anti-racism activism work. The allegations were not proven in court, and the University of Toronto Students' Union eventually put out a statement saying that they regretted the proceedings and inflammatory public comments made. It does not rise to the level of \"scandal\".\n\nI am not permitted to discuss specifics of the suit as a condition of a negotiated settlement. Regardless, I can say the following about the information contained in that section of the page about me:\n\n(1) it references \"embezzlement,\" which never came up in the case and is factually incorrect\n(2) it states that it was alleged that I destroyed relevant information including the total number of hours I worked during my employment. This is untrue and not provided for in the source. All documentation regarding my hours worked were provided in discovery, and I still have copies of them.\n(3) it cites a secondary source that is tabloid in nature (a student paper; which I understand is typically trustworthy, but this particular paper at this particular time in the students' union history had personal relationships with the people it would write negative stories about). The original writer of the student source did not disclose that she was in a romantic relationship with one of the students who filed the suit.\n(4) The tabloid source incorrectly references only one primary source (the complaint-side pleading documents; it does not at all use the response-side pleading documents)\n(5) the other sources referenced amount to circular reporting (they all reference the one initial student paper source).\n(6) The section states that  I \"corrected [my]self and noted that the case was not racially motivated and UTSU had reasonable basis to sue [me].\" This is false. The UTSU put out a statement saying that, but I do not engender such feelings. The source is the student press, and they never spoke to me about this case at all. This is an example of a tabloid source (the student press) using a self-published source (the UTSU's statement) as fact.\n\nI am relatively unknown by Wikipedia's standards and it seems strange that there is a section of this page titled \"Scandal\" for an issue that is no more a part of my life or what I am known for than the several other harassment legal documents filed against me as a result of my anti-racist activism.\n\nThis one-sided and incorrect information appears as the largest section on the page, and not, for example, that I was the first Black woman to serve as the President of Canada's oldest students' union, that I was the first Black person to serve as Chair of the Canadian Federation of Students - Ontario, that I was intimately involved with the removal of police from the largest school board in North America, and other such items, seems like the work of someone trying to defame me. I am not arguing that those things should be added, but this section being the largest thing written\nabout me on wikipedia appears to be the work of a long, ongoing libel/defamation campaign.  <!-- Template:Unsigned IP --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[Special:Contributions/2605:E000:151D:87F:C854:6313:8D22:BC54|2605:E000:151D:87F:C854:6313:8D22:BC54]] ([[User talk:2605:E000:151D:87F:C854:6313:8D22:BC54#top|talk]]) 09:27, 9 September 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:Why is this on my page? You didn't deal with the issues in the section, instead you completely blanked  the entire section, including very reliable sources such as the National Post, CTV and Global. You were undone by two different editors, both of whom asked you to discuss the issue on the article's talk page. I started the discussion on the article's talk page to discuss the supposed BLP issues, but you chose instead to raise the issue directly on the BLP board. That's fine, and the issues have been dealt with. Much of the content you removed  is '''still''' in the article, so your complete blanking was not correct. This is one of the reasons that editors with a [[WP:COI]] should not normally edit article about themselves. And please read [[WP:NLT]]. It's not a good idea to throw terms such as libel and defamation around on Wikipedia. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:11, 9 September 2020 (UTC)\n\n== Changes to South High Denver page ==\n\nHi,\nYou emailed the following: \"Hello, I'm Meters. I noticed that you added or changed content in an article, South High School (Denver), but you didn't provide a reliable source.... \n\nFirst, I will review the guidelines on providing sources.  My reliable source was the Vice President of the South High Alumni association (SHAFI).  He dictated the changes to me as I typed them.  I don't know if he wants his name in the source comment.  I will check.\n\nAlso, about your other comment asking me to not change the template.  I'm sorry.  I didn't know I was doing that. \n\nJackie [[User:Jdoffice1|Jdoffice1]] ([[User talk:Jdoffice1|talk]]) 23:08, 11 September 2020 (UTC)\n:What someone told you is not a reliable source that can be verified by other editors. And since you appear to have a conflict of interest please read [[WP:COI]]. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 23:15, 11 September 2020 (UTC)\n\n== Kamloops ==\n\nI've a   hunch that the anomalous 47.4C humidex reading will turn out to be obviously false once we look at the temperature recorded that day.  But I'll look into it.  I won't revert without a good examplanation.  Thanks, [[user:Soap|—]]<span style=\"background-color: #a6ffe0; padding: 3px; border-radius: 6px 6px 6px 6px;\"><b>[[user talk:Soap|Soap]]</b></span>[[Special:Contributions/Soap|—]] 01:55, 16 September 2020 (UTC)\n:I have no idea if it is real either. I tried but could not verify it. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:56, 16 September 2020 (UTC)\n::Okay, that was ''much'' easier than I thought.  [https://climate.weather.gc.ca/climate_data/hourly_data_e.html?hlyRange=1953-01-01%7C2013-06-13&dlyRange=1951-01-01%7C2013-06-12&mlyRange=1951-01-01%7C2013-06-01&StationID=1275&Prov=BC&urlExtension=_e.html&searchType=stnName&optLimit=yearRange&StartYear=1957&EndYear=1957&selRowPerPage=25&Line=1&searchMethod=contains&Month=7&Day=21&txtStationName=kamloops&timeframe=1&Year=1957 here it is].   The dew point they recorded was '''28.3°C'''.  I refuse to    believe that is accurate. Bad measurements happen.  I can show you more.  I would consider this to be a clear example of corrupt data.  But I'm interested to hear your thoughts.  Regards, [[user:Soap|—]]<span style=\"background-color: #a6ffe0; padding: 3px; border-radius: 6px 6px 6px 6px;\"><b>[[user talk:Soap|Soap]]</b></span>[[Special:Contributions/Soap|—]] 01:59, 16 September 2020 (UTC)\n:::I'm not a weather guy (as evidenced by the fact that I did not know where to look for that data you found so quickly), but that does look odd even to me. 85% relative humidity at over 31 degrees in Kamloops?  How would we go about verifying this? I have seen errors in online Environment Canada data before. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 02:08, 16 September 2020 (UTC)\n::::The data is retrievable from the link at the bottom of the weatherbox, though I had trouble with it the first time too and had to have someone show me.  I can walk you through it tomorrow if you want but the data will be the same no matter how you get there.  As for verifying is, this is as deep as we can go .... there is no reference for this reference, so to say.  We simply have to deal with the fact that even our final authorities are sometimes wrong.  A similar humidex error appeared on the [[Eureka, Nunavut]] data, but in that case it was far more obvious, so we decided to simply [[Eureka,_Nunavut#Climate|record a blank value]] there.  Compare the [https://en.wikipedia.org/w/index.php?title=Eureka,_Nunavut&oldid=923864987#Climate old version].    Im going to sleep now, but I plan to get back on this tomorrow. To be honest, though, this is very frustrating for me and I threw a tantrum just a month or so ago over this very topic, so if it stirs up an edit war I will just excuse myself and leave the 47.4  value there.  [[user:Soap|—]]<span style=\"background-color: #a6ffe0; padding: 3px; border-radius: 6px 6px 6px 6px;\"><b>[[user talk:Soap|Soap]]</b></span>[[Special:Contributions/Soap|—]] 02:25, 16 September 2020 (UTC)\n:::::{{u|Soap}} My apologies. I misread the diff. I thought that [[user:CambridgeBayWeather]] removed the value in May as unsourced and you restored it. I had it completely backwards. I've restored your removal and pointed to the talk page discussion. I hate data that is verified, but likely/possibly wrong. I'll leave it to the two of you and any other interested knowledgeable weather people to decide what to do. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 02:50, 16 September 2020 (UTC)\n\n== Immigration to Canada ==\n\nTypically people are not required leave a talk page message for every edit they make. But if someone has an opposition, they can start it on the talk page. It's not considered [[WP:BALANCE]] and [[WP:NPOV]] to post links to pages that necessarily favor immigration. Wikipedia's job is not to encourage either one but to give an insight into different arguments on the issue. That being mentioned, see also requires that the topic be related and not a continuity. So even fit here was no mention to Canada, opposition to immigration still stands as a fairly related topic. I've explained it to you int he edit summary and explained it again. No further explanation should be required, unless you have some other concern.--[[User:Buzles|Buzles]] ([[User talk:Buzles|talk]]) 01:04, 18 September 2020 (UTC)\n::Also please be wary of [[WP:EDITWAR]] as a means to contest others edits. Please use to talk page to bring up your concerns. I've already explained to you the edit is according to guidelines and policies.--[[User:Buzles|Buzles]] ([[User talk:Buzles|talk]]) 01:06, 18 September 2020 (UTC)\n:::Your edit was challenged. Discussions of contested material do no happen in edit summaries. Its up to you to get consensus on the article's talk page to keep the edit. I've explained that to you, pointed you to [[WP:BRD]], and   reminded you to read [[WP:EW]]. Agin, take it to the talk page or leave it alone. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:09, 18 September 2020 (UTC)\n\n== Brando Crawford ==\nHi, apologies for the mistakes. How is the page looking? Previously, there was no proof the director was notable. But now his primary work has a wikipedia page. There are significant sources from BBC World News, Chicago Tribune, and Variety. Is it ready to publish? ([[User:Lilywilliams1212|Lilywilliams1212]] ([[User talk:Lilywilliams1212|talk]]) 03:55, 18 September 2020 (UTC))\n:[[Draft:Brando Crawford]] does not even come close to demonstrating his notability, in my opinion. For one thing, there are almost no sources about '''him'''. Sources about something he is involved with have very little to do with '''his''' notability. Notability is not inherited. Your only sources about him appear to be IMDB (not a reliable source) and a google search on his name (completely useless as  a source). Some of the sources about  [[Acting for a Cause]] do contain information about him that can be used in the article, but to show his notability you really need in depth coverage of him, not mentions in passing. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:08, 18 September 2020 (UTC)\n\n::[[Draft:Brando Crawford]] I see... He is the creator of the Acting for a Cause series. The Chicago Tribune article is almost completely split between him and the series, as is the BBC World News interview. <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Lilywilliams1212|Lilywilliams1212]] ([[User talk:Lilywilliams1212#top|talk]] • [[Special:Contributions/Lilywilliams1212|contribs]]) 04:15, September 18, 2020 (UTC)</small>\n:::Please sign and indent your posts.\n:::I know. I looked a the article and the refs. I'm not spending any more time on this. He does not appear to be notable. You submitted your draft a third time and it was immediately declined. Unless there are significant sources about '''him''' that you can add to the article I think you are wasting your time. [[Acting for a Cause]] may be notable, but that '''does not make him notable'''.  [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:21, 18 September 2020 (UTC)\n\n== Palindrome ==\n\nHi, Meters. You've removed my input on Indian poet Magha in 'Notable palindromists' section of article on Palindrome.\nActually, Magha is praised for one of the most elaborate palindromes in human history. 27th stanza of his \"Shisupala Vadha\" is 'perfect from all directions' 64 syllables magic square palindrome:\nhttps://en.wikipedia.org/wiki/Shishupala_Vadha (section 'Linguistic ingenuity' and reference 20).\nSo, I think, if Su Hui is mentioned it would be fair to include Magha also, as his work dates back to 7 century A.D. and is an important milestone in the history of palindrome making.\nRegards,\nYurrray <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Yurrray|Yurrray]] ([[User talk:Yurrray#top|talk]] • [[Special:Contributions/Yurrray|contribs]]) 12:38, September 22, 2020 (UTC)</small>\n:As I said in my edit summary \"no mention of palindromes in article\". You added an unsourced entry whose article does not mention palindromes. If he's such a notable palindromist why does his article not discuss it? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:55, 22 September 2020 (UTC)\n\n<small> copyrighted image removed </small>\n\nMartin Gardner in his book \"The Colossal Book of Mathematics\" (W.W. Norton & Company, 2001) quotes letter of George L. Hart III in \"Scientific American\" (November, 1970), where he refers to Magha's ''sarvotobhadra'' from Sisupalavadha as 'the most exquisite and complex type of palindrome ever invented' (page 30).\nhttps://archive.org/details/B-001-001-265/page/n45/mode/2up\nBut you are right, Wiki article on Magha does not present his contribution in the field of word play and palindrome making. I can edit this article based on the aforementioned information, if that will solve the dispute.  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Yurrray|Yurrray]] ([[User talk:Yurrray#top|talk]] • [[Special:Contributions/Yurrray|contribs]]) 09:05, 24 September 2020 (UTC)</small> <!--Autosigned by SineBot-->\n\n:{{replyto|Yurrray}}\n#Please sign and indent your talkpage posts.\n#Don't upload copyrighted images. https://commons.wikimedia.org/wiki/File:Magha.jpg is clearly not your own work. This is a scan of a page from Martin Gardiner's 2001 book \"The Colossal Book of Mathematics\".  It is \"Copyright by Martin Gardiner 2001 All rights reserved\" as can be seen here https://archive.org/details/B-001-001-265/page/n9/mode/2up I have requested a speedy deletion of the image as a blatant copyright violation.\n#Don't add copyrighted images to my talkpage. You linked to the source, there was no need to add a copy to my page, even if it were not a copyright violation. I have removed it.\n#If you have reliable sources that state that the person in question is a noted palindromist then you can add the claim with the source, but the source you have provided does not say that. It states that that palindrome is notable. It does not state that the person in question wrote it, or give any authorship. Yes, Magha may have included it in his work, but was he the original author of the palindrome? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:29, 24 September 2020 (UTC)\n\n:{{replyto|Meters}}\nI'm new to Wikipedia editing and the screenshot was presented as a proof only, no violation intended.\nMagha's authorship of the palindrome is clearly stated in article on Shishupala vadha (section 'Linguistic engenuity'). Apart from sarvatobhadra 2 more palindromes from 19th canto are mentioned there (stanzas 44, 88). It should be noted that Shishupala vadha is a coherent story, not a collection of poems, so stanza 27 is part of the plot. \n[[Shishupala_Vadha|Shishupala Vadha]]\n\nAuthorship is also confirmed in this article (part 14.1), while Magha is praised as 'manipulator of Sanskrit language; and, there is no equal to him'. The palindrome in focus is said to belong to 'the most complex poetic device ever created'.\n[https://sreenivasaraos.com/2012/10/10/chitrakavya-chitrabandha/ Chitrakavya-chitrabandha] \n[[User:Yurrray|Yurrray]] ([[User talk:Yurrray|talk]]) 13:24, 25 September 2020 (UTC)\n\n== You removed the updates on the Monsignor Farrell page. ==\n\nThere has been a lot of updates to Monsignor Farrell and we want the right information up there. [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 00:46, 27 September 2020 (UTC)\n:Who is we? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:47, 27 September 2020 (UTC)\n\n\nLou has recently been appointed president of Monsignor Farrell High School, and his personal info was on his page. There is also wrong info on people he ran against in office. Please change back or get back to me. [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 00:48, 27 September 2020 (UTC)\n:Please don't start multiple threads.\n:Please learn to add reliable sources. None of your edits were sourced or minor. I've already restored one of your edits, but in neutral language and with a source. And please answer my question. Who is \"we\"? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:52, 27 September 2020 (UTC)\n\nWe as in the staff of the school. I am the director of communications of Monsignor Farrell. I updated everything, but you changed it back, please put back everything I updated.  [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 00:53, 27 September 2020 (UTC)\n\nWhat sources are looking for because a lot of your information is either incorrect, our outdated  [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 00:54, 27 September 2020 (UTC)\n\n:Please read and follow [[WP:COI]]. You are a [[WP:PAID]] editor and should not make any edits directly. Propose your changes on the articles' tlakpages and provide reliable sources.  See [[WP:RS]] for what qualifies as reliable sources. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:57, 27 September 2020 (UTC)\n\nI was also trying to update our new president Lou Tobacco,s Wikipedia page due to multiple inaccuracies. So please change it back. [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 00:58, 27 September 2020 (UTC)\n:Are you even reading my responses and what's on your talk page? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:00, 27 September 2020 (UTC)\n\nWhat reliable sources did you use to put all of this inaccurate info on both pages then? LoL. Also why do I need to link all of this to a random site? Why can’t you just look it up? It’s the correct info anyways! [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 01:01, 27 September 2020 (UTC)\n:I'm done spending time on this here. Declare your conflict of interest. Propose your changes on the articles' talkpages. Point out any problems, and provide reliable sources for your changes. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:04, 27 September 2020 (UTC)\n\nOur lawyers want to speak to your supervisor for posting incorrect information, and a personal signature that has allowed corrupt individuals  to steal Mr. Tobacco’s personal information. I’m not going to do all of that random stuff when I can just change it now. Everything I have shared this evening can be googled and shown as fact. Please share your supervisors contact information for our legal counsel to follow up with.  [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 01:12, 27 September 2020 (UTC)\n\nAnd this is why we teach our students to not use Wikipedia, due to a lack of correct info, and trash support from moderators. [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 01:23, 27 September 2020 (UTC)\n:You are already at [[WP:ANI]] for the legal threat. I suggest that you remove it before you are blocked. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:24, 27 September 2020 (UTC)\n:{{ec}} {{ping|NuggetYT}} When you should be teaching them the difference between volunteer-driven and professional sources, as well as [[WP:PSTS|primary, secondary, and tertiary sources]] instead?  Gosh, your petty power struggle is surely a more academic reason.  [[User:Ian.thomson|Ian.thomson]] ([[User talk:Ian.thomson|talk]]) 01:25, 27 September 2020 (UTC)\n\nPlease show me any inaccuracies that I have presented to you in order to make your site truthful, accurate and factually correct ? I do not understand why you are taking such an aggressive and rude tact against the truth?   [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 01:30, 27 September 2020 (UTC)\n:{{ping|NuggetYT}} Final warning, withdraw your rude and aggressive legal threat above or you will be blocked. [[User:Ian.thomson|Ian.thomson]] ([[User talk:Ian.thomson|talk]]) 01:32, 27 September 2020 (UTC)\n\nExactly. [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 01:35, 27 September 2020 (UTC)\n\nPlease take Mr. Tobacco’s and Monsignor Farrell’s info down as it is inaccurate. We will be most certainly following up as we stand behind our truthful and accurate updates to you.  [[User:NuggetYT|NuggetYT]] ([[User talk:NuggetYT|talk]]) 01:38, 27 September 2020 (UTC)\n:User blocked. I have updated and referenced what I can in spite of this user's approach to communication. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 05:40, 27 September 2020 (UTC)\n*I wonder what their lawyers will think when I say that it looks bad for the school that their \"director of communications\" can't read and follow directions. Also, I don't really believe there's someone named Mr. Tobacco. Sounds like a public service announcement: \"Hey kids! Take it from me, Mr.Tobacco! Vaping's bad for you! Smoke the real thing!\" [[User:EEng#s|<b style=\"color: red;\">E</b>]][[User talk:EEng#s|<b style=\"color: blue;\">Eng</b>]] 07:18, 27 September 2020 (UTC)\n**{{replyto|EEng}} Actually Mr. Tobacco is real. One of those unfortunate surnames. See [[Louis Tobacco]]. I have to admit that I thought the same originally. The odd name combined with the claim that he was the first president of a school that opened years before he was born seemed like vandalism, but I quickly discovered my mistake. I had already started sourcing and restoring info when this blew up. And just to clarify, despite NuggetYT's accusation, I neither added Tobacco's signature to his article originally (that file was uploaded and added to the article by [[user: Rockhead126]] in 2014 [https://en.wikipedia.org/w/index.php?title=Louis_Tobacco&diff=640292380&oldid=633289404]) nor restored it when NuggetYT removed it. I am surprised that Wikipedia allows the inclusion of images of signatures for living people. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 18:06, 27 September 2020 (UTC)\n***Found [[WP:BLPSIGN]] which addresses the issue of reproducing signatures of living people. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 18:37, 27 September 2020 (UTC)\n\n== John Gunn removal from Yanceyville notable person and his high school  ==\n\nHi, I posted the German link which clearly says the person was born in Yanceyville and attend the high school in question. Why did you remove it?  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Peabodyb|Peabodyb]] ([[User talk:Peabodyb#top|talk]] • [[Special:Contributions/Peabodyb|contribs]]) 02:42, 29 September 2020 (UTC)</small> <!--Autosigned by SineBot-->\n\nDo you need me to post a reference in English as well? Thanks  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Peabodyb|Peabodyb]] ([[User talk:Peabodyb#top|talk]] • [[Special:Contributions/Peabodyb|contribs]]) 02:45, 29 September 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:Please sign your talk page posts.\n:As I said in my summaries: no article (on this Wikipedia), and no reference to show connection/attendance. The fact that he has an article on another Wikipedia does not establish his notability. Other Wikipedias have different rules for what they will allow as an article. As for his attendance at the school and connection to the town, yes, that's in the German article, but it is not sourced there either. If you think he is notable then [[WP:WTAF]], [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 02:47, 29 September 2020 (UTC)\n\nHi, I question your premise that notability must in the English language on this Wikipedia. I haven't heard that. Can you reference that rule please?  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Peabodyb|Peabodyb]] ([[User talk:Peabodyb#top|talk]] • [[Special:Contributions/Peabodyb|contribs]]) 03:03, 29 September 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:Please indent your talk page posts.\n:Can you provide a reference  to show that we accept articles on other Wikipedias as evidence of notability? As i said, other Wikipedias have different rules for what is an acceptable article. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:07, 29 September 2020 (UTC)\n\nI don't need to prove a negative i.e. that Wikipedia allows this - because of the concept of \"good faith.\" Clearly, my intentions are to inform the public at large about something true: that John Gunn existed - that he was born in Yanceyville, attended Bartlett Yancey High School and was a race car driver as is evident if you did the research yourself. Why not allow something that is true? He was a notable person. Can't you see that? [[User:Peabodyb|Peabodyb]] ([[User talk:Peabodyb|talk]]) 03:12, 29 September 2020 (UTC)\n\nIt is clear that all of Germany, a nation of many many millions and an EU member state, which is composed of over a half-billion people, that its Wikipedia finds John Gunn to be a notable person. So, it boggles the mind why that is not good enough for you. I wish to protest this further if you will not be flexible. What is the process to get others involved? Thanks. [[User:Peabodyb|Peabodyb]] ([[User talk:Peabodyb|talk]]) 03:20, 29 September 2020 (UTC)\n:Again, indent your talk page posts.\n:So, you wan to include him because an article about him on a '''different language Wikipedia''' makes an '''unsourced claim''' that he is from the town and attended the school. Good faith has nothing to do with this. We don't allow stuff simply because an editor is acting good faith. I undid you because  we don't know that he is notable '''by English Wikipedia standards''',  and we have '''no sources '''to show that he is from the town or attended the school. Read [[WP:RS]]. Read [[WP:V]]. Read [[WP:N]]. Read [[WP:NLIST]]. Read [[WP:SOURCELIST]].\n:If you want to see recent discussions about this look through the archives of [[Wikipedia talk:Notability]]. For example, [[Wikipedia_talk:Notability/Archive_60#How_much_weight_do_we_assign_to_the_fact_that_a_subject_page_has_a_wikipage_in_other_languages]] makes the point that we cannot accept another Wikipedia's article as evidence of notability, and [[Wikipedia_talk:Notability/Archive_62#Lists_of_notable_Alumni_different_for_different_languages,_combine?]] discusses alumni and foreign Wikipedia listings. [[WP:WTAF]] is the conclusion. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:33, 29 September 2020 (UTC)\n::You can raise the issue of the content in the specific articles on those article's' talkpages to see if other editors agree with my removal. I don't know where the best place to raise the general issue would be, but probably [[Wikipedia talk:Notability]] since it has already been discussed there. I would suggest that you search the archives first and read all of the previous threads on this though. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:43, 29 September 2020 (UTC)\n::And I see after your 2019 additions to [[Yanceyville, North Carolina]] you were already told by [[user:331dot]] about list entries requiring articles, and that issues should be discussed on the article talkpage. i[[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:52, 29 September 2020 (UTC)\n::I'm not familiar with car racing notability, or what Formula A is, but Gunn may be notable under [[WP:NMOTORSPORT]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:05, 29 September 2020 (UTC)\n:The claim is not unsourced. I said it was sourced and it is if you look. Wikipedia allows for additions in other languages. Anything done in the past is not relevant and was addressed. I'm all for learning from mistakes, but this is not one of them. You are wrong about this and you don't know everything. I assume you have no degree from the University of Wikipedia are not an expert. Good faith is the basis of Wikipedia while also citing evidence. In any case, I have a life and will ignore this bullsh-. [[User:Peabodyb|Peabodyb]] ([[User talk:Peabodyb|talk]]) 03:33, 30 September 2020 (UTC)\n::You are the one who keeps bringing it up. And no, there were no sources for this attendance at the school in your addition, or in the German Wikipedia article. You might want to read [[WP:IDHT]]. And after your last post, I'm not interested at all in continuing this. Don't post here about this again. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:34, 30 September 2020 (UTC)\n\n== Watts family murders ==\n\nHi!\nYou removed my \"In American Murder, the footage from the confession of Chris Watts reveals his father stating \"I'm not going to tell anyone\", possibly indicating complicity on his part.\" on the grounds that the netflix documentary is not a reliable source. However, the documentary is not making this claim, it is showing actual audio and footage of Ronnie Watts saying this in the interview room. It appears at 00.53.08 in the documentary.\nBest, Tove  <!-- Template:Unsigned IP --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[Special:Contributions/94.254.95.121|94.254.95.121]] ([[User talk:94.254.95.121#top|talk]]) 20:38, 3 October 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:It's [[WP:Original research]]. [[User:EEng#s|<b style=\"color: red;\">E</b>]][[User talk:EEng#s|<b style=\"color: blue;\">Eng</b>]] 21:13, 3 October 2020 (UTC)\n:My edit summary said \"that's a BLP violation. The boilerplate BLP1 template uses the phrase \"you didn't support your changes with a citation to a reliable source\" but the issue is that you were claiming more that we can get from the source. You cannot a  take phrase such as \"\"I'm not going to tell anyone\" and make claims about someone's complicity in covering up a crime. We do not know what he was referring to. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:43, 3 October 2020 (UTC)\n:You even said in your edit summary that this was conjecture. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:45, 3 October 2020 (UTC)\nI see your point. Thanks for your time!\nBest. <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:94.254.95.121|94.254.95.121]] ([[User talk:94.254.95.121#top|talk]] • [[Special:Contributions/94.254.95.121|contribs]]) 10:42, October 4, 2020 (UTC)</small>\n\n== [[Barry's Bay]] ==\n\nHey, thanks for the ping and the note: the more information y'all provide the easier it is for us. I found a bunch more sleepers and blocked them, as well as the range they came from. Maybe that will bring some order to the chaos. Thanks again, [[User:Drmies|Drmies]] ([[User talk:Drmies|talk]]) 00:02, 10 October 2020 (UTC)\n:Thanks for cleaning house. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:31, 10 October 2020 (UTC)\n\n== Family Radio Discussion (The sequel) ==\n\nOk just so you don't freak out at my edit on [[Family Radio]], at the bottom of their website [https://www.familyradio.org www.familyradio.org] they now list their address as 4057 Rural Plains Circie Suite 300, Franklin, Tennessee 37064. Also, as far as I am aware their network operations still operates out of [[Alameda, California]]. Have a nice day and stay safe. [[User:YborCityJohn|YborCityJohn]] ([[User talk:YborCityJohn|talk]]) 20:10, 12 October 2020 (UTC)\n:Did you really need to make this snarky comment? Two weeks ago I undid your unsourced change that contradicted the company's website and asked you for a source. The company has now updated their webpage and you've restored your change. Congratulations. How about assuming that I'd see the change and your explanation? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:22, 12 October 2020 (UTC)\n::I apologize if my post sounded snarky, I don't know why I wrote it that way. [[User:YborCityJohn|YborCityJohn]] ([[User talk:YborCityJohn|talk]]) 02:30, 13 October 2020 (UTC)\n:::OK. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:21, 13 October 2020 (UTC)\n\n== Belmont Community School ==\n\nI thought you might like to know that as a result of the notification of your mentioning me in [https://en.wikipedia.org/w/index.php?title=User_talk:95.149.226.92&diff=983191869&oldid=982232595 this edit] I investigated the editing history, and decided to semi-protect [[Belmont Community School]]. Vandalism has been going on for a very long time, no doubt from different vandals. [[User:JBW|JBW]] ([[User talk:JBW|talk]]) 08:28, 13 October 2020 (UTC)\n:Typical school garbage. Thanks. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:40, 13 October 2020 (UTC)\n\n== St. Mary's Notable Alumni ==\n\nYour criteria is arbitrary. If you look at all the other high schools in Calgary on wikipedia they have many notable alumni that do not include people with *any* wikipedia pages. Having a wikipedia page does not make you notable.  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Zpatz|Zpatz]] ([[User talk:Zpatz#top|talk]] • [[Special:Contributions/Zpatz|contribs]]) 14:32, 20 October 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:It's irrelevant that other articles may have the same problem with alumni entries without articles. The rule is not arbitrary at all. It's the consensus of Wikipedia editors that we do not list alumni unless they have Wikipedia articles to show their notability and reliable sources to show their attendance. Your entries have no articles, the provided sources are not independent reliable sources, and they do not show attendance. There are exceptions for people who would clearly qualify for articles if articles were written, but none of these people qualify. Again, [[WP:WTAF]]. And I suggest that you also read [[WP:EW]] and [[WP:BRD]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:12, 20 October 2020 (UTC)\n\n== Inverkeithny ==\n\nWhy did you revert [https://en.wikipedia.org/w/index.php?title=Inverkeithny&oldid=985549520 my edit] to [[Inverkeithny]]? [[User:Omniscientmoose42|Omniscientmoose42]] ([[User talk:Omniscientmoose42|talk]]) 21:27, 27 October 2020 (UTC)\n:because I didn't understand why you you were spamming Ancestry.com into a FindaGrave reference. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:59, 27 October 2020 (UTC)\n::Find A Grave is owned by Ancestry.com. [[User:Omniscientmoose42|Omniscientmoose42]] ([[User talk:Omniscientmoose42|talk]]) 22:01, 27 October 2020 (UTC)\n:::If so it's not obvious from the FindaGrave website. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 22:03, 27 October 2020 (UTC)\n::::It says it here[https://www.ancestry.com/corporate/blog/ancestry-com-acquires-find-a-grave/] and here[https://www.findagrave.com/about]. [[User:Omniscientmoose42|Omniscientmoose42]] ([[User talk:Omniscientmoose42|talk]]) 22:07, 27 October 2020 (UTC)\n:::::As I said, not obvious. I don't believe that the actual page that you used as a reference in the article makes any mention of the connection. The Ancestry.com page is not one that anyone on FindaGrave is going to see, and the FindaGrave page mention is buried at the bottom of a About Find a Grave page.  I don't see why we need to include the information about who now owns the Find a Grave site in the reference. The reference is to Find a Grave, which is published by Find a Grave. You can take this up on the article's talk page if you  want to get more input, but I would suggest that your time would be  better spent looking for a better source for the actual claim rather than worrying about the details of who published it. I considered removing the claim entirely since Find a Grave is user-generated site and thus is not [[WP:RS]]. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 22:21, 27 October 2020 (UTC)\n::::::Ah, I see you've already done that. Thank you. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 22:26, 27 October 2020 (UTC)\n\n== A kitten for you! ==\n\n[[File:Kitten (06) by Ron.jpg|left|150px]]\nThis kitten finds your [https://en.wikipedia.org/w/index.php?title=User_talk%3ASmith609&type=revision&diff=986182541&oldid=985510390 response] to be amazingly kind and to the point.\n\n[[User:AManWithNoPlan|AManWithNoPlan]] ([[User talk:AManWithNoPlan|talk]]) 17:12, 30 October 2020 (UTC)\n<br style=\"clear: both;\"/>\n\n== Notification ==\n\nThe reverts were done to get your attention to my point about your laziness. Thankyou for nothing!  <!-- Template:Unsigned --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Affiliatiob45|Affiliatiob45]] ([[User talk:Affiliatiob45#top|talk]] • [[Special:Contributions/Affiliatiob45|contribs]]) 01:50, 2 November 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:Are you accusing me of being a sock of [[user:Fylindfotberserk]] now? I put you on a level 4 warning because you were following that user around, randomly reverting their edits, and vandalizing their talk page. I have nothing to do with that user's account, but if you start that again I will report you for a block. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 02:12, 2 November 2020 (UTC)\n\n== A barnstar for you! ==\n\n{| style=\"background-color: #fdffe7; border: 1px solid #fceb92;\"\n|rowspan=\"2\" style=\"vertical-align: middle; padding: 5px;\" | [[File:Original Barnstar Hires.png|100px]]\n|style=\"font-size: x-large; padding: 3px 3px 0 3px; height: 1.5em;\" | '''The Original Barnstar'''\n|-\n|style=\"vertical-align: middle; padding: 3px;\" | High five! (Teahouse incident) Also,\n\n\n<div style=\"border-style:solid; border-color:blue; background-color:AliceBlue; border-width:1px; text-align:left; padding:8px;\" class=\"plainlinks\">[[Image:Peace dove.svg|100px|left]]\n[[User:Firestar464|Firestar464]] ([[User talk:Firestar464|talk]]) has given you a [[columbidae|dove]]! Doves promote [[Wikipedia:WikiLove|WikiLove]] and hopefully this one has made your day happier. Spread the WikiLove by giving someone else a dove, whether it be someone you have had disagreements with in the past (this fits perfectly) or a good friend. Cheers!  <br /> \n----\n<small>Spread the peace of doves by adding {{tls|Peace dove}} to someone's talk page with a friendly message!</small>\n{{clear}}\n</div><!-- Template:Peace Dove --> [[User:Firestar464|Firestar464]] ([[User talk:Firestar464|talk]]) 10:36, 2 November 2020 (UTC)\n|}\n\n==[[Francisca James]]==\n{{ping|Meters}} I'm just helping this page and reverting back to the '''[https://en.wikipedia.org/w/index.php?title=Francisca_James&diff=986876576&oldid=986874927 latest version that was made/checked and fixed by [[User:Materialscientist|Materialscientist]]'''] >>the right admin of Wikipedia who's concern about anti-vandalism. I didn't do any changes, im just reverting to the last version that was checked by the admins. This is gonna be '''my last revert on that page to prevent the edits without reliable sources supporting it''', and my only question is how come you're seems like supporting '''all of those who are just editing without sources, that's totally wrong and against the Wikipedia terms. its so funny to see [[User:Materialscientist|Materialscientist]] lend her hand to delete unreliable information but yet the other users kept on editing without reference''' correct me if I'm wrong, and as I said above, I'm just gonna stop contributing to the irrelevant page like this one, and I'm done with this [[Francisca James|Page]], I'm just gonna let them vandalize the page since the information that was stated there wasn't co-relate with the current reference.\n\nAt first I was really concern about this page getting vandalize (editing without sources), '''I'm even requesting [[Francisca James]] to get an anti-vandalism protection using my IP Address [https://en.wikipedia.org/w/index.php?title=User_talk:LuK3&diff=prev&oldid=986872944 HERE]'''. Thanks to the [[User:LuK3|LuK3]] for that, but starting from now I'm just gonna let it go and doesn't want to take care of this page anymore since I was feeling attacked after doing goods on [[Francisca James]] page. [[User:I Nyoman Gede Anila|I Nyoman Gede Anila]] 22:37, 11 November 2020 (UTC)\n\n:You were reverting to your desired version, including edits that were in no way vandalism or hoaxes, and you did so again after I warned you. What part of [[WP:EW]] do you not understand? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 22:04, 8 November 2020 (UTC)\n::CU blocked. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:20, 14 January 2021 (UTC)\n\n== [[Nina Dobrev]] again ==\n\nWhile I don't think there was ever proof that User:Quenreerer and [[Wikipedia:Sockpuppet investigations/Sumatro|User:Sumatro]] were the same editor, I have concerns that User:Belevalo is a sockpuppet of User:Quenreerer – to wit: [https://sigma.toolforge.org/editorinteract.py?users=Quenreerer+&users=Belevalo&users=&startdate=&enddate=&ns=Talk%2C+%2C&server=enwiki]\n\nI'm just keeping you in the loop here... --[[User:IJBall|IJBall]] <small>([[Special:Contributions/IJBall|contribs]] • [[User talk:IJBall|talk]])</small> 22:12, 10 November 2020 (UTC)\n:OK, thanks. Not enough to worry about yet. See what happens. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 23:01, 10 November 2020 (UTC)\n\n== Balmain NSW    Notable persons ==\n\nThanks for your messages. I am sorry that you agree with the deleting editor regarding my 2 entries in the Notable person list as not being notable.\n\nThe fact they were local Balmain residents who founded and owned one of Australia's largest industrial conglomerates, are included in the \nAustralian Dictionary of Biography, one received a Knighthood for services to Australian shipping, in 1971 built the largest ship made in Australia up to that time etc. etc.\n\nIf editors don't believe the above residents qualify as notable, but unknown activists and little known journalists do, then this is more damaging to Wikipedia than someone calling out an editor for their political ideology.\n\nThe fact that sources of notability are disregarded, and the subject is deleted solely because it is a red link goes against Wikipedia's own advice. \n\n\"In general, a red link should be allowed to remain in an article if it links to a term that could plausibly sustain an article, but for which there is no existing candidate article, or article section, under any name.\"                  https://en.wikipedia.org/wiki/Wikipedia:Red_link\n                                                                                                    \n[[User:Theirishslave|Theirishslave]] ([[User talk:Theirishslave|talk]]) 23:17, 13 November 2020 (UTC)\n:{{re|Theirishslave}} It's a good idea to link to the article in question ([[Balmain, New South Wales]]) or provide a link to the edit in question [https://en.wikipedia.org/w/index.php?title=Balmain,_New_South_Wales&diff=988446643&oldid=988446471].\n:Well thanks for the message. I usually get a laugh when an editor (or better yet an SPA) with almost zero Wikipedia edits thinks they should explain something to me. \n:There is a big difference between a person being mentioned in general prose in an article versus a notables list (even if that list happens to be formatted as prose rather than as a bulleted list). The first is someone who is already being mentioned in the article (because they have something to do with the topic of the article), while the latter is someone who is being mentioned specifically '''because they are notable''',  and they happen to have some connection (sometimes minor) to the subject in common with the other list members. We are generally fairly concerned about not letting lists of notable people degenerate into lists of red links for which articles may not be justified or which may never be written. You linked to [[WP:REDLINK]] (and <nowiki>[[WP:REDLINK]]</nowiki> is how to format that link properly). Did you actually read it? If so you must have missed the portion that discusses this issue:\n:<blockquote>Lists of \"notable people\" in an article, such as the \"Notable alumni\" section in an article on a university, tend to accrue red links, or non-links, listing people of unverifiable notability. Such list entries should often be removed, depending on the list-selection criteria chosen for that list.</blockquote> \n:My approach to this is to not accept red links in lists of notable people unless the person would clearly qualify for an article if one were written, and there are reliable sources to show that the person meets whatever other list inclusion criteria exist. Consensus has established criteria for when a person's notability can be presumed. See [[WP:BIO]] and the various linked essays. I'm not aware of any consensus that mere inclusion in the \"Australian Dictionary of Biography\" is sufficient to presume notability. Please point me to the discussion if you know of one.\n\n:Here's my take on this. You have been edit warring to include these red-linked entries for more than three years. You have been making personal attacks on the other edit for more than three years. You have never taken this to the article's talk page to discuss the potential notability of the people in question. You have not discussed this with the other editor for more than three years, at which time your arguments consisted of such less than compelling statements, based on your personal knowledge, as: \"they were held in high esteem by Balmain locals\". \"Sir Rod was a regular down at the sailing club\", and \"Good people\". [[user:Doctorhawkes]] responded with \"Unfortunately, they don't appear to be notable. ...\" You then attacked him and the next response was \"I have no ideology. If you believe that they are notable, trying writing an article for them and they will be judged against Wikipedia's notability guidelines.\"  And yet you show up on my page to discuss it and make a further attack on the editor after I make one edit? If you had simply attempted to write the articles or discuss this on the article's talk page this would have long since been settled.\n:As for the actual  content, one of them is likely notable, and one of them does not even have a source showing his connection the town. There was a third entry in earlier edits (before my involvement) but I don't remember what I though of him,and I've spent more than enough timer on this. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 05:02, 14 November 2020 (UTC)\n\n==Danny Ranes==\nCould you please submit https://en.m.wikipedia.org/wiki/Draft:Danny_Ranes into a Wikipedia article? There are a lot of pages for serial killers that are less filled out and less significant and more poorly sourced than Danny Ranes yet they were accepted. \n\nExamples: [[Jerry Walter McFadden]] and [[Robert Eugene Brashers]]  <!-- Template:Unsigned IP --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[Special:Contributions/2600:1010:B14F:6642:81C0:4E1C:320:9F98|2600:1010:B14F:6642:81C0:4E1C:320:9F98]] ([[User talk:2600:1010:B14F:6642:81C0:4E1C:320:9F98#top|talk]]) 20:08, 10 December 2020 (UTC)</small> <!--Autosigned by SineBot-->\n:No, I will not proxy for you. It's a draft. Follow the appropriate procedures for submitting a draft. [[user:AngusWOOF ]]  declined the draft, and I agree. It is not ready for article space. It '''may''' be possible to turn it into an article, but it is poorly written and most of the sources are actually not about the supposed subject.\n:Furthermore, I strongly suspect that  you and all of the other accounts and IPs that have touched that draft are socks of a blocked editor. \n:AngusWOOF, should we bite the bullet and start an SPI? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:16, 10 December 2020 (UTC)\n::Eng Wikipedia draft is at [[Draft:Danny Ranes]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:18, 10 December 2020 (UTC)\n:::To clarify, all the IPs and named accounts appear to be socks of [[User:Darren Cross]], but I strongly suspect that  Darren Cross is also a sock of a previously blocked master, which would make this draft eligible for  speedy deletion [[WP:G5]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:26, 10 December 2020 (UTC)\n\n== Regular deletion of green color for Climate ==\n\nI noticed you reverted [https://en.wikipedia.org/w/index.php?title=Tai_Mo_Shan&diff=prev&oldid=995052264 this edit]. I keep seeing these type of edits where someone deletes the green and I am not sure if I should revert it as I don't know much about climate boxes. Since it seems so common for this one type of edit, I wanted to make sure I understood whether this is just a common vandalism prank or is there some debate about the colors. Thanks, [[User:Fettlemap|Fettlemap]] ([[User talk:Fettlemap|talk]]) 05:22, 19 December 2020 (UTC)\n:This is a long-standing [[WP:LTA]], usually out of southern BC. We are pretty much following [[WP:RBI]], and as you can see, today's IP [[user:2604:3D08:2C82:F400:4918:DE4F:4A4F:2003]] has already been rangeblocked. See [[Wikipedia:Long-term abuse/24.68.2.110]] and [[User:CrazyBoy826/Target pages of recent IPs]] for some of the history. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 06:00, 19 December 2020 (UTC)\n\n==Yo Ho Ho==\n<div style=\"border-style:solid; border-color:blue; background-color:AliceBlue; border-width:1px; text-align:left; padding:8px;\" class=\"plainlinks\">[[File:Stonehenge (sun).jpg|250x100px|right]] [[File:WB 229 tankard.jpg|150x100px|left]]\n\n[[User:Donner60|Donner60]] ([[User talk:Donner60|talk]]) is wishing a foaming mug of [[Wikipedia:WikiLove|Seasons Greetings]]! Whether you celebrate your hemisphere's [[Solstice]] or [[Christmas]], [[Diwali]], [[Hogmanay]], [[Hanukkah]], [[Lenaia]], [[Festivus]] or even the [[Saturnalia]], this is a special time of year for almost everyone!    <br /> \n\n<small>Spread the holiday cheer by adding {{[[WP:SUBST|subst]]:[[User:WereSpielChequers/Dec20]]}} to your friends' talk pages</small>.\n{{clear}}\n</div>\n:Many thanks, and the same to you too (as we all continue to hunker down to hide from COVID-19). [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 07:00, 24 December 2020 (UTC)\n\n== The Abrams at La Salle and Queen's University ==\n\nHello Meters, I noticed that my cited changes to these two pages, \"La Salle Secondary School\" and \"List of Queen's University People\" were reverted. They were cited and I can provide proof of the veracity of the changes. Could you please let me know a) why the changes were reverted, and b) how to properly make the changes so that they will not be further reverted?\n\nThanks,\n[[User:JohnAbrams23|JohnAbrams23]] ([[User talk:JohnAbrams23|talk]]) 19:26, 11 January 2021 (UTC)JohnAbrams23\n:As I said in my edit summaries: \"Not individually notable\". The '''group''' is notable, but notability is not inherited. We do not have Wikipedia articles on the individuals to show their individual notability. By the way, since your username is the same as one of the brothers you are attempting to add, it appears that you are attempting to add yourself to lists of notable alumni. Not a good idea. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:30, 11 January 2021 (UTC)\n\na) yes I am, admittedly, one of the brothers. But the notability of the group speaks for itself and as you said, the notability of the group is verifiable. \nb) Both James Abrams and John Abrams (myself) graduated from Queen's University and La Salle Secondary School, and the truth of this is verifiable through various sources. The band's success is collective. Each of the individual's notability in this case is inextricably intertwined with the other's. Could you kindly let me know how then to add the group \"The Abrams\" to the list, without the need for individual pages on each member of the group? Would it, for instance, be best to list them each individually, i.e. \"John Abrams, member of The Abrams...\" and \"James Abrams, member of The Abrams...\" in two separate lines? [[User:JohnAbrams23|JohnAbrams23]] ([[User talk:JohnAbrams23|talk]]) 19:38, 11 January 2021 (UTC)JohnAbrams23\n:No, making individual entries for each brother with both entries simply linking or redirecting to the group does not change anything. Alumni lists are for notable alumni. The group is notable, but the group is not an alumnus, and the members are not notable simply because the group is notable. See [[WP:WTAF]], but '''you''' should not be the person to write the articles. See [[WP:COI]]. You have  a conflict of interest in writing about you or your brother or your group. Even adding mention of your group to your hometown as you did at [[Kingston]] is somewhat questionable. If you have no interest in Wikipedia other than to mention your group, your brother, and yourself you probably should not be here. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:50, 11 January 2021 (UTC)\n::In some cases a case can be made for mentioning groups that have a particularly close connection to an institution, but I don't see that here. The group was not formed a the university or even at the high school, and there is no mention of either school in the group's article, so there seems to be no connection other than that you both attended. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:00, 11 January 2021 (UTC)\n\n== AFD participation request ==\nAs you are one of the active participants in AFDs, i request you to please have a look at [[Wikipedia:Articles for deletion/Deviprasad Dwivedi|this case]]. As there are so many pending AFDs to be resolved and so less volunteers, your assistance will help us reduce the workload drop by drop. Thank You, [[User:Pesticide1110|<b style=\"color:NavyBlue\">Pesticide<span style=\"color:orange\">1110</span></b>]] <sup>[[User talk:Pesticide1110|<i style=\"color:Teal\">Lets wrestle!</i>]]</sup> 08:06, 12 January 2021 (UTC)\n:{{re|Pesticide}} I was getting ready to respond to this when the AFD was closed. I would suggest opening an RFC to determine if being awarded the [[Padma Bhushan]] is sufficient to presume notability for any future cases. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:29, 12 January 2021 (UTC)\n\n== St. Pius X Catholic High School ==\n\nReceived your comments about our edits to St. Pius X page.  Thank you for the heads up that we have not changed our president since the second semester has begun.  Once we change that, I will re-change on the wiki page.  As far as Violet, we prefer not to have them listed as notable alumni, as we don't find that to be notable.  However, if it must, I guess if it's at the bottom of the page, that is fine.  <!-- Template:Unsigned --><span class=\"autosigned\" style=\"font-size:85%;\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:KMS1313|KMS1313]] ([[User talk:KMS1313#top|talk]] • [[Special:Contributions/KMS1313|contribs]]) 19:21, 13 January 2021 (UTC)</span> <!--Autosigned by SineBot-->\n:{{re|KMS1313}}Who is we? Please read [[WP:COI]]. And whether you think the drag queen is notable is not relevant. She is notable enough to have  a Wikipedia article, and her attendance at the school is sourced. That is all that is needed for an alunnus to be listed. The entries should be in alphabetical order. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:30, 13 January 2021 (UTC)\n::Page in question is [[ St. Pius X Catholic High School (Chamblee, Georgia)]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:31, 13 January 2021 (UTC)\n\n== Lynbrook High School ==\nRe: The Lynbrook High School notable alumni section and citation needed tag, I was curious your thought process for which alums need a citation and which don't, since documentation of graduation is not typically publicly available to cite as reference. In this particular case, I know firsthand that Tony Xu attended Lynbrook High school, but don't have access to a photo of his diploma or anything like that. From a quick Google search, one option would be to cite Tony's cross country records, would this suffice? [[https://www.xcstats.com/indiv_career_report.php?runr_id=697| Link here]] It'd be a shame to take the entry down because there isn't a citation since the information is factual and there are plenty of instances of correct alumni information that aren't easy to reference. Thanks.  <!-- Template:Unsigned --><span class=\"autosigned\" style=\"font-size:85%;\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Pjloury|Pjloury]] ([[User talk:Pjloury#top|talk]] • [[Special:Contributions/Pjloury|contribs]]) 01:37, 15 January 2021 (UTC)</span> <!--Autosigned by SineBot-->\n:All alumni need reliable sources to show their attendance (either in the school article or in the subject's article). I happened to check that one since I noticed a new alumnus being added. You didn't provide a source for his attendance, and his article does not mention the school, so I tagged the entry as needing a source. That you claim to know that he attended doesn't help. No offense, but people sometimes mistakenly or falsely claim that notable people attended their high schools. The broken link you provided above does not help either. Even if the link had worked I would not consider it to be a very good source. Same comment for a hypothetical picture of his diploma. All that would show is that someone of that name attended, not that the subject of this article attended. Since I can put the subject in San Jose as a teenager I would likely leave such an entry in but tag it with \"Better source needed\". Other editors might not leave it in at all, and I would not restore it myself if someone did choose to take it out. You need to find a source that shows that the Tony Xu who is the subject of [[Tony Xu]] attended the school. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:00, 15 January 2021 (UTC)\n\n== Tom Brady ==\n\nIsn't calling Tom Brady the \"Greatest Quarterback of all time\" an opinion? It is, so I will again, erase this again, please explain to me why, you reverted my edit.\n\nThanks,\nQL102944 [[User:QL102944|QL102944]] ([[User talk:QL102944|talk]]) 03:50, 19 January 2021 (UTC)\n:See your talk page. I already explained why I undid you, and why you need to discuss this edit on the articles talk page.  It is  a long-standing well sourced part of the lead. Yes it's opinion. Multiple writers and others have expressed that opinion, and that's how we present it. We're not putting it in Wikipedia's voice by saying he '''is''' the best, we're simply saying that many people have said so. Again, take it to the talk page per [[WP:BRD]] and make your case for removing it. MAybe you will get consensus to remove it, maybe you won't, but continuing to make  a contested removal without discussion will eventually  end in a block. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:56, 19 January 2021 (UTC)\n\nThank you for elaborating, having me understand this is not the wiki's opinion. I will try my best to use this information in my edits in the future.\n\nThanks,\nQL102944 [[User:QL102944|QL102944]] ([[User talk:QL102944|talk]]) 04:03, 19 January 2021 (UTC)\n\n== Bibite Polara ==\n\nHi, I removed the template because the page has been corrected and enlarged as requested days ago. Check it out--[[Special:Contributions/87.0.170.158|87.0.170.158]] ([[User talk:87.0.170.158|talk]]) 04:24, 22 January 2021 (UTC)\n:No, what you said in your summary was that you were removing it because it was a PROD request that had previously been removed [https://en.wikipedia.org/w/index.php?title=Bibite_Polara&diff=prev&oldid=1001959163]. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:26, 22 January 2021 (UTC)\n\n== re: ==\n\nbecause the page has been corrected and the template no more reason to be there, on prod I got confused--[[Special:Contributions/87.0.170.158|87.0.170.158]] ([[User talk:87.0.170.158|talk]]) 04:31, 22 January 2021 (UTC)\n:(ec)Again, that's not what you claimed in your edit summary. You clearly stated that you were removing it because it was a PROD and that anyone who wanted to delete it would have to take it to AFD. You appear to know the difference, so i can only assume that you were misstating things in an attempt to intimidate the IP who restored the notability tag. \n:Please drop this. I don't want multiple threads about this, let alone multiple threads on my talk page. Respond to the thread on your own page if you must. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:37, 22 January 2021 (UTC)\n::[[user:MrsSnoozyTurtle]] believes this IP is the globally blocked user [[:user:Pasionpalau]], and now the new account [[:User:Kanoawi]] has restored the same  material to [[Economy of Italy ]]. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 07:56, 23 January 2021 (UTC)\n:::IP blocked as sock of [[user:Sonny Solina]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 23:43, 29 January 2021 (UTC)\n=== source ===\n\nI am confused I will look for sources--[[User:Kanoawi|Kanoawi]] ([[User talk:Kanoawi|talk]]) 08:12, 23 January 2021 (UTC)\n\n=== Page locked Economy of Italy ===\n\nHello, in the section of companies you have to put (fashion) after YOOX (then food & beverage starts)\nthe category (transport) has been left out, where at least Grimaldi Group and New Passenger Transport must be added\nThird thing to add some southern companies (such as Grimaldi Group) because there is not even one on the list while in the source there are many. Thanks.  <!-- Template:Unsigned --><span class=\"autosigned\" style=\"font-size:85%;\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Kanoawi|Kanoawi]] ([[User talk:Kanoawi#top|talk]] • [[Special:Contributions/Kanoawi|contribs]]) 09:29, 23 January 2021 (UTC)</span> <!--Autosigned by SineBot-->\n:As I said on your talk page, {{tq|creating a new account and restoring the unsourced content with a fake edit summary isn't going to work}}. You are restoring an edit made by a now globally blocked editor, and the page is now protected. It's not about adding companies simply because they are from a particular area of Italy. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:20, 23 January 2021 (UTC)\n::and blocked as sock of [[user:Sonny Solina ]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 23:41, 29 January 2021 (UTC)\n\n== message you left ==\n\nYou recently left a message on the user talk page of User talk:204.78.14.10\n\nThis IP address is for a university and is shared by over 3,000 people.  The intended recipient of the message will likely never see it\n\n--[[Special:Contributions/204.78.14.10|204.78.14.10]] ([[User talk:204.78.14.10|talk]]) 15:48, 22 January 2021 (UTC)\n:You tagged the page as  a shared IP. There's no need to tell me, I know what a shared IP is. I left the message 2 or 3 minutes after the IP made his edit, and the IP is listed as  a static IP, so there is a good chance teh editor saw the message. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:45, 22 January 2021 (UTC)\n\n== Thank you! ==\n\nJust read your messages. Thank you for helping me. [[User:Documentartists|Documentartists]] ([[User talk:Documentartists|talk]]) 05:13, 24 January 2021 (UTC)documentartists\n:OK Good luck. Sorry for the tone of my last message. It appeared that you had already read the messages but were ignoring some of them. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 05:38, 24 January 2021 (UTC)\n\n== Question about feedback on Chicago pizza ==\n\nHi, I genuinely do not understand why my comment with a link to a source talking about Chicago pizza was not allowed? I am adding another source https://www.bonappetit.com/story/real-chicago-pizza-tavern-style  Not sure if you're from Chicago, but this is a big deal to Chicagoans and deep dish is not considered true Chicago style pizza, contrary to some public belief. That's why I wrote that. Can you help me understand? I am new to Wikikpedia and have read articles and instructions and I don't understand why it wasn't allowed if reputable source is cited. Thanks  <!-- Template:Unsigned --><span class=\"autosigned\" style=\"font-size:85%;\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:TulipSpot|TulipSpot]] ([[User talk:TulipSpot#top|talk]] • [[Special:Contributions/TulipSpot|contribs]]) 02:10, 28 January 2021 (UTC)</span> <!--Autosigned by SineBot-->\n:The first two times you attempted to add this to the lead it was a completely unsourced non-neutral comment. The third time you attempted to add this to the lead you added an external link (rather than a source), but one that appears to be little more than an opinion piece, and '''even that site''' admits that deep dish pizza is synonymous with Chicago. It does not matter if some people from Chicago now turn their noses up at it and call it \"tourist pizza\". The thin crust style is already mentioned in the article. Just leave it be unless you can provide reliable sources that show that the rest of the world thinks that Chicago style pizza is the thin-crust style.\n:And after your second attempt I told you to discuss this edit on the article's talk page. You didn't do that. You might want to read [[WP:EW]] before doing this again. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:15, 28 January 2021 (UTC)\n::By the way, there's a company called \"Chicago Deep Dish Pizza\" in my town, and I live thousands of miles from Chicago. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 04:17, 28 January 2021 (UTC)\n\n== Regarding to add the correct information to Wikipedia ==\n\nHello Sir,\nJust now I received a message from you. You've told me that I am using multiple IP addresses to disrupt Wikipedia. You have mistaken me. I am not trying to disrupt or misguide Wikipedia. I am just trying to correct Wikipedia. I have seen that the information that was present in the [[Narasimha]] page of Wikipedia was totally wrong. It was not mentioned in any [[puranas]] or [[vedas]]. I removed the wrong information about Narasimha and added the correct information which was mentioned in the Vathistabhaana purana. The information I added to Wikipedia was 100% correct. But after I published it, I noticed you removing the correct information and adding the wrong information again. I humbly request you to not mistake me and just understand my efforts on adding the correct information to Wikipedia. Please let me to add the correct information and make people understand the correct thing.\n\nThanks  <!-- Template:Unsigned IP --><small class=\"autosigned\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[Special:Contributions/106.76.22.205|106.76.22.205]] ([[User talk:106.76.22.205#top|talk]]) 08:59, 1 February 2021 (UTC)</small> <!--Autosigned by SineBot-->\n:You are using mobile IPs so your edits are coming through on multiple IPs. You are removing sourced material and replacing it with your unsourced versions on [[Gandaberunda]], [[Sharabha]], and [[Narasimha]]. Discuss your edits on the articles' talk pages per [[WP:BRD]] and provide reliable sources (see  [[WP:RS]] and [[WP:V]]) or leave the articles alone. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 20:30, 1 February 2021 (UTC)\n\n==FYI==\nHello M. I wanted to make you aware of this [[Wikipedia:Administrators' noticeboard/Incidents#problematic stubborn user Meters]] as it looks like they aren't aware of the requirements to do so. Regards. [[User:MarnetteD|MarnetteD]]&#124;[[User talk:MarnetteD|Talk]] 00:56, 2 February 2021 (UTC)\n:Thanks. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:34, 2 February 2021 (UTC)\n::You are welcome. Looks like they got their knickers (and socks) in a twist :-) I just couldn't resist. [[User:MarnetteD|MarnetteD]]&#124;[[User talk:MarnetteD|Talk]] 03:45, 2 February 2021 (UTC)\n:::Yup., that was quick. Both [[user:00.IP.00.IP.]] and [[user: 2noname2 ]] CU blocked as [[User:0guests0]]. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 06:27, 2 February 2021 (UTC)\n\n== I am Tony Labranche ==\n\nI am Tony Labranche therefore I feel like I should be an expert on Tony Labranche. [[User:Mrspookydooky2|Mrspookydooky2]] ([[User talk:Mrspookydooky2|talk]]) 06:49, 2 February 2021 (UTC)\n:Then please read [[WP:COI]] and stop editing about yourself. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 06:51, 2 February 2021 (UTC)\n\n== How do I add a citation in a text box? ==\n\nHow do I add a cotisation in a text box? To fix the Souhegan Rival edit [[User:Mrspookydooky2|Mrspookydooky2]] ([[User talk:Mrspookydooky2|talk]]) 07:03, 2 February 2021 (UTC)\n:Again, read [[WP:COI]] and follow its requirements before you do anything else. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 07:06, 2 February 2021 (UTC)\n\nIs being an alum a conflict of interest? [[User:Mrspookydooky2|Mrspookydooky2]] ([[User talk:Mrspookydooky2|talk]]) 07:10, 2 February 2021 (UTC)\n:Not usually, but you '''have''' made conflict of interest edits to that article since you have made edits about yourself. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 07:15, 2 February 2021 (UTC)\n\n== Beto and Woodberry Forest ==\nHi, Meters! I saw via my watchlist that you reverted an IP on the [[Woodberry Forest School]] page when they added Beto O'Rouke to the notable alumni section, citing Beto's wikipedia page.  While I can understand the revert of unreferenced material, and while \"notable alumni\" spam is indeed all too common... the IP is right in this case.  It's straightforward to reference Beto as a Woodberry alum, e.g. this Dallas Morning News summary <ref>{{cite web |title=Points from the trail |url=https://www.dallasnews.com/news/politics/2019/02/19/beto-o-rourke-s-high-school-past-trump-s-chances-in-2020-blackface-at-ut-laura-miller-s-return/ |website=Dallas morning News |access-date=4 February 2021}}</ref>; in the reference, there's also a link to a deeper dive from the DMN's Washington correspondent, who visited Woodberry.  \n\nBeto should definitely be in notable alumni section.  This is well referenced enough that I'd expect it's uncontroversial, once you see the actual references - but you reverted, so I want to make sure I'm not missing something before I add him in.  (I have a conflict of interest regarding Woodberry Forest School, which is why I'm being extra careful here.  And to be clear, not only am I not the IP who added this, I don't have any idea who that might be.)  Thanks!  [[User:Moishe Rosenbaum|Moishe Rosenbaum]] ([[User talk:Moishe Rosenbaum|talk]]) 02:42, 4 February 2021 (UTC)\n:{{replyto|Moishe Rosenbaum}} You might want to actually read the summary and look at the edit. The IP '''removed''' the entry. I '''restored''' it with the summary \"notable and his attendance is sourced in his article\". Why would you think that summary meant I was removing content? [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 03:53, 4 February 2021 (UTC)\n::Ah... well, I must be an idiot... I *did* read the summary and look at the edit.  I wonder if I clicked on the previous diff?  Whatever it was, I saw IP adding with that summary and you removing.  Now I look again, I see it was the other way round.  My fault! Turns out I was missing something indeed.  (Grrr, I shoulda just tried to add it back in myself, at which point I would have seen your actual edit.)  All good!  Sorry to trouble you.[[User:Moishe Rosenbaum|Moishe Rosenbaum]] ([[User talk:Moishe Rosenbaum|talk]]) 17:06, 4 February 2021 (UTC)\n:::No probs. I've read diffs backwards myself. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 19:15, 4 February 2021 (UTC)\n{{reftalk}}\n\n== Oba Chandler. ==\n\nGood evening. I received a message from you regarding Oba Chandler and content I either added or changed on that page. I am Oba Chandler's daughter, Kristal Sue Mays. Information I added to the page is correct. I don't understand why you would remove content that is correct or that I corrected. Thank you, Kristal Sue Mays. [[User:Moto2222|Moto2222]] ([[User talk:Moto2222|talk]]) 00:00, 7 February 2021 (UTC)\n:Article is [[Oba Chandler]]\n:Your edits were unsourced, improperly formatted, and not particularly useful. As for who are, we don't know that you really are who you say you are. It is quote common for people to pretend to be the subject of an article or someone associated with the subject in an attempt to influence the content. If you wish to prove your identity then please contact OTRS at info-en-q@wikimedia.org to do so. Any information you provide will not be made public, but your account will be tagged as having a verified identity. Note that proving your identity does not give you the right to add inappropriate or unsourced content. In fact, since you claim to be his daughter, you should not be editing the article directly yourself, except under very limited circumstances. Please read [[WP:COI]] for how to deal with an article in which you have a conflict of interest. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:25, 7 February 2021 (UTC)\n\nSir, I know my name it is Kristal Sue Mays, not Krustal May Sue as is in Wikipedia. You state this is not particularly useful. If you are going to cite anything, especially people, those names should be correct as well as chronological dates.I will contact them as you have suggested. I do not understand your hostility, from your original message to me re Betty Field and Oba Chandler, stating that \"her ancestors, certainly, did not come over on the Mayflower\",  but the source I've located does cite that. Your choice of words is harsh to say the least. And as for people saying they are related to so and so, I do not know about them, however, I do know what I state is true and it unfortunately states on my birth certificate whom my parents are. You have names of myself and relatives incorrect and dates as well. I was under the impression  that anyone could add or change information as long as it is correct. I must have  been misinformed. Have a good evening. [[User:Moto2222|Moto2222]] ([[User talk:Moto2222|talk]]) 00:39, 7 February 2021 (UTC)\n:Yes, correcting obvious mistakes is one of the exceptions to COI rules, as you would have seen had you read the link, but that's not all you changed.  [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:41, 7 February 2021 (UTC).\n::And please don't misquote me. My comment on your talk page about this was {{tq|We don't need to know if her ancestors arrived on the Mayflower (and it certainly wasn't her great-grandparents as you claimed)}} I did '''not''' say that her '''ancestors''' were not on the Mayflower. I said that her '''great-grandparents''' were not (and it should have actually been '''grandparents'''). [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:46, 7 February 2021 (UTC)\n\n== Betty Field Actress ==\n\nHello , I changed information about Betty Field's ancestry. Her ancestors on her father's side were Mayflower colonists,  Priscilla and John Alden. My citation source is IMBD.com Betty Field biography.  In your message to me you stated that ,\" her ancestry did not come over on the Mayflower \". What I have resesrched, sir so far is that The Aldens are direct ancestors of Betty Field. I will continue my resesrch and when I can find further documentation I'll correct my information, until then, I won't reinstate the first admission of her ancestry.  I am new to this and just thought that was a very neat piece of information. Any help you can give me is greatly appreciated.  I'm sorry that I did not include the citation source. In future I will do so. Thank you, Kristal Mays [[User:Moto2222|Moto2222]] ([[User talk:Moto2222|talk]]) 00:21, 7 February 2021 (UTC)\n:Article is [[Betty Field]]\n:Your edit was unsourced and incorrect. You claimed that \"Betty's grandparents on her mothers side came on the Mayflower.\" As I said in my edit summary \"really, her <s>great-</s>grandparents arrived almost 400 years ago?\" Maybe her 10th-or-something great-grandparents did, but so what? \n:IMDB is a user-generated site and thus is not considered a reliable source, so you can't use that. Even if you do find  a reliable source, the information simple isn't worth including. We simply don't care that someone had immigrant ancestors on a particular ship almost 400 years ago. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 00:36, 7 February 2021 (UTC)\n\n== 150 million Deaths under British Empire ==\n\nwould you accept this source from a neutral reliable publisher https://www.jstor.org/stable/175562?seq=1 [[User:Danielbr11|Danielbr11]] ([[User talk:Danielbr11|talk]]) 22:22, 9 February 2021 (UTC)\n:Why are you posting this on my page?  I didn't undo you. I didn't comment on the edit. I see you are ANI yet again, and if you are getting into another back and forth on the same sort of issues as previously you are likely to be blocked. I suggest that you find something else to edit. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 22:26, 9 February 2021 (UTC)\nSorry it was Rklahn. I am discussing civily in reliable source noticeboard.[[User:Danielbr11|Danielbr11]] ([[User talk:Danielbr11|talk]]) 22:33, 9 February 2021 (UTC)\n:Should have taken my advice... now indef'ed from [[List of wars and anthropogenic disasters by death toll]] [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 01:10, 11 February 2021 (UTC)\n::And now indef'ed completely [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 21:04, 12 February 2021 (UTC)\n\n== Problem  ==\n\nI have made an edition in the sales of the album [[Laundry Service]] since through the official Facebook account of the singer the 20 million sales were confirmed by her. <s>[[User:Meters|Meters]] </s>  <!-- Template:Unsigned --><span class=\"autosigned\" style=\"font-size:85%;\">—&nbsp;Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Rolitha1953dikk|Rolitha1953dikk]] ([[User talk:Rolitha1953dikk#top|talk]] • [[Special:Contributions/Rolitha1953dikk|contribs]]) 16:21, February 22, 2021 (UTC)</span>\n:Don't sign my name to your post, and we have already explained to you why a singer's social media channel is not considered a reliable source for this information. [[User:Meters|Meters]] ([[User talk:Meters#top|talk]]) 18:19, 22 February 2021 (UTC)\n\n== ''The Signpost'': 28 February 2021 ==\n\n<div lang=\"en\" dir=\"ltr\" class=\"mw-content-ltr\"><div style=\"-moz-column-count:2; -webkit-column-count:2; column-count:2;\"> {{Wikipedia:Wikipedia Signpost/2021-02-28}} </div><!--Volume 17, Issue 2--> <div class=\"hlist\" style=\"margin-top:10px; font-size:90%; padding-left:5px; font-family:Georgia, Palatino, Palatino Linotype, Times, Times New Roman, serif;\"> * '''[[Wikipedia:Wikipedia Signpost|Read this Signpost in full]]''' * [[Wikipedia:Wikipedia Signpost/Single/2021-02-28|Single-page]] * [[Wikipedia:Wikipedia Signpost/Subscribe|Unsubscribe]] * [[User:MediaWiki message delivery|MediaWiki message delivery]] ([[User talk:MediaWiki message delivery|talk]]) 21:29, 28 February 2021 (UTC) <!-- Sent via script ([[User:Evad37/SPS]]) --></div></div>\n<!-- Message sent by User:Eddie891@enwiki using the list at https://en.wikipedia.org/w/index.php?title=Wikipedia:Wikipedia_Signpost/Subscribe&oldid=1009065746 -->\n\n== Thank you ==\n\nGood morning, I would like to first say thank you for your messages. I would also like to let you know that there is no malicious intent or vandalism in the things I have done these past few days. I am an 8th grade English teacher and my students are starting their research essay unit. One of the key components is finding reliable websites. Every year I make minor changes to a known wiki page (that I immediately change back after the lessons) to show my students that, at times, Wikipedia can be unreliable. Your messages have added to my lesson so I say thank you and have a good day. 😁 [[User:ThoseGuys1980|ThoseGuys1980]] ([[User talk:ThoseGuys1980|talk]]) 13:28, 6 March 2021 (UTC)"}]}}}