{"pages": {"2241876": {"pageid": 2241876, "ns": 0, "title": "OFI Crete F.C.", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "diff": {"from": 484031564, "to": 484032470, "*": "<tr>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 11:</td>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 11:</td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| manager = [[Nikos Anastopoulos]]</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| manager = [[Nikos Anastopoulos]]</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| league   = [[Superleague Greece|Super League]] </div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| league   = [[Superleague Greece|Super League]] </div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">−</td>\n  <td class=\"diff-deletedline\"><div>| season   = [[<del class=\"diffchange diffchange-inline\">2011–12_Super</del> League (Greece)|<del class=\"diffchange diffchange-inline\">2011–12</del>]] </div></td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>| season   = [[<ins class=\"diffchange diffchange-inline\">2010–11_Football</ins> League (Greece)|<ins class=\"diffchange diffchange-inline\">2010–11</ins>]] </div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| position = [[Football League (Greece)|Football League]], 3rd (promoted)</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| position = [[Football League (Greece)|Football League]], 3rd (promoted)</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| pattern_la1=_aachen1112a|pattern_b1=|pattern_ra1=_aachen1112a|</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>| pattern_la1=_aachen1112a|pattern_b1=|pattern_ra1=_aachen1112a|</div></td>\n</tr>\n"}, "*": "{{Inappropriate tone|date=June 2010}}\n{{Infobox Football club \n| clubname = OFI\n| image    = [[Image:Ofi.png|100px|logo]] \n| fullname = Omilos Filathlon Irakleiou<br>(''Όμιλος Φιλάθλων Ηρακλείου'')\n| nickname = ''Omilos'' (The Club) \n| founded  = 1925 \n| ground   = [[Theodoros Vardinogiannis Stadium]] (\"Yedi Kule\")<br>[[Heraklion]], [[Crete]], [[Greece]]\n| capacity = 8,500 <ref>http://www.ofi.gr/facilities.aspx</ref>\n| chairman = [[Nikos Machlas]]\n| manager = [[Nikos Anastopoulos]]\n| league   = [[Superleague Greece|Super League]] \n| season   = [[2010–11_Football League (Greece)|2010–11]] \n| position = [[Football League (Greece)|Football League]], 3rd (promoted)\n| pattern_la1=_aachen1112a|pattern_b1=|pattern_ra1=_aachen1112a|\n| leftarm1=000000|body1=FFFFFF|rightarm1=000000|shorts1=FFFFFF|socks1=FFFFFF\n| pattern_la2=_blackborder|pattern_b2=|pattern_ra2=_blackborder\n| leftarm2=FFFFFF|body2=000000|rightarm2=FFFFFF|shorts2=000000|socks2=000000\n| website  = http://www.ofi.gr/\n}}\n'''OFI''' ({{lang-el|''ΟΦΗ'', full name: ''Όμιλος Φιλάθλων Ηρακλείου''}}, ''Omilos Filathlon Irakleiou'', \"Sport-lovers Club of Heraklion\"), , is a [[Greece|Greek]] [[association football]] club based in [[Heraklion]], on the island of [[Crete]]. Outside Greece, the club is generally known as '''OFI Crete F.C.''', however, the name ''Crete'' is not actually part of the club's official title. \n\nOFI is the club with most appearances in the [[Super League Greece|Greek first division]] among clubs of the Greek [[province]]. The club has had noticeable success to date, particularly considering its comparative status, and has won one [[Greek Football Cup|Greek Cup]] and one [[Balkans Cup]], while they have competed several times in [[UEFA]] competitions.\n\nAt the end of the [[Super League Greece 2008-09|2008–09]] season, OFI was relegated to [[Beta Ethniki]], thus ending a notable 33-year run in the Greek top division. In the [[2010–11 Football League (Greece)|2010-11]] season they were promoted back to the top flight.\n\n==History==\n===The foundation===\nThe club was founded during the autumn of 1925 by a group of athletes that used to exercise in a specific gym in the city centre of Heraklion. The official name given to the sports club was '''Omilos Filathlon Irakleiou''' (acronym  '''OFI''').  The colours that OFI used were black and white, because none of the existing sports clubs had the same colour combination in Crete. The scope of the sport club, as had been written down in the first deed of association, was to participate in all kinds of events, and exhibitions related to athletics. During the first period of OFI’s existence most of the teams founders were also members.<!-- Deleted image removed: [[Image:Ofi-1938.jpg|thumb|OFI's squad in 1938]] -->\n\n===The years before World War II (1925–1940)===\nThe years preceding World War II were a very difficult period not only for Crete, but for Greece in general. Thus, it was extremely difficult for OFI to travel and participate in national football tournaments. As a result, OFI was limited to matches around the island of Crete and particularly with other football clubs based in Heraklion. Strangely enough, these local matches were more frequent in comparison to the official ones of former periods. Even though official documentation does not exist, elderly fans of OFI believe that the team played around 400 matches before the Germans finally occupied Crete.\n\n===First participation in the National League (1945–1962)===\nAfter the German occupation of Greece had ended, football tournaments around the country started again. At this time there was only the “First Division” championship, in which standard football teams from [[Athens]] and [[Thessaloniki]] participated, including a few teams which qualified through preliminary rounds. However, it was almost impossible for a team coming from the province to take part in it. \n[[Image:Ofi-1954.jpg|thumb|OFI's squad in 1954]]\nThis situation arose because the [[Hellenic Football Federation]] structured a system in which football teams from around the country had to play many preliminary rounds before proceeding to the national championship. As a result, even though OFI was the top football team in Crete, they could not take part in the national tournament.\n\nAfter 1956, the system in Greece changed slightly. Advantages were that in some seasons the preliminary rounds were organized in groups of a few teams, where the champions of each group were promoted directly to the championship of the same season’s First Division. One of those seasons was in 1957/58. OFI played preliminary games in a group of 4 teams, where they finished in first place. Thus, OFI, for the first time in its history, participated in the Greek National Championship. However, the team could not stand the frequent trips around Greece and finished in last position. Up to 1962, when the official 2nd Division Championship was organized, OFI tried again many times, but unsuccessfully, to take part in the competition of the 1st Division again.\n\n===Attempts in the official 2nd League (1962–1968)===\n[[Image:Ofi-1968.jpg|thumb|Celebrations in [[Chania]] after the promotion of OFI to the 1st division]] \nIn 1962/63 the official Greek 2nd division league was set up for first time. OFI was one of the teams that participated in the league and completed the season in 9th position. In 1963/64 and 1964/65 OFI finished in 3rd and 5th position respectively.\nIn 1965/66 OFI were the champions of the 2nd Division of Greek football and only one step away from promotion to the official 1st National Division of Greek football. \n\nYet, the Hellenic Football Federation decided that even the champions of the 2nd Division had to play preliminary games in order to be promoted. \n\nOFI lost in the play-off matches and remained in the 2nd Division. In 1966/67 the disappointment was huge, even though OFI ended in 3rd position. Everyone on the island of Crete was feeling that the moment where they could see the pride of their island in the top league was very close.\nIn 1967/68 OFI finished in 2nd position and went into play-off games with the bottom team of the 1st division. The final match of the play-offs was to take place in the city of [[Chania]], on 26/06/1968. OFI, with the help of 10,000 Cretans thrashed the team from the 1st division with a 3–0 win and made the dreams of thousands of supporters come true. OFI was an official member of the 1st National Division.\n\n\n\n\n\n\n\n\n__________________\n\nVon : Professor Dr. Müller .\n\n===Debut in the 1st League (1968–1971)===\nOFI’s debut in the national 1st division was very difficult. “Omilos” ended the first round in 15th position. It was a very difficult task to remain in the league. However, in the 2nd round the Cretans played magnificently and finally finished in 12th place. In the next season OFI had already gained the experience of playing in the top league of Greek football. The “Snakes” finished in 13th place, but the strange thing was that OFI remained unbeaten in almost all of their home games in Heraklion. Only two teams managed to survive and leave Crete with an away win. Thus, even if OFI was not a feared opponent, all the other teams were anxious when taking the trip to the island of Crete.\n\n1970/71 was the worse season the team from Heraklion ever had in the 1st Division. OFI ended in 17th position and was relegated for the last time in their history to the 2nd division. The whole season was a tragedy for the Cretans. OFI had to meet “old friends” from the 2nd division again and start battling again in order to be promoted for a second time.\n\n===Back to the 2nd league (1971–1976)===\nOFI had been relegated again, but this time the 2nd division had changed entirely. After all, the championship had been more officially organized and opponents were tougher than before.\n\nOFI spent another 5 seasons in the 2nd division, from 1971–72 to 1975–76. During the first season, the team was continually in 1st place.\n[[Image:Ofi-1976.jpg|thumb|Thousands of Cretans celebrating OFI's last promotion to the 1st division]]\nHowever, at the end of the season, OFI’s good performances deteriorated and they finally finished 4th. In 1972/73 the management decided on a complete overhaul of the squad. In these circumstances, the 13th position OFI achieved was predictable, yet a new era of the stars of OFI had just begun. In the next season OFI finished 6th and in 1974/75 they finished 5th. In the next season the league was divided again into two groups, each of 20 teams. The champions of each group would be promoted directly to the First National Division. OFI couldn’t afford to miss this chance.\nEverything started perfectly for “Omilos” in 1975/76. They finished 1st at the end of the first round with a huge lead over the runners-up and then finished the season as champions. \nThe whole island of Crete was celebrating the promotion of OFI to the 1st division. Up to the present, (2007), OFI have never been relegated again.\n\n===The years before the arrival of Eugène Gerards (1976–1985)===\nDuring the first 3 seasons of OFI’s presence in the 1st Division, the Greek championship still had an amateur status. In 1976/77, even though OFI were rookies, they finished in 6th place and gained the admiration of the whole country. In addition Dimitris Papadopoulos finished the top goal scorer of the League season. The following two seasons OFI finished 8th and 7th respectively, a period in which OFI was never once defeated in Crete. Even the “heavyweights” of the league (Panathinaikos, Olympiakos, AEK & PAOK) struggled to win any points when making the trip to the '[[Genti Koule]]' on island of Crete.\n\nThe championship in Greece was professionalised for the 1979/80 season and in the middle of that term the [[Vardinogiannis]] group bought the football club of OFI (see rival section). During that season  the only team that beat OFI at home in Crete was Panathinaikos. The Athenian team took the victory in Heraklion extremely easily with a score line of 0–3. It was the only loss endured by Cretans on the island that year, after all games had been completed OFI finished in 11th position. The next season Panathinaikos embarked on their first set of experiments on OFI{{Citation needed|date=February 2007}}. Young players came from all over the country in order to play for “Omilos”. Partly because of this experimentation by their new owners OFI only managed 13th position in the League. The 1981/82 campaign saw OFI finish in 9th place and the following 1982/83 season in 7th. It seemed clear that Theodoros Vardinogiannis wanted OFI to be a stronger team in the championship. He tried to achieve that, not by spending money for good players, but by sending 2nd hand players from his other team Panathinaikos or young players that could possibly be useful to OFI, but primarily, for Panathinaikos in the future when the time was right. Thus, in 1983/84 3 goalkeepers, 1 midfielder and 1 defender came from the Athenian team to Crete. {{Citation needed|date=February 2007}}\n\nThe continuing experimentation caused OFI to be disappointed yet again. OFI finished in 8th place, exactly the same position they finished next season too. Although OFI’s results were not wonderful, this group of fresh players had gained experience and started to play like a team. The one thing that was missing was a good coach, who could get the best out of each player. This man arrived the following season.\n\n===The Gerards years (1985–2000)===\n[[Eugène Gerards]] stayed in Crete as coach of OFI for a legendary 15 years. This is still the record tenure for a coach in the Greek League, and will be a feat that lives long in the memory of Cretans.  Gerards' first 3 years at the helm in Crete were nothing short of amazing. In 1985/86 OFI finished 2nd in the league and only missed out on becoming champions by 5 points. Gerards continued his revolution with a 3rd place finish in 1986/87 and 4th place in 1987/88. As Gerards' OFI continued to achieve high finishes in the Greek Championship the team from Crete did something wonderful 21 June 1987. In the Olympic Stadium in Athens they defeated [[Iraklis Thessaloniki F.C.|Iraklis]] 3–1 on penalties winning the Greek Cup. The game had finished 1–1 after regular and extra time. With string league position and victorious in the Cup OFI was at that time one of the major players in Greek football.\nThe 1987/88 season was special for Cretans for another reason too – it was the first time in league history that OFI finished in a higher position than Panathinaikos, beating them 2–1 in Heraklion on the way, with a goal in last minute from Stefanos Vavoulas.\nThis golden era also saw OFI participate in European competition – [[UEFA Cup]] 1986 and [[UEFA Cup Winners' Cup]] 1987. [[Image:Eigen Gerard.jpg|thumb|Eugène Gerards]]\nThe following seasons (1989/90, 1990/91, 1991/92) were not quite as spectacular as what had gone before. OFI finished 6th, 7th and 6th respectively, missing UEFA Cup qualification by a few points each year. In June 1990 OFI played once again in the final of the Greek Cup, this time against [[Olympiacos F.C.|Olympiacos]]. The game took place in Olympiacos' home stadium and OFI lost 4–2.\nIn June 1991 OFI played in the final of the Pre-[[1991 Mediterranean Games|Mediterranean]] Cup, against [[AEK Athens FC]].\nThe game took place in [[Georgios Kamaras Stadium]] and OFI lost 1–0. \nDuring the last of those 3 seasons, OFI brought a young Argentinian star to Crete – Victor Hugo Delgado. However, there was little time for Cretans to enjoy the benefits of his talent as he was soon transferred to [[Panathinaikos F.C.|Panathinaikos]]. \nIn the 1992/93 campaign OFI was in great form once again. OFI finished 4th in the Championship and qualified for the following season's UEFA Cup tournament. The season's great star for OFI was Nikos Nioplias. At the end of the previous season the Vardinogiannis family decided that he might become useful to Panathinaikos, so he became the 3rd player to move to Athens from OFI. Without the team's great star, OFI only managed a 7th place finish in the 1993/94 Championship. But despite those facts the name of OFI was heard loud and clear all around Europe. That season OFI achieved the unthinkable – they eliminated [[Slavia Prague]] in the 1st round of the [[UEFA Cup]] and [[Atlético Madrid]] in the 2nd round (both 2–1 on aggregate). Nobody in Europe could believe that an unknown quantity like OFI could ever knock out of Europe such illustrious opposition. The famous cup run came to an end when OFI was eliminated in the 3rd round by Portuguese club [[Boavista FC]] (Round of 16). Despite the disappointment there was pride for Cretans to be taken in that their team was the most successful Greek team in European competition that season. <!-- Unsourced image removed: [[Image:Ofi-atletico.jpg|thumb|OFI vs Atletico Madrid]] -->\nIn 1994/95, Panathinaikos were in dire need of a striker, and OFI had 2 top rated strikers from the previous season, Nikos Machlas and Alexis Alexoudis. Even though Panathinaikos wanted Machlas, he himself refused to go to Athens, and as a result, Panathinaikos grabbed Alexoudis. OFI ended in the 9th position this year. In the next season, Eugène Gerards tried to build a new team with young players. Yet the Dutchman had lost 2 great players to Panathinaikos and Nikos Machlas was transferred to Vitesse Arnhem. OFI finished 5th and missed qualification for the UEFA Cup in the last game of the season. \n\n1996/97 was an amazing season for “Omilos”. With the partipication of Nikos Nioplias (Panathinaikos did not need him anymore, so he was transferred back to OFI), OFI was on 2nd place before the winter break and 4 of their players were part of the Greek National Team.\nOn the last day of the transfer period, Panathinaikos grabbed Kostas Konstantinidis, the best defender of OFI’s squad. Finally OFI finished 3rd in the championship by humiliating Panathinaikos 1 week before the end and leaving the team from Athens in 5th place, outside the positions leading to UEFA competitions. The whole island of Crete was again celebrating the great performance of OFI. \n\nIn the next 2 seasons, OFI finished in 7th and 8th position respectively, suffering constant humiliations by Panathinaikos in matches between the two, as revenge for what happened in May 1997. In addition to that, [[Kostas Kiassos]], a great OFI midfielder, was the next 'victim' and was transferred to Panathinaikos. Nevertheless, OFI resumed their successful UEFA Cup campaigns. The pride of Crete eliminated Icelandic team [[Knattspyrnufélag Reykjavíkur|KR Reykjavik]] in the second qualifying round (3–1 on aggregate) and Hungarian team [[Ferencvárosi TC|Ferencváros]] in the 1st round proper,(4–2 on aggregate, with an unforgettable 3–0 victory in Crete). OFI’s European dream was ended by [[AJ Auxerre]] in the 2nd round of the UEFA Cup. \n\nIn the year 2000 and after 15 successful years, Eugène Gerards announced his retirement from OFI's bench as the team finished 4th in the championship. It was the last time that OFI gained a position that lead to European competitions, and the last season that OFI was considered one of the top teams in Greece.\n\n===The new era (2000–2009)===\nThe new century found OFI unstable and close to relegation almost every year. While Nioplias and Machlas retired, the team partly suffered from a series of bad rosters and managers. In 2001 OFI really struggled to remain to the 1st League. The next two years, OFI managed to play a little better, thus avoiding low positions easier. But then the dark years came: OFI avoided relegation every year, for one or two points difference.\n\nPresident Fanouris Vatsinas appointed German [[Reiner Maurer]] as a coach in the summer of 2006. Maurer had the team playing greater football, even competing for a European place since the Gerards era. In the 2007 summer, OFI played in the Intertoto cup, but under-performed. The 2007–08 season found the club fighting to avoid relegation once again, and Maurer was sacked. [[Giorgos Paraschos]] was brought as a temporary manager, and he was eventually replaced by Czech, [[František Straka]] before the start of the new season.\n\nIn 2009 OFI suffered from the bad presidency of Fanouris Vatsinas, who was asked by the fans to leave the club. Furthermore, former player Machlas offered a great amount of money in order to purchase the team. OFI started with awful results, Straka was dismissed and [[Ioannis Matzourakis]] came to fill his position. During the 2008–09 season, OFI struggled to remain to the Greek Super League, but failed and is in fact relegated to the second division after finishing 16th.\n\nSince relegation OFI has gone into 'meltdown'.\nOnce the season had ended the majority of the clubs senior players filed claims against club President Fanouris Vatsinas for hundreds of thousands of Euros in unpaid wages. As the non payment of wages was also a breach of contract many of them also freed themselves from their Professional contracts with the club and sought new teams for the forthcoming season.\n\nClub President Vatsinas resigned.\n\n== Current squad ==\n{{updated|4 March 2012}} <ref>{{cite web|url=http://www.superleaguegreece.net/team/112|title=OFI Crete squad|publisher=[[Superleague Greece]]|language=Greek|accessdate=5 March 2012}}</ref>\n\n{{Fs start}}\n{{Fs player | no=1  | nat= ARG | pos=MF | name= [[Ricardo Matias Verón|Ricardo Verón]]  }}\n{{Fs player | no=2  | nat= GRC | pos=DF | name= [[Aris Galanopoulos]]  }}\n{{Fs player | no=4  | nat= GRC | pos=DF | name= [[Efstathios Tavlaridis]] }}\n{{Fs player | no=7  | nat= GRC | pos=MF | name= [[Panagiotis Zorbas]]  }}\n{{Fs player | no=8  | nat= GRC | pos=DF | name= [[Minas Pitsos]]  }}\n{{Fs player | no=9  | nat= GRC | pos=FW | name= [[Vangelis Mantzios]]}}\n{{Fs player | no=10 | nat= FRA | pos=DF | name= [[Kendal Ucar]]}}\n{{Fs player | no=11 | nat= BRA | pos=DF | name= [[Vando Francisco Dos Santos|Vandinho]]}}\n{{Fs player | no=14 | nat= GRC | pos=FW | name= Niktaris Nikomanolis  }}\n{{Fs player | no=16 | nat= SER | pos=MF | name= [[Željko Kalajdžić]]  }}\n{{Fs player | no=17 | nat= GRC | pos=DF | name= Manolis Zacharakis  }}\n{{Fs player | no=18 | nat= GRC | pos=GK | name= [[Polychronis Vezyridis]]  }}\n{{Fs mid}}\n{{Fs player | no=19 | nat= GRC | pos=FW | name= [[Leonidas Kampantais]]  }}\n{{Fs player | no=20 | nat= HUN | pos=MF | name= [[Boldizsár Bodor]]  }}\n{{Fs player | no=22 | nat= GRC | pos=DF | name= [[Manolis Moniakis]]  }}\n{{Fs player | no=23 | nat= GRC | pos=DF | name= [[Georgios Georgiou]]  }}\n{{Fs player | no=24 | nat= BRA | pos=DF | name= [[Dennis Souza]]  }}\n{{Fs player | no=25 | nat= GRC | pos=FW | name= [[Fotios Papoulis]]  }}\n{{Fs player | no=28 | nat= GRC | pos=DF | name= [[Christos Bourbos]]  }}\n{{Fs player | no=32 | nat= SVN | pos=MF | name= [[Mirnes Šišić]]}}\n{{Fs player | no=35 | nat= GRC| pos=DF | name= Lazaros Charitonidis}}\n{{Fs player | no=77 | nat= ESP | pos=FW | name= [[Jorge López Montaña|Jorge López]]  }}\n{{Fs player | no=81 | nat= GRC | pos=GK | name= Filippos Sachsanidis  }}\n{{Fs player | no=88 | nat= ESP | pos=MF | name= [[Jordi López]]  }}\n{{Fs end}}\n\n==Club officials==\n===Board of Directors<ref name=\"Board of Directors\">{{cite web|url=http://www.ofi.gr/admin.aspx|publisher=OFI Crete |accessdate=31 August 2009|title=Board of Directors}}</ref>===\n*President: '''[[Nikos Machlas]]'''\n*Vice President: '''Manolis Papakaliatis'''\n*Director of Football: '''[[Nikos Machlas]]'''\n\n===Coaching & Medical Staff <ref name=\"Coaching and Medical Staff\">{{cite web|url=http://www.ofi.gr/technicalTeam.aspx|publisher=OFI Crete |accessdate=31 August 2009|title=Technical Team}}</ref>===\n*General Manager: '''[[Pavlos Adamos]]'''\n*Manager: '''[[Nikos Anastopoulos]]'''\n*Goalkeeping coach: '''[[Kostas Chaniotakis]]'''\n*Club Doctor: '''Giorgos Stafanoudakis'''\n*Club Doctor: '''Nikos Zervakis'''\n*Physiotherapist: '''Giorgos Vereroudakis'''\n*Physiotherapist: '''Kostas Pappas'''\n*Fitness coach: '''Dimitris Papyrakis'''\n*Conditioning coach: '''Leonidas Sakoutis'''\n*Chief scout: '''[[Eugène Gerards]]'''\n*Director of youth academy: '''[[Eugène Gerards]]'''\n\n== Notable players ==\n{{famous players}}\n{{col-begin-small}}\n{{col-3}}\n\n;Albania\n*{{flagicon|Albania}} [[Arjan Beqaj]]\n\n;Armenia\n*{{flagicon|Armenia}} [[Romik Khachatryan]]\n\n;Brazil\n*{{flagicon|Brazil}} [[Leozinho]]\n\n;Bulgaria\n*{{flagicon|Bulgaria}} [[Metodi Deyanov]]\n\n;Chile\n*{{flagicon|Chile}} [[Alejandro Hisis]]\n*{{flagicon|Chile}} [[Jaime Vera]]\n\n;Costa Rica\n*{{flagicon|Costa Rica}} [[Rónald Gómez]]\n*{{flagicon|Costa Rica}} [[Mauricio Solís]]\n\n;Croatia\n*{{flagicon|Croatia}} [[Rajko Janjanin]]\n*{{flagicon|Croatia}} [[Zdravko Popović]]\n\n;Cyprus\n*{{flagicon|Cyprus}} [[Nikos Papavasiliou]]\n*{{flagicon|Cyprus}} [[Marios Neophytou]]\n\n;Ghana\n*{{flagicon|Ghana}} [[Derek Boateng]]\n*{{flagicon|Ghana}} [[Peter Ofori-Quaye]]\n\n{{col-3}}\n;Greece\n*{{flagicon|Greece}} [[Pavlos Adamos]]\n*{{flagicon|Greece}} [[Alexis Alexoudis]]\n*{{flagicon|Greece}} [[Yannis Anastasiou]]\n*{{flagicon|Greece}} [[Kostas Chaniotakis]]\n*{{flagicon|Greece}} [[Tasos Dentsas]]\n*{{flagicon|Greece}} [[Kostas Frantzeskos]]\n*{{flagicon|Greece}} [[Nikos Goulis]]\n*{{flagicon|Greece}} [[Thanasis Kolitsidakis]]\n*{{flagicon|Greece}} [[Kostas Konstantinidis]]\n*{{flagicon|Greece}} [[Ilias Kotsios]]\n*{{flagicon|Greece}} [[Nikos Kounenakis]]\n*{{flagicon|Greece}} [[Nikos Machlas]]\n*{{flagicon|Greece}} [[Petros Marinakis]]\n*{{flagicon|Greece}} [[Nikos Nioplias]]\n*{{flagicon|Greece}} [[Manolis Patemtzis]]\n*{{flagicon|Greece}} [[Eleftherios Poupakis]]\n*{{flagicon|Greece}} [[Ilias Poursanidis]]\n*{{flagicon|Greece}} [[Michalis Sifakis]]\n*{{flagicon|Greece}} [[Giannis Taralidis]]\n*{{flagicon|Greece}} [[Alexandros Tzorvas]]\n*{{flagicon|Greece}} [[Ioannis Samaras]]\n*{{flagicon|Greece}} [[Georgios Samaras]]\n*{{flagicon|Greece}} [[Petros Vouzounerakis]]\n\n;Mali\n*{{flagicon|Mali}} [[Mahamadou Diarra]]\n\n;Netherlands\n*{{flagicon|the Netherlands}} [[Gaston Taument]]\n\n{{col-3}}\n;Poland\n*{{flagicon|Poland}} [[Igor Sypniewski]]\n*{{flagicon|Poland}} [[Arkadiusz Malarz]]\n\n;Romania\n*{{flagicon|Romania}} [[Anghel Iordănescu]]\n*{{flagicon|Romania}} [[Cosmin Bărcăuan]]\n*{{flagicon|Romania}} [[Dănuţ Lupu]]\n\n;Senegal\n*{{flagicon|Senegal}} [[Dame N'Doye]]\n\n;Serbia\n*{{flagicon|Serbia}} [[Goran Drulić]]\n*{{flagicon|Serbia}} [[Aleksandar Simić (footballer)|Aleksandar Simić]]\n\n;Singapore\n*{{flagicon|Singapore}} [[Fandi Ahmad]]\n\n;South Africa\n*{{flagicon|South Africa}} [[Pierre Issa]]\n\n;Wales\n*{{flagicon|Wales}} [[John Banwell]]\n\n;Canada\n*{{flagicon|Canada}} [[Chris Dixon]]\n\n;Togo\n*{{flagicon|Togo}} [[Eric Akoto]]\n\n{{col-end}}\n\n==All the European games==\n{| class=\"wikitable\" style=\"text-align: left; font-size:100%\"\n|- bgcolor=\"#ccccff\"\n! Season\n! Competition\n! Round\n! Club\n! Home \n! Away \n! \n|-\n|'''[[1986–87 UEFA Cup|1986–87]]\n|[[UEFA Cup]]\n|1st Round\n|{{flagicon|SFR Yugoslavia}} [[HNK Hajduk Split|Hajduk Split]]\n|align=\"center\"|'''1–0\n|align=\"center\"|'''0–4\n|align=\"center\"|[[File:Symbol delete vote.svg|17px]]\n|-\n|colspan=1 style=\"text-align: center;\" bgcolor=white|\n|-\n|rowspan=2|'''[[1987–88 European Cup Winners' Cup|1987–88]]'''\n|rowspan=2|[[Cup Winners' Cup]]\n|style=\"background-color:#CFC\"|1st Round\n|style=\"background-color:#CFC\"|{{flagicon|Bulgaria|1946}} [[Vitosha Sofia]]\n|style=\"background-color:#CFC\" align=\"center\"|'''3–1\n|style=\"background-color:#CFC\" align=\"center\"|'''0–1\n|style=\"background-color:#CFC\" align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|2nd Round\n|{{flagicon|Italy}} [[Atalanta B.C.|Atalanta]]\n|align=\"center\"|'''1–0\n|align=\"center\"|'''0–2\n|align=\"center\"|[[File:Symbol delete vote.svg|17px]]\n|-\n|colspan=1 style=\"text-align: center;\" bgcolor=white|\n|-\n|rowspan=3|'''[[1993–94 UEFA Cup|1993–94]]'''\n|rowspan=3|[[UEFA Cup]]\n|style=\"background-color:#CFC\"|1st Round\n|style=\"background-color:#CFC\"|{{flagicon|Czech Republic}} [[Slavia Prague]]\n|style=\"background-color:#CFC\" align=\"center\"|'''1–0\n|style=\"background-color:#CFC\" align=\"center\"|'''1–1\n|style=\"background-color:#CFC\" align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|style=\"background-color:#CFC\"|2nd Round\n|style=\"background-color:#CFC\"|{{flagicon|Spain}} [[Atlético Madrid]]\n|style=\"background-color:#CFC\" align=\"center\"|'''2–0\n|style=\"background-color:#CFC\" align=\"center\"|'''0–1\n|style=\"background-color:#CFC\" align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|3rd Round\n|{{flagicon|Portugal}} [[Boavista F.C.|Boavista]]\n|align=\"center\"|'''1–4\n|align=\"center\"|'''0–2\n|align=\"center\"|[[File:Symbol delete vote.svg|17px]]\n|-\n|colspan=1 style=\"text-align: center;\" bgcolor=white|\n|-\n|rowspan=5|'''[[1995 UEFA Intertoto Cup|1995–96]]\n|rowspan=5|[[UEFA Intertoto Cup|Intertoto Cup]]\n|style=\"background-color:#CFC\" rowspan=4|Group Stage <br>(Group 7)\n|style=\"background-color:#CFC\"|{{flagicon|Cyprus}} [[Nea Salamis Famagusta FC|Nea Salamina]]\n|style=\"background-color:#CFC\" align=\"center\"|'''2–1\n|style=\"background-color:#CFC\"|\n|style=\"background-color:#CFC\" rowspan=4 align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|style=\"background-color:#CFC\"|{{flagicon|Germany}} [[Bayer 04 Leverkusen|Bayer Leverkusen]]\n|style=\"background-color:#CFC\"|\n|style=\"background-color:#CFC\" align=\"center\"|'''0–1\n|-\n|style=\"background-color:#CFC\"|{{flagicon|Estonia}} [[JK Tervis Pärnu|Tervis Pärnu]]\n|style=\"background-color:#CFC\" align=\"center\"|'''2–0\n|style=\"background-color:#CFC\"|\n|-\n|style=\"background-color:#CFC\"|{{flagicon|Serbia and Montenegro}} [[FK Budućnost Podgorica|Budućnost]]\n|style=\"background-color:#CFC\"|\n|style=\"background-color:#CFC\" align=\"center\"|'''4–3\n|-\n|2nd Round\n|{{flagicon|Turkey}} [[Bursaspor]]\n|\n|align=\"center\"|'''1–2\n|[[File:Symbol delete vote.svg|17px]]\n|-\n|colspan=1 style=\"text-align: center;\" bgcolor=white|\n|-\n|rowspan=3|'''[[1997–98 UEFA Cup|1997–98]]'''\n|rowspan=3|[[UEFA Cup]]\n|style=\"background-color:#CFC\"|2nd Qual. Round\n|style=\"background-color:#CFC\"|{{flagicon|Iceland}} [[Knattspyrnufélag Reykjavíkur|KR Reykjavík]]\n|style=\"background-color:#CFC\" align=\"center\"|'''3–1\n|style=\"background-color:#CFC\" align=\"center\"|'''0–0\n|style=\"background-color:#CFC\" align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|style=\"background-color:#CFC\"|1st Round\n|style=\"background-color:#CFC\"|{{flagicon|Hungary|civil}} [[Ferencvárosi TC|Ferencváros]]\n|style=\"background-color:#CFC\" align=\"center\"|'''3–0\n|style=\"background-color:#CFC\" align=\"center\"|'''1–2\n|style=\"background-color:#CFC\" align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|2nd Round\n|{{flagicon|France}} [[AJ Auxerre|Auxerre]]\n|align=\"center\"|'''3–2\n|align=\"center\"|'''1–3\n|align=\"center\"|[[File:Symbol delete vote.svg|17px]]\n|-\n|colspan=1 style=\"text-align: center;\" bgcolor=white|\n|-\n|rowspan=2|'''[[2000–01 UEFA Cup|2000–01]]'''\n|rowspan=2|[[UEFA Cup]]\n|style=\"background-color:#CFC\"|1st Round\n|style=\"background-color:#CFC\"|{{flagicon|Serbia and Montenegro}} [[FK Napredak Kruševac|Napredak]]\n|style=\"background-color:#CFC\" align=\"center\"|'''6–0\n|style=\"background-color:#CFC\" align=\"center\"|'''0–0\n|style=\"background-color:#CFC\" align=\"center\"|[[File:Symbol keep vote.svg|17px]]\n|-\n|2nd Round\n|{{flagicon|Czech Republic}} [[Slavia Prague]]\n|align=\"center\"|'''2–2\n|align=\"center\"|'''1–4\n|[[File:Symbol delete vote.svg|17px]]\n|-\n|colspan=1 style=\"text-align: center;\" bgcolor=white|\n|-\n|'''[[2007 UEFA Intertoto Cup|2007–08]]\n|[[UEFA Intertoto Cup|Intertoto Cup]]\n|3rd Round\n|{{flagicon|Kazakhstan}} [[FC Tobol|Tobol]]\n|align=\"center\"|'''0–1\n|align=\"center\"|'''0–1 \n|[[File:Symbol delete vote.svg|17px]]\n|-\n|}\n\n==Managerial history==\n{|\n|- style=\"vertical-align: top;\"\n|\n*{{flagicon|Greece}} Stratos (1946)\n*{{flagicon|Greece}} [[Kostas Zogas]] (1958)\n*{{flagicon|Greece}} [[Mantalopoulos]] (1959)\n*{{flagicon|Greece}} [[Vaggelis Helmis]] (1965–66)\n*{{flagicon|Greece}} [[Petritsis]] (1967–68)\n*{{flagicon|Greece}} [[Kostas Zogas]] (1967–68) \n*{{flagicon|Serbia}} [[Kapetanovic]] (1968–71)\n*{{flagicon|Greece}} [[Giorgos Stratakis]] (1970–71)\n*{{flagicon|Greece}} [[Thanasis Soulis]] (1971–72)\n*{{flagicon|Greece}} [[Giorgos Stratakis]] (1971–72)\n*{{flagicon|Greece}} [[Takis Papartheniou]] (1972–73)\n*{{flagicon|Greece}} [[Kostas Karapatis]] & {{flagicon|Greece}} [[Manolis Tzanis]] (1973–74)\n*{{flagicon|Greece}} [[Thanasis Zafeiropoulos]] (1975–76)\n*{{flagicon|Greece}} [[Nikos Alefantos]] (1976–77)\n|\n|\n*{{flagicon|Greece}} [[Antonis Georgiadis]] (1978–80)\n*{{flagicon|England}} [[Les Shannon]] (1979–80)\n*{{flagicon|Greece}} [[Nikos Alefantos]] (1981–82)\n*{{flagicon|Greece}} [[Giorgos Stratakis]] (1981–82)\n*{{flagicon|England}} [[Les Shannon]] (1982–84)\n*{{flagicon|Greece}} [[Manolis Tzanis]] & {{flagicon|Greece}} [[Aris Vasileiou]] (1984)\n*{{flagicon|Greece}} [[Lakis Petropoulos]] (1984–85)\n*{{flagicon|Greece}} [[Giannis Parasidis]] (1984–85)\n*{{flagicon|Czech Republic}} [[Petr Packert]] (1984–85)\n*{{flagicon|England}} [[Mike Bailey]] (1984–85)\n*{{flagicon|Netherlands}} [[Eugène Gerards]] (1985-00)\n*{{flagicon|Greece}} [[Aris Vasileiou]] (2000) \n*{{flagicon|Greece}} [[Giannis Samaras]] (2000–02)\n*{{flagicon|Czech Republic}} [[Zdeněk Ščasný]] (2002–03)\n|\n||\n*{{flagicon|Greece}} [[Giorgos Foiros]] (2003–04)\n*{{flagicon|Greece}} [[Giannis Hatzinikolaou]] (2004–05)\n*{{flagicon|Greece}} [[Vaggelis Blaxos]] (2005–06)\n*{{flagicon|Greece}} [[Myron Sifakis]] (2006)\n*{{flagicon|Germany}} [[Reiner Maurer]] (2006–07)\n*{{flagicon|Greece}} [[Giorgos Paraschos]] (2007–08)\n*{{flagicon|Czech Republic}} [[František Straka]] (2008)\n*{{flagicon|Greece}} [[Ioannis Matzourakis]] (2008–09)\n*{{flagicon|Cyprus}} [[Nicos Papavasiliou]] & {{flagicon|Greece}} [[Myron Sifakis]] (2009)\n*{{flagicon|Greece}} [[Nikos Goulis]] (2009)\n*{{flagicon|Greece}} [[Giorgos Paraschos]] (2010)\n*{{flagicon|Greece}} [[Giannis Chatzinikolaou]] (2010)\n*{{flagicon|Greece}} [[Nikos Anastopoulos]] (2010–present)\n|}\n\n==Statistics==\n===Most appearances===\n\n{| class=\"wikitable\"\n! width=175|Player\n! width=45|Matches\n|-\n||{{flagicon|Greece}} [[Nikos Nioplias]]||416\n|-\n||{{flagicon|Greece}} Petros Marinakis||258\n|-\n||{{flagicon|Greece}} Kostas Chaniotakis||255\n|-\n||{{flagicon|Greece}} Manolis Patemtzis||250\n|-\n||{{flagicon|Greece}} Nikos Goulis||249\n|}\n\n==Honours==\n*'''[[UEFA Intertoto Cup]] Runner-up: 1'''\n** [[UEFA Intertoto Cup 2007|2007]]\n*'''[[Balkans Cup]]'''\n**1988/89\n*'''[[File:Trophy(transp).png|15px]] [[Greek Cup]]'''\n** [[Greek Football Cup|1987 (Winner)]]\n** [[Greek Football Cup|1990 (Runner-up)]]\n*'''[[1991 Mediterranean Games|Pre-Mediterranean Cup]]'''\n**1991 (Runner-up)\n\n==References==\n{{Reflist}}\n\n==External links==\nOfficial Websites\n* [http://www.ofi.gr OFI Crete FC official website]\n* [http://www.goal4replay.net/VideoSelection.asp?Ln=En&ID=157 OFI TV channel from Goal4Replay.net] {{en icon}} {{gr icon}}\nStadia\n* [http://www.stadia.gr/ofi/ofi.html OFI Crete ground, Theodoros Vardinogiannis (Genti Koule) stadium]\n* [http://www.stadia.gr/pankritio/pankritio.html OFI Crete former ground, Pankritio Stadium]\n\n{{Superleague Greece teamlist}}\n{{Football in Greece|nested=yes}}\n\n{{DEFAULTSORT:Ofi Crete}}\n[[Category:Association football clubs established in 1925]]\n[[Category:OFI Crete| ]]\n[[Category:Sport in Crete]]\n[[Category:Heraklion]]\n[[Category:OFI Crete players]]\n\n[[bg:ОФИ Крит]]\n[[ca:OFI Creta]]\n[[cs:OFI Kréta]]\n[[da:OFI Kreta]]\n[[de:OFI Kreta]]\n[[el:Όμιλος Φιλάθλων Ηρακλείου]]\n[[es:OFI Creta]]\n[[fr:OFI Crète]]\n[[it:Omilos Filathlon Irakleiou]]\n[[lt:PAE OFĪ]]\n[[nl:OFI Kreta]]\n[[pl:OF Irakleiou]]\n[[pt:OFI Creta]]\n[[ro:OFI Creta]]\n[[ru:ОФИ (футбольный клуб)]]\n[[fi:OFI Kreeta]]\n[[uk:ОФІ (футбольний клуб)]]\n[[zh:克里特OFI]]"}]}}}