{"pages": {"986140": {"pageid": 986140, "ns": 4, "title": "Wikipedia:Village pump (policy)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "diff": {"from": 484034626, "to": 484035565, "*": "<tr>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 133:</td>\n  <td colspan=\"2\" class=\"diff-lineno\">Line 133:</td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>:Because of the chilling effect, I don't see it happening, even if it were to be a source of revenue. It seems we pretty much have to rely on [[karma|karmic justice]]. [[User:LeadSongDog|LeadSongDog]] &lt;small&gt;[[User talk:LeadSongDog#top|&lt;font color=\"red\" face=\"Papyrus\"&gt;come howl!&lt;/font&gt;]]&lt;/small&gt; 16:40, 26 March 2012 (UTC)</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>:Because of the chilling effect, I don't see it happening, even if it were to be a source of revenue. It seems we pretty much have to rely on [[karma|karmic justice]]. [[User:LeadSongDog|LeadSongDog]] &lt;small&gt;[[User talk:LeadSongDog#top|&lt;font color=\"red\" face=\"Papyrus\"&gt;come howl!&lt;/font&gt;]]&lt;/small&gt; 16:40, 26 March 2012 (UTC)</div></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"></td>\n</tr>\n<tr>\n  <td colspan=\"2\" class=\"diff-empty\">&#160;</td>\n  <td class=\"diff-marker\">+</td>\n  <td class=\"diff-addedline\"><div>::You asked \"What are we going to sue them for?\". Well, can't WMF sue them for breaking policy and \"MISUSE OF WIKIPEDIA\".--[[User:WOLfan112|&lt;font color=\"gold\"&gt;User&lt;/font&gt;&lt;font color=\"green\"&gt;WOLfan112&lt;/font&gt;]] [[User talk:WOLfan112|&lt;font color=\"blue\"&gt;Talk&lt;/font&gt;]] 16:46, 26 March 2012 (UTC)</div></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"></td>\n</tr>\n<tr>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>== SPI fishing question ==</div></td>\n  <td class=\"diff-marker\">&#160;</td>\n  <td class=\"diff-context\"><div>== SPI fishing question ==</div></td>\n</tr>\n"}, "*": "<noinclude>{{village pump page header|Policy|alpha=yes|start=85|The '''policy''' section of the village pump is used to discuss proposed policies and guidelines and changes to existing policies and guidelines.<br>If you want to propose something new that is ''not'' a policy or guideline, use the ''[[WP:VPR|proposals]]'' section.<br>  If you have a question about how to apply an existing policy or guideline, try the one of the many [[Wikipedia:Noticeboards]].\nPlease see '''[[WP:PEREN|this FAQ page]]''' for a list of frequent proposals and the responses to them.\n|WP:VPP}}__NEWSECTIONLINK__\n\n[[ar:ويكيبيديا:الميدان/سياسات]]\n[[as:ৱিকিপিডিয়া:ৰাইজৰ চ'ৰা (নীতি)]]\n[[es:Wikipedia:Café/Portal/Archivo/Políticas/Actual]]\n[[eu:Wikipedia:Txokoa/Politikak]]\n[[fa:ویکی‌پدیا:قهوه‌خانه/سیاست]]\n[[ko:위키백과:사랑방 (정책)]]\n[[kk:Уикипедия:Ауыл құдығы/ережелер]]\n[[hu:Wikipédia:Kocsmafal (jogi)]]\n[[si:Wikipedia:Village pump (policy)]]\n[[fi:Wikipedia:Kahvihuone (käytännöt)]]\n[[ru:Википедия:Форум/Правила]]\n[[th:วิกิพีเดีย:สภากาแฟ (โครงการวิกิพีเดีย)]]\n[[zh-yue:Wikipedia:城市論壇 (政策)]]\n[[zh:Wikipedia:互助客栈/方针]]\n{{cent}}\n__TOC__\n<span id=\"below_toc\"/>\n[[Category:Wikipedia noticeboards|{{PAGENAME}}]]\n[[Category:Non-talk pages that are automatically signed]]\n[[Category:Pages automatically checked for accidental language links]]\n</noinclude><!--\n\n-->{{User:MiszaBot/config\n|archiveheader = {{Wikipedia:Village pump/Archive header}}\n|maxarchivesize = 400K\n|counter = 94\n|algo = old(5d)\n|archive = Wikipedia:Village pump (policy)/Archive %(counter)d\n}}<!--\n\n-->\n\n== Readership spikes - monitoring, etc ==\n\nFor various reasons, some more obvious than others and some more geographically specific than others, Wikipedia articles enjoy 'spikes' in readership. Take the example of Randy Baumgardner (see [http://stats.grok.se/en/latest/Randy_Baumgardner])  or Uganda (see [http://stats.grok.se/en/latest/Uganda])  or Lionel Messi (see [http://stats.grok.se/en/latest/Lionel_Messi]). \n\nAre these statistics monitored or checked by the higher-ups in the Wikimedia world? Or by anyone here within the Wikipedia community? Is there anything we can take from the statistics by way of analysing social media behaviour or internet use that could be fed back into making Wikipedia better, broader, more responsive? \n\nA general question, but an interesting one I hope ! [[User:Doktorbuk|doktorb]] <sub>[[User talk:Doktorbuk|words]]</sub><sup>[[Special:Contributions/Doktorbuk|deeds]]</sup> 16:38, 15 March 2012 (UTC)\n\n:In practice any event that causes a large number of people to view an article will attract at least a few editors.©[[User:Geni|Geni]] 11:44, 17 March 2012 (UTC)\n\n:[[User:West.andrew.g]] (a researcher at the University of Pennsylvania) used to monitor these systematically, or maybe still does. See [[Wikipedia:Wikipedia_Signpost/2010-11-15/News_and_notes#Briefly|this Signpost story]] (including the discovery of what was likely a DDOS attack that went unnoticed at the time it occurred).\n:The [https://twitter.com/#!/WikipediaTrends WikipediaTrends] feed on Twitter was tracking page view surges, but it stopped updating recently because the underlying [https://toolserver.org/~johang/wikitrends/english-uptrends-today.html Toolserver tool] is broken.\n:At Wikimania 2008, there was a talk about the topic (\"[http://web.archive.org/web/20090414131229/http://www.kaltura.com/devwiki/index.php/World_events_according_to_Wikipedia_statistics World events according to Wikipedia statistics]\"). And recently there has been quite a bit of research about editing activity caused be breaking news in general (not specifically focusing on page view spikes), see for example [[m:Research:Newsletter/2012-02-27#High-tempo_contributions:_Who_edits_breaking_news_articles.3F|here]]. Regards, [[User:HaeB|HaeB]] ([[User talk:HaeB|talk]]) 13:08, 18 March 2012 (UTC)\n\n:Uganda's spike is very likely because of [[Kony 2012]]. <font color=\"silver\">[[User:Silver seren|Silver]]</font><font color=\"blue\">[[User talk:Silver seren|seren]]</font><sup>[[Special:Contributions/Silver seren|C]]</sup> 23:33, 23 March 2012 (UTC)\n\n== A clear process for determination of consensus ==\n\nSometimes, the determination as to whether consensus has been reached on a certain topic can be botched, either intentionally or unintentionally. Therefore, I believe that the time is ripe for a way to clearly determine consensus. More information can be found in my essay on the topic at [[Wikipedia:Consensus defined]]. [[User:Wer900|Wer900]] ([[User talk:Wer900|talk]]) 18:46, 18 March 2012 (UTC)\n::Your proposal amounts to effectively a vote count as long as they make some token gesture at providing reasoning. [[User:IRWolfie-|IRWolfie-]] ([[User talk:IRWolfie-|talk]]) 19:14, 18 March 2012 (UTC)\n:::There has to be a vigorous debate on a topic, and this requires a large spectrum of ideas. Plus, there has to be a large amount of participation for consensus. This is far from merely a votecount, as it requires an in-depth analysis. Admittedly, the large margin provision does have a votecount-style construction, but this is not an absolute percentage and merely a system for determining what level of support constitutes consensus. Furthermore, other criteria not at all dependent on the level of support such as those listed previously are also involved.<p>At worst, the system at least ensures that consensus is determined in a systematic, rather than arbitrary, way. [[User:Wer900|Wer900]] ([[User talk:Wer900|talk]]) 22:41, 18 March 2012 (UTC)\n\n:Anyone who reads the pillar [[Wikipedia:Consensus]] is bound to scratch their head in wonder at the hand waving and magical thinking going on there. As long as the project is operated by an \"Objectivist to the core\", you're going to see magical thinking instead of an honest admission that Administrators are appointed judges who wield enormous power. You can put adjectives like \"benevolent\" in front of \"dictator\", but dictator is the operative word, and benevolence is in the eye of the beholder. It's fine to write reams of advice on how good Admins should make decisions, and I'd be the first to hope that Admins follow good advice and best practices, but in the end they get to do as the please. The saving grace is that their decisions can be appealed, though only to other Admins, who also get to do as they please.<P>Rather than try to obscure the facts about how decisions are made at Wikipedia with a lot of window dressing, it would be better to admit that it's a flawed system that has, so far, happened to have worked pretty well. The system is bound to break down if it ever faces serious stress or an organized effort to subvert it, and then it will be back to the drawing board. Until then, just blithely smile, try not to worry, and edit away. --[[User:Dennis Bratland|Dennis Bratland]] ([[User talk:Dennis Bratland|talk]]) 19:58, 18 March 2012 (UTC)\n::My goal is not gold-plating of a bad system, merely improving the system at its core so that consensus can be determined by a clear process, not by the hand-waving that you yourself pointed out. Other than that, I am in agreement with you - and therefore I propose this policy to make administrators accountable to something, however imperfect that system may be. [[User:Wer900|Wer900]] ([[User talk:Wer900|talk]]) 22:45, 18 March 2012 (UTC)\n\n: First of all, there is some potential for, er, paradox... You write: \"''The first of these criteria should be to check if there has been a vigorous debate on the subject wherein a large range of points of view have been presented, ranging from absolute support to absolute negation, and where a large number of editors have participated in the debate and provided their opinion.''\". In such case, if everyone holds the same position, there is no consensus by this definition. But that is exactly what consensus (in its purest form) actually is. I'd say that something in your essay has to be revised...<p>A second point is that in most cases consensus ''does'' work. However, those cases are hard to see, because there is little debate, for everyone agrees. That, for example, happens when someone makes a good edit to an article and no one objects. I guess you have tried to create a process that would deal with \"hard cases\", but, well, there is a saying \"[[hard cases make bad law]]\"... You should consider \"easy cases\" as well... --[[User:Martynas Patasius|Martynas Patasius]] ([[User talk:Martynas Patasius|talk]]) 01:08, 19 March 2012 (UTC)\n:: Okay, I will revise my essay to include a near-unanimity exception to the first criterion. [[User:Wer900|Wer900]] ([[User talk:Wer900|talk]]) 01:18, 19 March 2012 (UTC)\n\n::: Actually, I would recommend choosing a somewhat-representative sample (\"[[training set]]\") first... Look for cases when consensus was (or was not) found and write down the \"correct\" decision (what the consensus really was - in your opinion). Write detailed explanations. Then look for patterns. Then take a different sample and try to apply the \"laws\" you \"extracted\". Check if the result is reasonable. Then (especially if you won't try to keep the results secret) it will be much easier to write an essay. Hopefully, it will also help to persuade everyone that it is a good one... Or not (if they will disagree with those \"correct\" decisions)... Still, at least that is a honest way to do it... --[[User:Martynas Patasius|Martynas Patasius]] ([[User talk:Martynas Patasius|talk]]) 01:59, 19 March 2012 (UTC)\n::::While I would love a better way to judge consensus, the more I do closes, the more convinced I become that you can not write a book on how to do this.  Even a close today was unpredictable.  But no matter how odd, it was likely correct.  The problem with listing these is that it can create the impression that these are the correct solutions to all problems and that is a completely false assumption. [[User:Vegaswikian|Vegaswikian]] ([[User talk:Vegaswikian|talk]]) 02:05, 19 March 2012 (UTC)\n:::::I'm not making a statement directly about you, but there is no systematic way of determining consensus. The current way is not only unofficial, there is no document or set of documents that stipulates how it should be done. You state that this is a good thing, but it leads to a lack of transparency, premature or overdue closes of topics, and ultimately, an extremely conservative method of running the encyclopedia where there is no dynamism where there should be.<p> Also, the current process lacks any degree of transparency - an admin can just make the judgement call for no reason at all. Although I am not denying that my idea is imperfect, it is by far better than using magical thinking and handwaving to determine consensus out of the blue.  <small><span class=\"autosigned\">— Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Wer900|Wer900]] ([[User talk:Wer900|talk]] • [[Special:Contributions/Wer900|contribs]]) 22:12, 19 March 2012 (UTC)</span></small><!-- Template:Unsigned --> <!--Autosigned by SineBot-->\n\n:::::: Sorry, but are you sure all those mentions of \"''magical thinking and handwaving''\" really help your case..? Calm down. Yes, it is almost certain that your proposal will not be implemented at this time. That happens. I guess that is close to something you meant by \"''an extremely conservative method of running the encyclopedia where there is no dynamism where there should be''\", isn't it? Well, yes, majority of \"major\" proposals are rejected (and I happen to think that this is a good thing, although you are free to disagree).\n:::::: So, I am going to repeat my advise: make a \"training set\" and look for patterns. Yes, I doubt that it will result in anything significantly better than the current system, but who knows..? Or maybe the results of this \"investigation\" (and this discussion, and your essay) will inspire someone else to come up with a good idea? Or maybe you will think of some small improvement? Let's say, some \"process\" for closing AfD discussions - something like 1) check if the discussion is serious (if it is not First of April), 2) have a short look at the article, its history, talk page and AfD discussion, 3) check if no criteria for speedy deletion applies, 4) check if discussion wasn't unanimous, 5) make a list of policies, guidelines and essays that apply, 6) make a list of participants, 7) make a list of arguments, 8) check how those arguments were received by other participants, 9) have a look at the sources given (if any), etc... You know, small changes are more likely to be adopted... --[[User:Martynas Patasius|Martynas Patasius]] ([[User talk:Martynas Patasius|talk]]) 23:21, 19 March 2012 (UTC)\n\n:::::::It is an illusion that consensus works works in most cases. Typically, those with the most motivation go on fighting until their opposition grows sick of the endless debate and wearily and wanders off to do something more productive with their time. Or sticks around but says they'll give in because they don't think it's worth it to stay deadlocked forever. So those left behind might agree with each other, but that's only because they've driven off or discouraged dissenters with an excruciating and interminable process. If only there were a correlation between correctness and endurance; ''then'' it would be an ideal system. --[[User:Dennis Bratland|Dennis Bratland]] ([[User talk:Dennis Bratland|talk]]) 22:45, 20 March 2012 (UTC) \n:::::::::Now that you mention it, I think that it is usually a failure on contentious cases. <font color =\"#0000cc\">''North8000''</font> ([[User talk:North8000#top|talk]]) 00:10, 21 March 2012 (UTC)\n::::::::::Dennis, I don't think that your first sentence is correct.  Perhaps you meant to say \"most ''contentious'' cases\", or something like that.  \"Most cases\" includes the 99% of cases that nobody thinks twice about:  e.g., you fix a spelling error, and everyone else silently agrees that it was a good thing.  That's consensus in its simplest and purest form.  [[User:WhatamIdoing|WhatamIdoing]] ([[User talk:WhatamIdoing|talk]]) 00:33, 21 March 2012 (UTC)\n:::::::::::I am not trying to make this rule apply to those cases - there is already a precedent for when the process of consensus should or should not be used. My intent is only to make it apply where the handwaving process was previously, not in cases of silent consensus.<p>And I ''will'' make a training set, once I get the time.<s>[[Special:Contributions/98.234.114.234|98.234.114.234]] ([[User talk:98.234.114.234|talk]]) 03:54, 22 March 2012 (UTC)</s> <small>Whoops, I was not logged in...</small> [[User:Wer900|<span style=\"color:red\">Wer900</span>]] <sup>[[User talk:Wer900|talk]]</sup><sub>[[Wikipedia:Consensus defined|essay on the definition of consensus]]</sub> 04:01, 22 March 2012 (UTC)\n::::::::::::My point is that those cases ''do'' use \"the process of consensus\".  That's the whole point behind [[Wikipedia:Consensus#Reaching_consensus_through_editing|the first major section of the Consensus policy]].  [[User:WhatamIdoing|WhatamIdoing]] ([[User talk:WhatamIdoing|talk]]) 01:10, 24 March 2012 (UTC)\n:::::::::::::When I mean \"the process of consensus,\" I am describing any case where there would be cause for a discussion and a determination of consensus besides merely silent agreement. Something like AfD. [[User:Wer900|<span style=\"color:red\">Wer900</span>]] <sup>[[User talk:Wer900|talk]]</sup><sub>[[Wikipedia:Consensus defined|essay on the definition of consensus]]</sub> 04:25, 24 March 2012 (UTC)\n\nMost of the time the current process works as a way to navigate the range of complexities and considerations that is inevitable in Wikipedia, and avoid the pitfalls and gamability of trying to use voting-based systems in our environment.  But in some cases the consensuses process itself is game-able, particularly when the wrongdoers are wiki-saavy.   Especially via. compounding it with other considerations.  For example, one common maneuver is to claim that the opposite view requires a consensus to prevail, whereas going with the perpetrator's view does not. (status quo) Another weak spot is that it basically ends up with one person (the closer) making the decision, which is about the weakest of all possible systems.    <font color =\"#0000cc\">''North8000''</font> ([[User talk:North8000#top|talk]]) 12:13, 19 March 2012 (UTC)\n\n== Simplifying the service of knowledge ==\n\nWe live in a new paradigm of civilization: Twitter, Facebook or Orkut, e-mail. Information travels faster and ever so lean. Several authors point to this. Just remember when certain philosopher speaks of newspaper reports that do not last long. Minute by minute (actually less than that) they are replaced by others - sometimes the very opposite direction. So ... The complexity is gaining ground in the world media, the superimposition of information and, paradoxically, the simplification of this process is the lever. Say as much in less time, to a lesser compatimento, stick to a lesser ... For the time is still money.\nAnyway ... Wikipedia could be tuned to this process. Several issues could be placed on top of that. One is the systematic exclusion of pages created. Could set up a rating system clearer, more explicit, indicating those pages more reliable of the least reliable. However, this system of exclusion, in my opinion, goes against the evolution of Wikipedia.\nAnother thing that has \"fallen\" were rigid paternalistic rules that govern the world. In this sense I see this \"hierarchy\", as was the bureaucracy for businesses, a delay of life. You write something with capital letters and a truly well meaning Wikipedian says capitalized words are like a cry in the Internet. This goes against the uniqueness of people, against their own individuality and mode of production. This authoritarian attitude is, however, own a civilized society, capitalist and interested in the standardization of the actions, thoughts and feelings, making them susceptible to manipulation. If you want to differentiate and say \"this is good, this is bad\", and just think is valid, provided that it is aware that this is an ideological imposition of what is good or bad, elitism and idealism, which I think which, unfortunately, to be necessary. After all I am in favor of idealization. The solution then, for me, is not to exclude, keep the most of all productions. On the other hand continues to tax, categorize, say what is good or bad, after all we are all entitled to it, and I think that Wikipedia too. However it should be repeitar differences.\nIt is an encyclopaedia, not a democracy will mean ... But times have changed and I suppose that even the encyclopedias resist it.\nAnd you, what do you think about adapting to new times of Wikipedia? <small><span class=\"autosigned\">— Preceding [[Wikipedia:Signatures|unsigned]] comment added by [[User:Arthus Kauã Fendeler Höelz|Arthus Kauã Fendeler Höelz]] ([[User talk:Arthus Kauã Fendeler Höelz|talk]] • [[Special:Contributions/Arthus Kauã Fendeler Höelz|contribs]]) 16:34, 19 March 2012 (UTC)</span></small><!-- Template:Unsigned -->\n:Let me get this straight. Your proposal seems to wish to abolish much, if not all, of the restrictions in place on Wikipedia in order to keep up to the pace of a modern, rapidly-changing world. However, Wikipedia needs to stand as a bastion of quality and '''''historical distance''''' in order to present its contents in a neutral fashion. There has to be a professional code of conduct of some sort on Wikipedia in order to ensure that this remains an encylcopedia, not a blog of the world's daily ebbs and flows.<p> Furthermore, you propose nothing concrete which we must implement, rather you merely rail against what you perceive as a form of elitism on Wikipedia. I do agree that Wikipedia's coverage in some places can be spotty, but the reason for that is lack of shape which Wikipedia has in that the majority of its articles are scattered and unsourced stubs. We do not need to make Wikipedia a more amorphous blob than it already is. [[User:Wer900|Wer900]] ([[User talk:Wer900|talk]]) 21:56, 19 March 2012 (UTC)\n:Tax? Capitalism? Elitism? Err, in Internet-ese, I think the term is ''lolwut?'' —[[User:Tom Morris|Tom Morris]] ([[User talk:Tom Morris|talk]]) 17:31, 21 March 2012 (UTC)\n::for an encyclopedia, \"quick\" is a feature of vague importance. but \"accuracy\" and \"thoroughness\" are of great importance - and they seldom coincide with \"quick\". when organizations let quality take  backseat to [[2009–2011 Toyota vehicle recalls|quantity or speed]], bad things happen to them, particularly [[This_american_life#2010s|when you dont verify your sources]]. -- [[User talk:TheRedPenOfDoom|<span style=\"color:red;font-size:small;;font-family:Monotype Corsiva;\">The Red Pen of Doom</span>]] 00:41, 24 March 2012 (UTC)\n\n== Process for undoing copyright-related deletions ==\n\nSorry for bringing this up here; it's really not an issue for WT:DELPRO, WT:FFD, WT:PUF, WP:MCQ, or anything else that I can think of.\n\nAnother user whom I know has had several of his photos deleted at FFD and PUF because they depicted copyrighted historical markers in the US state of Indiana.  I've recently been in contact with a representative from the state agency that owns the copyright, and it appears that they're soon to release almost all rights (requiring only attribution) to the markers — in large part because they want us to be able to use the markers under terms compatible with CC-by-sa-3.0.  If they do this, how should I go about working for undeletion?  WP:REFUND doesn't restore pages deleted for copyright reasons, and because the deletions were correct when they were performed, WP:DRV wouldn't be the right place to go.  [[User:Nyttend|Nyttend]] ([[User talk:Nyttend|talk]]) 15:49, 23 March 2012 (UTC)\n\n:Uploading them again would seem to be the best means of going forwards. Is that possible? --[[User:Tagishsimon|Tagishsimon]] [[User_talk:Tagishsimon|(talk)]] 16:01, 23 March 2012 (UTC)\n: If the state agency publicly announces the release (e.g. by posting it on their official state government website), you could just ask an administrator to undelete them; where at [[WP:REFUND]] does it say they won't undo a copyright-releated deletion once a copyright release is obtained? If the release isn't publicly announced, you'd have to go through the process detailed at [[Wikipedia:Volunteer Response Team]], and they will undelete once they are satisfied the release is genuine. [[User:Anomie|Anomie]][[User talk:Anomie|⚔]] 16:48, 23 March 2012 (UTC)\n:: Also, for that matter, point 3 under [[WP:DRV#Principal purpose – challenging deletion decisions]] would seem to apply here: release from the copyright holder could be considered \"significant new information\". [[User:Anomie|Anomie]][[User talk:Anomie|⚔]] 16:52, 23 March 2012 (UTC)\n:::The note I got said that the agency's website would be updated, so I'll just be able to point to that; by the way, I'd overlooked the \"significant new information\" bit.  Not sure that reuploading would be useful, since some of these images were uploaded years ago and deleted months ago.  Incidentally, would it matter if I restore them myself once the agency's website is updated?  I don't think that it would be controversial, but I just feel slightly odd undoing some discussed deletions by myself.  [[User:Nyttend|Nyttend]] ([[User talk:Nyttend|talk]]) 16:58, 23 March 2012 (UTC)\n::::Yes. IAR and restore them yourself. Clearly the basis for their deletion will have gone away. --[[User:Tagishsimon|Tagishsimon]] [[User_talk:Tagishsimon|(talk)]] 17:18, 23 March 2012 (UTC)\n:::::Just to support this, I don't bat an eye at restoring content that was deleted only for copyright reasons when permission comes in. It doesn't happen ''all'' the time, but not that infrequently. :) --[[User:Moonriddengirl|Moonriddengirl]] <sup>[[User talk:Moonriddengirl|(talk)]]</sup> 19:29, 23 March 2012 (UTC)\n::: If discussion is desired or if the user is unable or unwilling to restore on her/his own, I suggest DRV over REFUND. It's meant for evaluating deletions, and if undeletion is obviously correct and non-controversial, someone will ''speedy restore'' to shortcut [[WP:BURO]]. [[User:Flatscan|Flatscan]] ([[User talk:Flatscan|talk]]) 05:35, 24 March 2012 (UTC)\n\n== WP:CSD file criteria ==\n\nHow about adding an extra criteria to [[WP:CSD]] under the Files category for images that have such a low resolution that they would be unuseable in an article. Something like below 80px perhaps, or lower, and include freely licensed and non-free files here that have no useful purpose? [[User:Cloudbound|Cloudbound]] ([[User talk:Cloudbound|talk]]) 00:48, 24 March 2012 (UTC)\n\n:New CSD criteria are normally proposed at [[WT:CSD]].  Be sure to read the FAQ at the top of that page so you can be prepared to answer the long list of usual objections.  [[User:WhatamIdoing|WhatamIdoing]] ([[User talk:WhatamIdoing|talk]]) 01:16, 24 March 2012 (UTC)\n\n== Meta:Global_bans ==\n\nhttp://meta.wikimedia.org/w/index.php?title=Talk:Global_bans&diff=3588548&oldid=3405149\n\nI'm hear to spread awareness of [[meta:Global_bans]]. Anyone wishing to critique or comment on the draft global policy may do so at [[meta:Talk:Global_bans]]. Help with translating the draft into other languages would and with spreading word to other projects also be appreciated. --[[User:Michaeldsuarez|Michaeldsuarez]] ([[User talk:Michaeldsuarez|talk]]) 02:30, 24 March 2012 (UTC)\n\n== Incredibly light punishments for sockpupptors ==\n\nBy the looks of things, it seems that the worst that can happen to sockpuppetors (no matter how much disruption they cause, is a block. How is this meant to prevent them from trying. A person can make 10, 20 or even 50 accounts with a single IP. Each account requires a final warning before being blocked. Stealthy vandalism can stay for hours and hours. If an IP does get blocked, they can simply get a new one. Not many vandals/sockpuppetors are scared of a simple block.--[[User:WOLfan112|<font color=\"gold\">User</font><font color=\"green\">WOLfan112</font>]] [[User talk:WOLfan112|<font color=\"blue\">Talk</font>]] 15:35, 25 March 2012 (UTC)\n:Individuals evading an existing block (either by creating one or more new accounts, or by editing while logged out) can be blocked immediately, on sight&mdash;there's no need or requirement to issue one or more warnings in such a case.  Articles which are subject to repeated frequent or particularly insidious vandalism can be [[WP:SEMI|semi-protected]] to prevent editing by logged-out editors and newly-registered accounts.  If you are having difficulty with an individual evading blocks for vandalism, you should be able to get help from an administrator at [[WP:AIV]] or [[WP:ANI]].  To request (semi-)protection of a page, you can go to [[WP:RPP]].   [[User:TenOfAllTrades|TenOfAllTrades]]([[User_talk:TenOfAllTrades|talk]]) 17:23, 25 March 2012 (UTC)\n\n::What other mechanism is there apart from a block or page protection? Sending an electric shock to their keyboard? Not likely. It is just a question of wearing them out now. Or once sanity prevails, the implementation of flagged revisions, once again. [[User:History2007|History2007]] ([[User talk:History2007|talk]]) 20:28, 25 March 2012 (UTC)\n\n:::Would WMF '''<big>ever</big>''' consider taking legal action for sockpuppeting (this is not a legal threat, it is a simple suggesion. AGF and don't block me).--[[User:WOLfan112|<font color=\"gold\">User</font><font color=\"green\">WOLfan112</font>]] [[User talk:WOLfan112|<font color=\"blue\">Talk</font>]] 20:42, 25 March 2012 (UTC)\n\n::::[[WP:NLT|NLT]] is about threatening legal action yourself, not questioning whether the WMF would take action on someone else. Anyway, probably not. I'm using 'probably' fairly loosely here. &nbsp; &mdash; [[User:Mann_jess|<b>Jess</b>]]<span style=\"margin:0 7px;font-variant:small-caps;font-size:0.9em\">&middot; [[Special:Contributions/Mann_jess|&Delta;]][[User_talk:Mann_jess|&hearts;]]</span> 02:36, 26 March 2012 (UTC)\n\n:::::Serious topic here. Would appreciate it if u didn't make any jokes. So, would WMF (wikimediafoundation) sue u for sockpuppetry. Please make it a centralized discussion.--[[User:WOLfan112|<font color=\"gold\">User</font><font color=\"green\">WOLfan112</font>]] [[User talk:WOLfan112|<font color=\"blue\">Talk</font>]] 15:36, 26 March 2012 (UTC)\n\n::::::I wasn't joking. The WMF is never going to start suing when users register multiple accounts. It doesn't have the budget for that, among other issues. You're welcome to ask this in a broader venue if you'd prefer, but I imagine you'll get the same answer. &nbsp; &mdash; [[User:Mann_jess|<b>Jess</b>]]<span style=\"margin:0 7px;font-variant:small-caps;font-size:0.9em\">&middot; [[Special:Contributions/Mann_jess|&Delta;]][[User_talk:Mann_jess|&hearts;]]</span> 15:43, 26 March 2012 (UTC)\n{{od}}Also, I'm pretty sure the judge would throw the case out.  What are we going to sue them for?  It's not like they're breaking any government laws.  [[User:Ian.thomson|Ian.thomson]] ([[User talk:Ian.thomson|talk]]) 16:03, 26 March 2012 (UTC)\n\n:Because of the chilling effect, I don't see it happening, even if it were to be a source of revenue. It seems we pretty much have to rely on [[karma|karmic justice]]. [[User:LeadSongDog|LeadSongDog]] <small>[[User talk:LeadSongDog#top|<font color=\"red\" face=\"Papyrus\">come howl!</font>]]</small> 16:40, 26 March 2012 (UTC)\n\n::You asked \"What are we going to sue them for?\". Well, can't WMF sue them for breaking policy and \"MISUSE OF WIKIPEDIA\".--[[User:WOLfan112|<font color=\"gold\">User</font><font color=\"green\">WOLfan112</font>]] [[User talk:WOLfan112|<font color=\"blue\">Talk</font>]] 16:46, 26 March 2012 (UTC)\n\n== SPI fishing question ==\n\nIf a vandal has admitted on-wiki to using multiple accounts, but hasn't disclosed their names, could an SPI be filed, or would that be considered fishing? Thanks. &nbsp; &mdash; [[User:Mann_jess|<b>Jess</b>]]<span style=\"margin:0 7px;font-variant:small-caps;font-size:0.9em\">&middot; [[Special:Contributions/Mann_jess|&Delta;]][[User_talk:Mann_jess|&hearts;]]</span> 02:34, 26 March 2012 (UTC)\n\n:Using Checkuser for an admited sock where the sockmaster is not known is [[WP:NOTFISHING|not fishing]]. [[User:Singularity42|Singularity42]] ([[User talk:Singularity42|talk]]) 02:53, 26 March 2012 (UTC)\n\n::Ah, I must have missed that in my previous reading. I should have double-checked again. Silly me. Thanks for the help! :) &nbsp; &mdash; [[User:Mann_jess|<b>Jess</b>]]<span style=\"margin:0 7px;font-variant:small-caps;font-size:0.9em\">&middot; [[Special:Contributions/Mann_jess|&Delta;]][[User_talk:Mann_jess|&hearts;]]</span> 03:30, 26 March 2012 (UTC)\n::Even by the definition, it should be obvious - if the sockpuppet has admitted it, then there is credible evidence for sockpuppetry. [[User:Od Mishehu|עוד&nbsp;מישהו]] [[User talk:Od Mishehu|Od&nbsp;Mishehu]] 12:13, 26 March 2012 (UTC)"}]}}}